[
    {
        "title": "completely lost on my dads birthday request",
        "selftext": "my dad is crazy and asked me if i would make this for his birthday... i make a wonderful cake but i dont know how to make a monstrosity like that lmao. any tips or ideas?",
        "num_comments": 386,
        "comments": [
            {
                "author": "hardly_werking",
                "body": "This is creepy as fuck, but I would personally do the train part in cake, the satanic part in rice krispies treats and then cover with fondant."
            }
        ]
    },
    {
        "title": "60+ year old \"fudge pie\" recipe doesn't work anymore. Can anyone think of why?",
        "selftext": "This recipe has been a staple at Thanksgiving for at least 60 years. My mom grew up making it, I grew up making it. My grandma taught us the recipe.\n\nThe recipe is very much a grandma recipe.\n\n>Fudge Pie\n>1/2 stick butter\n>2 eggs\n>1/2 cup evaporated milk\n>1 1/2 cup sugar\n>3 tbsp cocoa\n>vanilla\n>Stir ingredients,  do not beat. Bake at 350 for 30 minutes.\n\n\nThe way we used to make it was to stir everything together then cut the butter in to small bits and sprinkle on top. It would bake, and be a delicious pie that was like a custard texture that tasted like a brownie with a crunchy top. The amount of vanilla is one cap full.\n\n\nThen, probably about 15-20 years ago it took the pie 45 minutes to bake right. About 10 years ago we can't get it to set. We used to be able to cut into while still warm, and it was set. If we try that now, it's chocolate soup. Delicious, but completely soup. The top looks like it should, but it's not set. Even if we let it cool, it doesn't set. We can leave it in the oven until the crust is black, and it is still soup.\n\nThe method hasn't changed so that makes me think something about the ingredients has changed. I know eggs have gotten larger. I have tried 1 egg, I have tried medium eggs. It still doesn't work. The closest I can get is with medium eggs, but the pie has to be refrigerated before it will set. Now I can't even find medium eggs in the stores anymore. The pie never needed to be cooled to set until relatively recently. \n\nI have tried cold butter, soft butter, melted butter. It will not set.\n\nWe always use the same brand of cocoa, vanilla, and evaporated milk that my grandma told us to use.\n\n\nWe would make this pie with her so we know she wasn't pulling any shenanigans like giving us a bad recipe. My grandma died around the time the pie completely stopped working, so my mom and I can't ask her what's going on.\n\n\nWe really want our fudge pie back on the table for Thanksgiving. Can anyone figure out why this recipe no longer works when it was such a good recipe before? We don't want another chocolate lava pie. Though at least this failure is delicious, we just want our fudge pie back.\n\nEdit: https://old.reddit.com/r/Old_Recipes/comments/1gqwh7k/fudge_pie_my_grandma_would_always_make_for/\n\nProof there is no flour/starch and grandma wasn't hiding the flour lol\n\n\n\nFINAL EDIT:\n\nI have made 6 pies in the past 24 hours. All but two were soup. The last two... the very last two were a success.\n\n\nAs I was staring into the oven on the last pie I realized what is going on. I saw the bastard that has ruined so many pies.\n\n\nIn my grandma's oven, the rack was in the middle. There were only 3 slots to place the rack in her oven. I have 5. The antique oven in the house I used to live in had 3. The 1970s oven that baked the pie correctly had 3. As I stared with sheer contempt as the massive size of the modern oven compared to the hot box dinosaurs that used to bake this pie perfectly, I realized the smaller ovens, the middle rack setting was closer to the heating element, with an element that wasn't under a sheet of metal, but on display proudly mere inches away from the rack. I cursed my bastard oven and all the other ovens that failed me. How dare they be so large. My grandma's oven could barely fit a turkey on the bottom rack. My grandma's oven was as old as I was when she taught me to make this stupid pie. All the other ovens I used that this recipe worked were older than I was. The ovens my mom used that baked this recipe correctly were older than me, and failed in newer, larger ovens.\n\n\nIt wasn't setting because of mixing method, ingredients, crust, or pie pan. It wasn't close enough to the fucking heating element.",
        "num_comments": 465,
        "comments": [
            {
                "author": "what_the_actual498",
                "body": "My guess would be maybe the moisture content in your butter? I’d recommend you try using a different brand. I believe that European style butters tend to have lower water content which may help in this case. Good luck!"
            }
        ]
    },
    {
        "title": "what kind of pastry would be needed for something like this?",
        "selftext": "(photo off of pinterest)\nlike it’s not flaky but it’s hard? thanks in advance :)",
        "num_comments": 82,
        "comments": [
            {
                "author": "pandada_",
                "body": "It’s just normal bread dough that has been rolled thin. Any recipe would work, including brioche"
            }
        ]
    },
    {
        "title": "Maintaining artificial coloring while baking bi-color croissants",
        "selftext": "Hello!! I’m baking croissants with spirulina coloring. Also juava and raspberry powders in the dough. \n\nAny tips for maintaining the color while baking? I assume a lower temperature, steam assisted, and possibly a low fat/protein pre-wash.\n\n Any other suggestions? As always, thank you!",
        "num_comments": 299,
        "comments": [
            {
                "author": "CobeSlice",
                "body": "Please stop reporting this post for mental anguish. Lmao."
            }
        ]
    },
    {
        "title": "I baked a cake and forgot to add the apples.",
        "selftext": "Hi everyone!\n\nSo, I was doing some baking, and I popped my cake in the oven—only to realize when it was already more than halfway done that I totally forgot to add the apples! I know, rookie mistake, especially since I usually read the recipe more than once! \n\nAny ideas or suggestions for how I can still use the apples and enjoy them with my cake? Would love to hear your thoughts!",
        "num_comments": 89,
        "comments": [
            {
                "author": "Accomplished-Kick111",
                "body": "Cook the apples in a cast iron pan with some butter and brown sugar until they are soft, then serve it as a sauce with your cake."
            }
        ]
    },
    {
        "title": "Why does my panna cotta have an areola?",
        "selftext": "Husband asked for lavender panna cotta for his birthday. I made a couple test batches and both came out like this? The taste and texture came out fine but I guess the food coloring is settling weird in the mold? Husband thinks it’s hilarious but this isn’t really how I pictured the final product… I followed the recipe exactly except I used about 2 tsp of gelatin powder instead of gelatin sheets\n\nRecipe: https://jajabakes.com/lavender-panna-cotta/",
        "num_comments": 279,
        "comments": [
            {
                "author": "wheres_the_revolt",
                "body": "I’m sorry but I love your jiggly boob panna cotta 🤣"
            }
        ]
    },
    {
        "title": "Corn Bread I made at work has a massive hole in it. Only happens when baked in loaf molds! Could it be too much oil or flour?",
        "selftext": "The recipe includes 2 lbs each of bread, cake, and corn flour; plus 3 quarts of vegetable oil. ",
        "num_comments": 87,
        "comments": [
            {
                "author": "froghorn76",
                "body": "Surely that’s not the entire recipe. Salt? Leavening? Sugar? Other liquid?"
            }
        ]
    },
    {
        "title": " Buttercream turned gray overnight! Why?!",
        "selftext": "",
        "num_comments": 97,
        "comments": [
            {
                "author": "zonaljump1997",
                "body": "Try the gray stuff, it's delicious"
            }
        ]
    },
    {
        "title": "I've been whipping the eggs for half an hour. What did I do wrong?",
        "selftext": "Clean bowl, added a pinch of salt, didn't ad the sugar until it was already getting the consistency. maybe the whites were a little colder than room temperature.",
        "num_comments": 344,
        "comments": [
            {
                "author": "RiaBomb",
                "body": "If your bowl or whisk had any fat/grease on it, that may be the reason this happened.\n\nYou have my respect for whipping this manually. 💪"
            }
        ]
    },
    {
        "title": "Food dye on loaf cakes? ",
        "selftext": "hi!! does anyone know how i can dye the top of my baked goods like this? i have a similar pan to her’s but with pumpkins (i love nordic ware!!!). in the comments she said she uses organic food dye but doesn’t mention how she paints it. (it’s an apple and cinnamon loaf and her tiktok is julii.fnz if that’s relevant)",
        "num_comments": 66,
        "comments": [
            {
                "author": "Mr_Night78",
                "body": "She may have dyed a small portion of batter/dough and dollaped it into the mold, then layered on the rest in a normal color."
            }
        ]
    },
    {
        "title": "Why did my apple cake turn this colour? Also, is it safe to eat?",
        "selftext": "Ingredients:\n\n4 Apples\nWater as required\n1 Cup Wheat Flour\n1 Teaspoon Cinnamon Powder\n1 Teaspoon Baking Powder\n1 Teaspoon Baking Soda\n2 Tablespoon Corn Flour\n⅓ Cup Coconut Oil\n¾ Cup Sugar\n1 Teaspoon Vanilla Powder",
        "num_comments": 351,
        "comments": [
            {
                "author": "_lucidity",
                "body": "“Try the grey stuff, it’s delicious! Don’t believe me, ask the dishes!”"
            }
        ]
    },
    {
        "title": "What kind of frosting is this? My family’s go-to forever, seems similar to Ermine.",
        "selftext": "My mom has an old charity cookbook with this recipe in it, and she’s always used it growing up since we never liked American buttercream. \n\nIt seems similar to Ermine but isn’t cooked as you can see. I made actual Ermine for the first time yesterday and it’s very, very similar, but this recipe obviously uses a bit of shortening instead of all butter. Not sure if that is necessary or just a sign of the times. \n\nDoes this frosting have a proper name that I can research? I haven’t been able to find anything online, because it’s either Ermine (cooked), or some sort of Crisco frosting with confectioner’s sugar. It’s quite good and I just wanted to try to explore with it more! \n ",
        "num_comments": 303,
        "comments": [
            {
                "author": "ConstantPercentage86",
                "body": "I would personally not use raw flour in an icing.  Raw flour is a potential source of pathogens like e. coli.  If using this recipe, bake the flour in an oven first for a few minutes."
            }
        ]
    },
    {
        "title": "Putting warm cheesecake in fridge",
        "selftext": "For context, I’ve let it cool inside the oven for 1 hr with the door slightly open, then I took it out and it cooled for a further 30 minutes-ish. There is no crack so I think it did ok. It is midnight and I really need to go to bed after a long day so I couldn’t really wait any more like you’re suppose to wait 2 hrs to room temp.\n\nI decorated the cake with coulis and fresh berries, covered it and put it in the fridge. At this point the top is cooled but the bottom is still warm.\n\nNow I’m lying in bed thinking about condensation and cracking. Will my cake be ok? :(",
        "num_comments": 40,
        "comments": [
            {
                "author": "epidemicsaints",
                "body": "Cracks happen right away, as soon as it starts cooling it would have snapped open in less than 15 mins. You made it!"
            }
        ]
    },
    {
        "title": "I've gone and made 5 pounds of this pound cake and its all like this. Could they be useful for anything other than as building bricks?",
        "selftext": "For the record i do realize the error of my ways, at least somewhat. And despite how it looks, im actually fairly sure its not undercooked. Its firm, yet springy, moist but not gummy, and yet denser than a neutron star. Im not looking to save them, but i do want to know if i can make anything from them.",
        "num_comments": 533,
        "comments": [
            {
                "author": "WinifredZachery",
                "body": "I made a cake like that once. Tried cutting it thinly and baked it to make it into biscotti. Nearly chipped a tooth trying to eat them, they were so hard. Honestly, I‘m not sure there is anything you can do with this."
            }
        ]
    },
    {
        "title": "Very amateur baker here. My daughter wants me to make her birthday cake using this pan. Best way to get it out in one piece and keep the shape?",
        "selftext": "Also tips for when it comes time to icing it? Thank you!",
        "num_comments": 188,
        "comments": [
            {
                "author": "katiegam",
                "body": "I'd recommend making some Cake Goop - mix equal parts of shortening, oil, and flour, mix until it's a smooth paste, and then use a pastry brush to paint onto the cake pan. This will ensure that it doesn't stick. \n\nYou'll need a large cake board to place the cake on. After it's finished baking, let cool for about ten minutes, and then place the cake board on top. With one hand on the bottom of the cake board, pull the cake pan towards the edge of the counter. With your other hand (wearing an oven mitt), flip it over onto the cake board. Tap lightly on the top and slowly remove the cake pan. \n\nWilton has a \"map\" for this cake pan to follow with icing if you're up for the tedious but pretty easy task of using piping tips. Here's that link. [https://wilton.com/teddy-bear-cake/wlproj-2455/](https://wilton.com/teddy-bear-cake/wlproj-2455/)"
            }
        ]
    },
    {
        "title": "What is this top layer called?",
        "selftext": "When I was a kid, I used to have chocolate cale with this top layer of chocolate (like in the picture above) that you could peel off and eat. I remember it being really delicious and would love to know: what is it, and how do I make it??",
        "num_comments": 85,
        "comments": [
            {
                "author": "KetoLurkerHereAgain",
                "body": "Looks like ganache."
            }
        ]
    },
    {
        "title": "Accidentally put piping tip set in oven",
        "selftext": "They were stored in this plastic case and it all melted down. What’s the best way to get these little tips out? 😩\n\nPlease excuse my stupidity.",
        "num_comments": 122,
        "comments": [
            {
                "author": "epidemicsaints",
                "body": "Try putting it in the freezer, it should contract everything and pop the plastic off the metal."
            }
        ]
    },
    {
        "title": "oily buttercream frosting ??",
        "selftext": "is there a way to fix this ? i dont know if its because of the gel food coloring or what :/",
        "num_comments": 604,
        "comments": [
            {
                "author": "None",
                "body": "[deleted]"
            }
        ]
    },
    {
        "title": "Baked an apple pie for tomorrow, do I store on the counter or in the fridge?",
        "selftext": "My first ever pie from scratch! How should I store this over night for tomorrow? It’s still a bit warm but letting it cool on the counter. ",
        "num_comments": 109,
        "comments": [
            {
                "author": "srt1955",
                "body": "store on  (  MY  ) counter  , bring ice cream ."
            }
        ]
    },
    {
        "title": "Dude why did my choc chip butterscotch cookies turn out like something that looks like old ballsacks?",
        "selftext": "Toll house recipe followed to a T.  Perhaps my baking soda is a bit.....outdated?  I've succeeded many cookie missions before but what the heck is this traveschamocery?  At least they taste good",
        "num_comments": 358,
        "comments": [
            {
                "author": "henrickaye",
                "body": "Looks like the dough was too wet - either not enough flour or too much butter or eggs. I don't think the leavener was dead, I think I see little air bubbles in the 2nd pic. What recipe did you follow?"
            }
        ]
    },
    {
        "title": "Buttercream advice please",
        "selftext": "Hi! I am a newly self-taught, amateur baker. I only started baking just to see if I could do it, and I’ve come to love it, and love learning new things. I’ve only been baking for maybe 6-8 months and I only bake for friends and family. I feel like the buttercream recipe I use tastes very nice, but I struggle to get a smooth texture, which leaves bubbles in my buttercream (as you can see in the attached photo of a boba tea cake I made). Is there any advice on how to create a smooth, air-free American buttercream or at least on the final layer on a cake?",
        "num_comments": 70,
        "comments": [
            {
                "author": "battleshipcarrotcake",
                "body": "This is adorable!\nWarm your spatula, it slightly melts the buttercream."
            }
        ]
    },
    {
        "title": "Strawberry shortcake help",
        "selftext": "Hi trying to recreate a recipe like this for Easter. How do I achieve something like this? Do you make a standard 9x11/ 11x13 rectanglular cake, divide into 3 layers, add strawberry filling in between. Just wondering how to get it so crisp and what filling you think was used. ",
        "num_comments": 79,
        "comments": [
            {
                "author": "Garconavecunreve",
                "body": "You won’t achieve something like this.   \n\nThis is made by a Food-stylist for the sole purpose of the picture being taken and then cleaned up with after-effects. Harsh but the truth. \n\nNow to what you can do: find a high-rated Japanese sponge cake recipe (the picture definitely uses a sponge and not a traditional shortcake), adapt ratios to a rectangular pan and height.  \nBake and level.   \nMake a stabilised whipped cream and cut strawberries. \nAssemble as desired. \n\n[This recipe](https://japan.recipetineats.com/japanese-strawberry-sponge-cake-strawberry-shortcake/) might be a good starting point"
            }
        ]
    },
    {
        "title": "Can anyone tell me what type of frosting is on my two favorite donuts that now no longer exist! The bakery that used to make them switched to buttercream and I’m very sad! This was lighter and not as sweet as buttercream. Pure white, shiny, silky, smooth and delicious.",
        "selftext": "",
        "num_comments": 309,
        "comments": [
            {
                "author": "epidemicsaints",
                "body": "Rich's Bettercreme strikes again. It comes frozen in a carton. You thaw it and whip. It's in between Cool Whip and a more stable frosting. It can be hard to find, it's a commercial product sold by the case."
            }
        ]
    },
    {
        "title": "Help me find similar cookie cutters that don't create any wastage. ",
        "selftext": "Credit to AQUA3DLAB on Etsy for this design. \n\nI'm new to baking and having to stamp individual cookies seems crazy to me. I'm looking for similar cookie cutters with different shapes. ",
        "num_comments": 50,
        "comments": [
            {
                "author": "afriendincanada",
                "body": "I mean there’s no wastage from a regular cutter, you just reroll the dough\n\nAnyway. If you google “tessellated cookie cutters” there’s lots of suggestions"
            }
        ]
    },
    {
        "title": "My toffee didn't just seperate, it full on got divorced!",
        "selftext": "I've had one separate on me before but it was minor and I was able to use it. Not this one, it full on split! I did everything the same as always. Same ingredients, same pan, same whisk etc. I tried bringing it back together but it just got worse. Why? Could it be the butter? Should it be room temperature before I use it? Argh, what a waste. I'm bummed.",
        "num_comments": 114,
        "comments": [
            {
                "author": "halfwaygonetoo",
                "body": "After making toffee for 40 years, I've had every reason for a bad batch that you can think of. At this point, I believe that the candy fairies like to play jokes on me from time to time. \n\nTo stop separations or crystals forming: add 1 to 2 Tablespoons of corn syrup. \n\nTo avoid a \"burnt\" taste and smell, cook it on medium heat. Nothing higher but don't go lower than medium low heat. \n\nAdd your nuts in about 5 minutes before it reaches the right taste/temperature. They will still give the correct flavor without becoming to hard. \n\nTo make the candy easier to bite into: add 1 tablespoon of baking soda to the pan *(after you have added all the other ingredients)*. Stir VERY well. The candy will foam up. But that's what you want. Baking soda adds air pockets to the candy making it easier to eat."
            }
        ]
    },
    {
        "title": "Help! I tried making chocolate whipped cream but over whipped it, now the liquid and solid is completely separated",
        "selftext": "I’m out of heavy whipping cream now so I’m not sure what to do\n\nI tried adding the last of my heavy cream and then mixing it in with a spatula but that didn’t seem to do much so I tried whisk again but nothing is working so I just put it in the fridge\n\nI just pulled it out of the fridge and idk where to go from here. Should I try adding heat? Maybe putting it in the microwave and then mixing it with a spatula/whisk? \n\n",
        "num_comments": 322,
        "comments": [
            {
                "author": "emarxist",
                "body": "you made chocolate butter. sorry, I don’t think there’s anything you can do to save it at this point."
            }
        ]
    },
    {
        "title": "What made my cinnamon rolls do this? ",
        "selftext": "The inside layers didn’t really fluff up, and have lots of gaps. Maybe rolled too tightly or rolled out too thin? ",
        "num_comments": 133,
        "comments": [
            {
                "author": "hamngr",
                "body": "Either your yeast was dead, your water too hot or didn't prove them."
            }
        ]
    },
    {
        "title": "2-3 decade old spice, unopened. Use?",
        "selftext": "One of those things I found in the parent's cabinet. I just opened the seal and it has a nice smell (I think it's the normal nutmeg smell, but I never used this spice before). I know ground spices only last a couple years but can I just use a little more to make up for the potential loss in flavor, or do you recommend I get a new one? Prob use it in a carrot cake",
        "num_comments": 463,
        "comments": [
            {
                "author": "afriendincanada",
                "body": "r/eatityoufuckingcoward"
            }
        ]
    },
    {
        "title": "Why do my cookies always turn into biscuits?",
        "selftext": "Every time I try to bake homemade cookies, they don't spread out as they cook so it's like only the outside gets cooked. The outside is also dry and burnt on the bottom.\n\nThe recipe I followed was: \n* 1 cup butter, 3/4 cup brown sugar, 3/4 cup white sugar, 1 egg. \n* 2 and 1/4 cup sifted flour, 3/4 baking soda and salt.\nThey were in the oven for 7 mins at 375F. ",
        "num_comments": 569,
        "comments": [
            {
                "author": "burritosarelyfe",
                "body": "Just judging by the photo it looks like your oven is too hot"
            }
        ]
    },
    {
        "title": "Anyone know why I am getting this gap between the top pie crust and the apples in my apple pie? Context / recipe in comment",
        "selftext": "",
        "num_comments": 313,
        "comments": [
            {
                "author": "ExtremePast",
                "body": "Apples cook down. The crust hardens.\n\nThe only way to avoid this is to use a pie recipe where you pre cook the filling before baking the pie."
            }
        ]
    },
    {
        "title": "How could I make these chocolate instead of strawberry?",
        "selftext": "Instead of the strawberry jam, could I use an instant pudding instead? Would it come out as a runny mess? I wanted to make these, but my wife has a preference for chocolate. A bunch of chocolate chips maybe?",
        "num_comments": 97,
        "comments": [
            {
                "author": "YourFriendInSpokane",
                "body": "Just be careful that they don’t end up looking like diapers somehow."
            }
        ]
    },
    {
        "title": "Baking brownies. The hell is this white stuff on my brownie?",
        "selftext": "",
        "num_comments": 78,
        "comments": [
            {
                "author": "CupcakeKim",
                "body": "Unmixed egg white?"
            }
        ]
    },
    {
        "title": "Hey everyone I need help!!!!",
        "selftext": " so I made a cake the other day and followed the instructions on the back of the box, just swapped the water for milk and added an extra egg. I baked it for a total of maybe 40-45 minutes, poked it and came out just right not watery or dry, left it out to cool down for a total of 30 minutes juss wrapped it in foil cause I didn’t have Saran wrap and put it in the freezer to cool for a total of 30 minutes. I took it out and it was fine, I decorated and frosted it and when I went to slice a piece and it came out very moist and full, not raw almost doesn’t look like bread but is bread juss very moist. Can someone help me???? Or did I juss create a very moist cake without knowing??",
        "num_comments": 289,
        "comments": [
            {
                "author": "pandada_",
                "body": "OP got his answer. Locking thread."
            }
        ]
    },
    {
        "title": "Cake layer with raspberry preserves turned green?",
        "selftext": "Is this mold? I am so confused. I was practicing a cake and I used raspberry and strawberry preserves on different levels of the cake. I cut it today and the level with raspberry has this geeenish look to it like mold but it’s not old and has only been room temp for 1 day. The timeline is baked / frozen/crumb coated thursday -final coat and decorating Friday(yesterday). It’s been room temp since Friday after decorating. \n\n1st photo is the layer with raspberry and 2nd is with strawberry",
        "num_comments": 99,
        "comments": [
            {
                "author": "Pojratbi",
                "body": "Not mold. Anthocyanin. Raspberries contain anthocyanin. It changes color in different pH, red in acidic, blue-green in bases."
            }
        ]
    },
    {
        "title": "Cookbook made an error and omitted cream from the ingredients even though it's in the recipe. How much cream do you think this recipe is supposed to have?",
        "selftext": "",
        "num_comments": 198,
        "comments": [
            {
                "author": "None",
                "body": "[deleted]"
            }
        ]
    },
    {
        "title": "First time making macrons and they’re hideous",
        "selftext": "What did I do wrong? 😭",
        "num_comments": 234,
        "comments": [
            {
                "author": "sweet_carrie_",
                "body": "They’re rustic!\n\nBut a bit over mixed - a good test I’ve found is to take a spoonful of batter out and drop it back in the bowl, it should about 10 seconds to fully incorporate back in.\n\nAlso the line going through the tray could mean you didn’t bang it against the counter hard enough before they went in - I drop it straight down from like 8” high 3-4 times. My dog hates it."
            }
        ]
    },
    {
        "title": "First attempt at making Snickerdoodles. They came out thin and crispy instead of soft and chewy. I'm trying to figure out what went wrong.",
        "selftext": "",
        "num_comments": 193,
        "comments": [
            {
                "author": "pandada_",
                "body": "Your butter might have gotten too warm so the cookie spread, esp if you didn’t chill it at all"
            }
        ]
    },
    {
        "title": "What frosting is my bf talking about?",
        "selftext": "My bf, who is notoriously “not a sweets guy” as he puts it, requested a chocolate cake with chocolate frosting for his 21st birthday next weekend. I was surprised because I wasn’t expecting that from him! I would love to make him one, but I can’t figure out what kind of frosting he wants. He said “you know, the kind of frosting that gets a little crispy on the outside but soft on the inside! It goes good with a big glass of cold milk.” \n\nI looked up different frostings today and wow I didn’t realize how many there are! I think maybe he’s talking about American buttercream, but I’m worried it will be too sweet. Can anyone confirm this or suggest a different frosting? \n\n\nUPDATE: wow thank you guys so much for all the suggestions, I learned so much!! I showed him all your replies and he decided he wants a chocolate ganache, so that’s what I’m going to make. :) ",
        "num_comments": 278,
        "comments": [
            {
                "author": "AnnasOven",
                "body": "That's called a crusting buttercream, and yes it usually means American buttercream. Which is surprising he'd request it since usually American buttercream is very sweet, though it being chocolate will help with that."
            }
        ]
    },
    {
        "title": "Getting pumpkins ready for pumpkin bread, why does it look like this after the instant pot? Is it safe to eat?",
        "selftext": "",
        "num_comments": 46,
        "comments": [
            {
                "author": "tleeemmailyo",
                "body": "It’s a type of “sap” that pumpkins, sweet potatoes, etc. will sometimes ooze out when cut. It’s basically a combo of sugar, starch, and moisture. It usually indicates a nice, sweet pumpkin!"
            }
        ]
    },
    {
        "title": "What kind of crust would this tart be made with?",
        "selftext": "",
        "num_comments": 28,
        "comments": [
            {
                "author": "pastyrats",
                "body": "i’m guessing it’s pâte sablée recipe, basic tart dough recipe. note: this recipe is best started like at least 2-3 days in advance of using/baking"
            }
        ]
    },
    {
        "title": "First time making buttercream- it tastes smooth and not grainy at all, but it looks grainy!! Any idea where I could have gone wrong?",
        "selftext": "",
        "num_comments": 140,
        "comments": [
            {
                "author": "jkinatl2",
                "body": "While I understand the comments I have to say that this looks like something my mom would have made for me. No swirly frosting, no sprinkles, just a wholesome and simple delicious cupcake. Most photos of cupcakes don’t actually make me want a cupcake, but for some reason this absolutely does."
            }
        ]
    },
    {
        "title": "Hard, bitter bits inside baked vanilla cake. What could this be?",
        "selftext": "Hi friends,\n\nCan anyone take a guess as to what these hard, bitter bits are that form in my baked vanilla cakes at work? These clumps form and sink to the bottom of the pans. I put nothing else in the batter besides the following ingredients:\n\n-Butter \n-Sugar\n-Egg yolks\n-milk\n-cake flour\n-ap flour\n-baking powder\n-salt \n\nIt’s weird as I’ve seen this happen before with this recipe but not every time. When I pick one out and eat it it feels hard/crunchy and tastes bitter. The recipe was mixed in a 30qt machine and when scooping out into pans nothing is visibly in the batter.",
        "num_comments": 324,
        "comments": [
            {
                "author": "LizDeBomb",
                "body": "Are you sifting your flour? If not, could be weevils o.o looks like baked weevils to me and they are sour/bitter when eaten."
            }
        ]
    },
    {
        "title": "How can I get my cookies like this pic?",
        "selftext": "So I’m trying to find a good cookie recipe and I found one I liked, but only the first time I made it. I have no clue on what I did but the cookies came out so good, almost exactly like the picture. I really surprised myself and they were honestly the best I’ve ever made. They were the perfect crunchy on the outside, soft in the middle, almost like a McDonald’s cookie but better. However this time around, I used the same recipe and my cookies came out way different. I’m assuming it’s the flour content, because the last time I made the recipe, I didn’t use the full amount of flour, as the author wrote that it may differ depending on how things looked, and the dough looked like it didn’t need the rest, however this time I just put all the flour. But the thing is, every cookie recipe I make comes out the same. I’ll comment a picture as I can’t post more than two, but they look like the picture, round, smooth, and a gross, wet, chewy, almost raw on the inside. But I took them out while the centers were still gooey, like the recipe said. And any longer they just become overbaked. So what am I doing wrong? ",
        "num_comments": 95,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "My father bought these lady fingers so I can make a tiramisu. But these don’t look like lady fingers to me",
        "selftext": "I was wondering if these were even lady fingers. They are thick and hard, not like any of the lady fingers I’ve seen. They didn’t absorb the coffee well either",
        "num_comments": 160,
        "comments": [
            {
                "author": "r-rb",
                "body": "Man fingers"
            }
        ]
    },
    {
        "title": "Chocolate Seal",
        "selftext": "My sister wants the hogwarts invitation for her birthday next month, with the chocolate ‘wax’ seal and I wanted to know what type of chocolate I can best use? I ordered the seal (stamp?) but I want to practice before executing…. Many TIA",
        "num_comments": 41,
        "comments": [
            {
                "author": "New-Flow-6798",
                "body": "Practice with the cheapy melting chocolates first. But I almost wonder if it would be easier to make “chocolate clay” It’s thicker and would be easier to stamp or at least less messy"
            }
        ]
    },
    {
        "title": "What did I do wrong with my cupcakes?",
        "selftext": "I made cupcakes from a Betty Crocker box kit and I've made them the same way I always make them as per the boxes instructions but something happened and I'm so confused 😭. Does anyone know what I could have done that would cause this? I've never seen this happen with boxed cupcakes or homemade 😭.",
        "num_comments": 229,
        "comments": [
            {
                "author": "pandada_",
                "body": "Seems like your oven temperature was a bit too high and the outside/tops cooked too fast. Did you put them in the middle rack?"
            }
        ]
    },
    {
        "title": "Tips for getting filling so perfect?",
        "selftext": "",
        "num_comments": 82,
        "comments": [
            {
                "author": "sadatomicpony",
                "body": "The berry filling(puree, setting agent, sugar, berries) is made in advance and frozen in silicone moulds/cake rings. The frosting in between layers is likely a gelatin stabilized mousse that you pipe, it's liquid enough to spread into a flat layer. Or it's a whipped ganache/cream cheese frosting, which you can pipe evenly and smooth out. The cake is assembled using a cake ring. \nOn the second picture the big white layer is either a mousse or a cheesecake, which you make in advance and freeze."
            }
        ]
    },
    {
        "title": "Dafuqami supposed to make with this pan?! ",
        "selftext": "My wife has had this forever but never knows how or what to make so I want to surprise her this year. Is this for chocolate molds? I’m lost here and any advice would be greatly appreciated!",
        "num_comments": 381,
        "comments": [
            {
                "author": "Adjectivenounnumb",
                "body": "Shortbread cookies?\n\nBeautiful pan, by the way.\n\nEdit: some more possible evidence that this is for shortbread, no idea where I pulled this info from. Maybe GBBO. I have never made shortbread anything in my life.\n\nhttps://www.nordicware.com/products/english-shortbread-pan/"
            }
        ]
    },
    {
        "title": "How can I make my cookies thinner and chewier?",
        "selftext": "The recipe I'm using doesn't need chill time which is why I like it but my cookies look nothing like the ones pictured. They're sstill very good and soft on the inside but I'd like to understand what I should do differently.\n\nThis is the recipe I'm using and ingredients: \n[https://moribyan.com/chocolate-chip-cookies/](https://moribyan.com/chocolate-chip-cookies/)\n\n1 cup unsalted butter 2 sticks\n1 1/4 cup brown sugar light or dark\n1/3 cup granulated sugar\n1 large egg + 2 egg yolks room temperature\n1 tablespoon vanilla extract\n2 cups all purpose flour\n3/4 teaspoon baking soda\n1 teaspoon salt\n1 cup milk chocolate chips\n1 cup semi sweet chocolate chunks",
        "num_comments": 225,
        "comments": [
            {
                "author": "JaBeBr",
                "body": "No advice just want to say these look SO delicious."
            }
        ]
    },
    {
        "title": "What did I do wrong?",
        "selftext": "I've finally been getting some good batches, but this one came out wonky. Any ideas on where I went astray?",
        "num_comments": 43,
        "comments": [
            {
                "author": "cancat918",
                "body": "I think you needed to drop the pan on the counter a few times before putting them in the oven, as if you were trying to wake up the neighborhood. Air bubbles caused them to lean like this. Otherwise they look really good, nice uniform color, very smooth, and I'm sure they taste delicious.♥️🤷‍♀️"
            }
        ]
    },
    {
        "title": "I want tight buns. Help?",
        "selftext": "I’m using the nytimes easy no-yeast cinnamon rolls recipe. They taste amazing, but I want them ‘tighter’ so all the filling doesn’t seep out when in the oven. Do I use a smaller baking dish? I’m rolling the dough pretty tightly but I guess I could try to squash it down even more?",
        "num_comments": 175,
        "comments": [
            {
                "author": "ayotus",
                "body": "theyre too chodey. make the sheet of dough thinner and longer and maybe add more butter so it sticks better. it just doesnt have the surface area to stick to itself"
            }
        ]
    },
    {
        "title": "Swiss Meringue frosting ",
        "selftext": "I'm making a double batch of Swiss Meringue Frosting (Sally's Baking Addiction) I have been whipping for nearly 30 mins and I'm at soft peaks. Is it possible to whip in batches at this point or should I keep going and hope my KA motor doesn't die on me lol I'm thinking maybe I have too many egg whites whipping at once. I'm whipping 12 egg whites with about 900grams of sugar. ",
        "num_comments": 45,
        "comments": [
            {
                "author": "epidemicsaints",
                "body": "That is definitely stiff. Look at the crisp traces on the sides and how pointy the tip is. When there is a lot of sugar in egg whites, \"stiff\" isn't so literal. When the tip goes from blunt to pointy, even if it droops over, it's stiff."
            }
        ]
    },
    {
        "title": "Getting sugar to 240F. Why is it taking so long?",
        "selftext": "I’m trying to boil my sugar to 240F, but it has been boiling for over 10min already and just made it above 200F. Is this normal to take this long? Or is my thermometer broken? ",
        "num_comments": 177,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "Help! Rhode Texas Roadhouse Rolls fell after proofing",
        "selftext": "Proofed rolls for 3 hours in a 75-80° area and they rose. After removing Saran Wrap (greased with Pam) they fell! This is how they baked up. What can we do to make sure the is doesn’t happen again?",
        "num_comments": 102,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "What's wrong with my millionaire shortbread?",
        "selftext": "Hi! I made millionaire shortbread for the first time. \nLink to recipe:\nhttps://preppykitchen.com/millionaires-shortbread/\n\nMy concern is the shortbread tastes fine but looks weird. The cut is also not that clean. I kept it refrigerated for 2 hours before I cut into it.\n\nNotes:\n- Shortbread was baked for 22 mins. The edges were golden brown once I removed from the oven. \n- The recipe is for a 9 inch pan but I reduced it (by doing maths) for a 8 inch pan.\n- I removed the caramel and poured it onto the freshly baked shortbread once it reached 107C/225F.\nFor the chocolate, I used 200g chocolate chips and 1/4 cup double cream (heavy cream).\n\nThanks in advance!",
        "num_comments": 151,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "I can’t make thick cookies! I try so hard. Thoughts?",
        "selftext": "Photo #1: recipe #1 expected outcome\nPhoto #2: my results for recipe #1.\nPhoto #3: recipe #2 expected outcome\nPhoto #4 : my results for recipe #2\n\nRecipe #1 https://houseofyumm.com/thick-chocolate-chip-cookies/#wprm-recipe-container-10198\nRecipe #2 https://www.seriouseats.com/super-thick-chocolate-chip-cookie-recipe\n\nAfter making a few batches of cookies over the past few weeks and having some weirdly excessive spreading vs. expectation, I picked 2 recipes to attempt to get actually thick cookies.\n\nI bought new baking soda and baking powder (just in case). I use Nordic Ware Naturals aluminum half sheets (as FYI).  I have an oven thermometer. My oven is accurate and maintains temperature well.\n\nI followed both recipes exactly* and weighed all of my dry ingredients.  I chilled both doughs overnight (14 hours or so), along with my cookie sheets.  I started creaming my butter when it hit 60F for recipe #1 and 58F for recipe #2. My kitchen was very warm (75-80 during the dough making) as I’d toasted sugar all day.\n\n* I did not include nuts in my cookies.  Recipe #1 called them optional, Recipe #2 did not.  I don’t like nuts in chocolate chip cookies.  Also, I used parchment paper. Recipe #1 said silicon baking mats.\n\nMy results are a disappointment on the thickness scale.  I also couldn’t get the internal temperature to the target range (175-185) on recipe #2 without darkening my cookies too much.  \n\nThey both taste great. Recipe #1 is my new favorite chocolate chip recipe.\n\nAny thoughts as to what might be wrong??",
        "num_comments": 375,
        "comments": [
            {
                "author": "None",
                "body": "I would try baking from frozen"
            }
        ]
    },
    {
        "title": "Why aren't poppy seed deserts more popular/ available in the US?",
        "selftext": "I spent last year living in Slovakia, and while my sweet tooth often suffered from lack of the sugary American treats I'm used to, I grew to love poppy seed delicacies of every kind (you name it - rolls, croissants, cakes, even sweet noodles could be found prepared with sweet poppy seeds). They're so good! Why are they seemingly impossible to find back home? I can't be the only one that would be partaking if they were more widespread. ",
        "num_comments": 303,
        "comments": [
            {
                "author": "z_iiiiii",
                "body": "I completely agree. I love poppyseeds and they are rarely used other than the lemon/poppy combo, which is not the only thing poppy goes with!"
            }
        ]
    },
    {
        "title": "Why do my pancakes burn even on the lowest heat?",
        "selftext": "Brit here trying to make the perfect American fluffy pancakes, but even when I put the heat as low as possible (gas stove) they always burn before I get the bubbles. \n\nUsing this the BBC recipe that I will link in the comments, not sure if the problem is with the recipe or my stove or something else?? I've tried flipping them earlier but the top isn't set so it goes everywhere. I'm also not sure why I get the little dark line around the edge instead of it being golden in the middle and paler around the edge. Any help appreciated!\n\nRecipe:\n135g/4¾oz plain flour\n1 tsp baking powder\n½ tsp salt\n2 tbsp caster sugar\n130ml/4½fl oz milk\n1 large egg, lightly beaten\n2 tbsp melted butter",
        "num_comments": 744,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "Why are my slutty brownies still not done?",
        "selftext": "Original i baked them at 320F for 30 mins then let them cool for 30 mins. When i stuck my knife in it, it still hadn’t firmed up. I put them back in the oven for 15mins at 365 and it looks like this (the picture above). This is an order for my roommate so I dont want her to eat anything raw😭 any advice?",
        "num_comments": 97,
        "comments": [
            {
                "author": "Secret_StoopKid",
                "body": "I would have expected them to be in at 360 for that entire time in order to finish"
            }
        ]
    },
    {
        "title": "Are these opened cookie decorations safe to keep for next year?",
        "selftext": "I bought a ton of sprinkles and other decorations for a cookie decorating event this month. I have all these containers left, most of them opened. Is it safe to keep these to use again next year?",
        "num_comments": 147,
        "comments": [
            {
                "author": "valueofaloonie",
                "body": "Yes. These kinds of things are basically good until the end of time."
            }
        ]
    },
    {
        "title": "COVID Unemployed Pastry Chef at your disposal!",
        "selftext": "Hello bakers!\n\nI've been laid off for what feels like forever. Finding this sub has really helped with not only my mental health, but also keeping my mind sharp.\n\nI have a disgusting large cookbook library at my disposal and plenty of free time, so please, ask away!\n\nWhat's your baking question? Searching for recipe comparisons? Need help troubleshooting? I'm here for you!\n\nHappy Holidays and happy baking!!\n\n\nedit: my kids just got home so I'll be jumping on and off of here throughout the evening!\n\nedit: the kids are basically feral tonight since it's the start of Christmas break here. I might be replying late/in the morning but I'm loving the questions. There's a few I'll be pulling books out for for sure!",
        "num_comments": 366,
        "comments": [
            {
                "author": "CobeSlice",
                "body": "While I love the idea of our bakers doing impromptu AMA's to help with holiday (or general) baking woes, this is a reminder that regardless of platform or avenue it is ***never*** acceptable to request recipes in this sub. If we see any (more) posts or comments doing so, they will be removed."
            }
        ]
    },
    {
        "title": "Why is there a lot of bubbles in the middle of my cake while baking? ",
        "selftext": "Temp is 350 and bake time is 25 minutes. Oven is older, but not ancient or anything. ",
        "num_comments": 117,
        "comments": [
            {
                "author": "AntonMaximal",
                "body": "Can't tell for sure, but the element being so bright makes me think it's still on over-power heating up stage. That can result in high uneven temperature - blasting radiant heat on the base of your pan.\n\nMaybe let the oven pre-heat a bit more.\n\nAlso you could try putting something to insulate the pan from the direct heat - like a tray on a lower shelf."
            }
        ]
    },
    {
        "title": "How is the outside not brown??",
        "selftext": "How are they baking these without them turning brown on the outside?",
        "num_comments": 160,
        "comments": [
            {
                "author": "epidemicsaints",
                "body": "My guess is steaming them like a christmas pudding. Even the way the bubbles appear in the surface, these look like steamed cakes to me."
            }
        ]
    },
    {
        "title": "What did I do wrong with my first Macarons Batch?",
        "selftext": "I've followed the recipe to the letter and everything looked alright when I put them in the oven at 356F /180°C. But after a minute the batter oozed out of the skin layer that had formed before. \nWhy did this happen? What can I do to prevent this the next time?\n\nThis was the recipe:\nMacaron Batter\n1 cup (125g) powdered sugar\n1/2 cup (50g) powdered almonds\n3 tbsp (25g) unsweetened cocoa powder\n2 large egg whites (66g) , at room temperature\npinch of salt\n5 tbsp (75g) granulated sugar\n\nInstructions\nPrepare the chocolate macaron shells.\nPreheat oven to 350ºF (180ºC).\nLine two baking sheets with parchment paper and have a pastry bag with a plain tip (about 1/2-inch, 1cm) ready.\nGrind together the powdered sugar with the almond powder and cocoa so there are no lumps; use a blender or food processor. Then sift the mixture into a large bowl and discard the larger lumps.\nUsing a mixer beat the egg whites until they begin to rise and hold their shape. While whipping, beat in the granulated sugar until very stiff and firm, about 2 minutes.\n\nFold the dry ingredients, in two batches, into the beaten egg whites with a rubber spatula. When the mixture is smooth and there are no streaks of egg white, stop folding and scrape the batter into the pastry bag. The macaronage is ready when the batter falls off the spatula in a thick ribbon and starts to settle into the rest of the batter after about 20 seconds. Be cautious not to overmix, as this can lead to flat macarons. \nPipe the batter on the parchment-lined baking sheets in 1-inch (2.5 cm) circles evenly spaced 1-inch (2.5cm) apart.\nRap the baking sheet a few times firmly on the countertop to flatten the macarons, and remove air bubbles. Allow the macarons to sit for 20 to 30 minutes until a “skin” forms and they are no longer wet when lightly touched.\n\nBake them for 10-15 minutes. Let cool completely then remove from baking sheet",
        "num_comments": 154,
        "comments": [
            {
                "author": "Throwawayrentalco",
                "body": "350 sounds way too high in my opinion. Cocoa powder can also make macarons behave weirdly. How long did you let them set before you baked them?"
            }
        ]
    },
    {
        "title": "Cookies coming out flat.",
        "selftext": "My wife is trying to bake cookies off a recipe a friend gave us. She's having some issues. This is her third batch. All three have turned out like this, and this batch chilled based on advice from another friend, in the fridge for 48 hours before baking.\n\nRecipe calls for 2 1/4 cups flour, 1 tsp baking soda, 1 tsp salt 1 lb of butter, 1 tsp vanilla, two eggs, 3/4 cup sugar, 3/4 cup brown sugar. \n\nNo baking instructions were given because we are in a different state at a different elevation we knew we would have to figure it out. \n\nHelp us find what we are missing. \n\nThanks. ",
        "num_comments": 446,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "I only have one egg - should I go for it or refrain?",
        "selftext": "",
        "num_comments": 282,
        "comments": [
            {
                "author": "Hakc5",
                "body": "Just half the entire recipe…you’ll get half as many muffins but you’ll feed your itch and not mess with ratios.\n\nEdit: spelling and clarity"
            }
        ]
    },
    {
        "title": "Why didn't my cupcakes rise?",
        "selftext": "I swear to you I followed the recipe exactly to a T and they're currently chilling next to the window. \n\nI filled these up to very nearly the very top expecting more of a muffin top but these barely domed. My egg whites were maybe a little cold but they'd been sitting out for an hour when I cracked them and I was very careful not to knock the air out of them... At least I thought I was. This recipe came from Baker Bettie's book. Recipe in the comments.",
        "num_comments": 174,
        "comments": [
            {
                "author": "jakehk",
                "body": "Honestly if the cake texture is good this is the exact result im always looking for in cupcakes to decorate."
            }
        ]
    },
    {
        "title": "My sister wants me to (help) make this cake. Are the decorations piped on with buttercream or icing?",
        "selftext": "I am mid-level amateur but don't have much experience with cake decorating. I am comfortable with replicating everything here other than the decorations.\n\nI am guessing that they are buttercream piped decorations. I'm not entirely sure what piping tips to use.\n\nAny tips would be great.\n\nThank you!",
        "num_comments": 21,
        "comments": [
            {
                "author": "bumbling_bee_",
                "body": "Definitely buttercream, using small round tips, I want to say Wilton #4 probably? For the ones that look like they have a little indent in them, just use a toothpick after piping"
            }
        ]
    },
    {
        "title": "Chocoflan: what did I do wrong?",
        "selftext": "I followed https://www.foodnetwork.com/recipes/marcela-valladolid/chocoflan-recipe-1949457.amp\nFor chocoflan and while the flan portion turned out really good, the chocolate cake was very dense, almost like a brownie or fudge. It was still very good but I was wondering what I did wrong?\n\nThe only thing from the recipe that was a bit different was the cooking times. I baked it for an hour then checked it and the cake was definitely still raw from a toothpick test. Left it in for 30 more mins (checked it every 15) and the cake passed the toothpick test. Chilled it overnight and ended with a very dense cake...\n\nSee cross section on 2nd image",
        "num_comments": 76,
        "comments": [
            {
                "author": "whats-goingon-94",
                "body": "The only thing you’ve done wrong is not ship this to me immediately"
            }
        ]
    },
    {
        "title": "Wtf is phi mode in an oven?",
        "selftext": "",
        "num_comments": 106,
        "comments": [
            {
                "author": "Cum__Cookie",
                "body": "It's for when you need Poseidon to help you with your cooking"
            }
        ]
    },
    {
        "title": "What happened to my brownies?? ;-;",
        "selftext": "I followed the recipe exactly as instructed, except I topped it with toffee crunch.. I'm so confused. It's so dense and cakey??\n\nRecipe goes as follows:\n½ cup salted butter , softened\n▢1/2 cup granulated sugar\n▢½ cup light brown sugar\n▢1 large egg\n▢1 teaspoon vanilla extract\n▢1 1/4 cups all-purpose flour\n▢½ teaspoon baking powder\n▢½ cup butterscotch chips\n\nPreheat oven to 350 degrees F.\nAdd the butter, sugar and brown sugar to a mixing bowl and cream together until very smooth.\n Add egg and vanilla and mix well.\nAdd flour and baking powder and stir until combined. \nFold in butterscotch chips (keep a small handful to sprinkle on top).\nSpread into a greased square (8 or 9 inch) baking pan and bake for about 25 minutes, or until a toothpick inserted comes out clean. \nAllow to cool before cutting into bars.\n",
        "num_comments": 115,
        "comments": [
            {
                "author": "Aromatic_Razzmatazz",
                "body": "Brownies have either cocoa powder or melted chocolate in them. You've made blondies, and these are how they're supposed to look."
            }
        ]
    },
    {
        "title": "Does Apricot Glaze stay sticky? or can it harden? ",
        "selftext": "Hi everyone! Im in need of urgent assistance. My partner and I made Marzipan treats for our wedding guests (wedding is next saturday) and we glazed them last night using Apricot Glaze. A full day has gone by and the Marzipan is looking beautifully shiny but sticky as heck! \n\nWe would like them to not be sticky as its probably going to be very messy for guests to pick up. We have them laid out in a tray right now, with two little fans pointing at them. Planning on putting them in the fridge overnight to see if that helps. \n\nSo that brings me to my final question.. Will apricot glaze harden and become non sticky? And if not, what can we do to make them non sticky!!? HELP! ",
        "num_comments": 64,
        "comments": [
            {
                "author": "spicyzsurviving",
                "body": "What is the ‘glaze’? If it’s like apricot jam then no, it will stay sticky. Hardened glazes are sugar syrups that are boiled until the ‘hard crack’ temperature."
            }
        ]
    },
    {
        "title": "Has anyone used this pan or similar? What can I make in it?",
        "selftext": "I've had this pan for years and I have never found a good use for it. I would love to hear what others have done with it. ",
        "num_comments": 131,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "What Went Wrong With My Brownie?",
        "selftext": "I baked them for 40 minutes, then let them cool for 15 before attempting to turn them over and out onto the baking tray, and this is the result.\n\nWhere did I go wrong?",
        "num_comments": 320,
        "comments": [
            {
                "author": "pandada_",
                "body": "Clearly… they’re not done baking. Did you check with a toothpick? Using a ceramic pan can call for different bake times"
            }
        ]
    },
    {
        "title": "What I was going for vs what I made. Drop you meringue tips so I can go from grinch turds to trees",
        "selftext": "Please note I have never made meringue before and for a first time this went surprisingly well, there is definitely room for improvement but a win is a win. Now I just need to figure out exactly what I need to do to fix up the meringue so it looks more tree-ish for the next batch I make.\nI don’t really know what I need to change, did I over or under beat it, do I need a different piping tip? I have no clue. \nAs far as a recipe goes I literally asked chatgpt to help me make a meringue and this is what it gave me: \n\n2 egg whites\n1/2 cup (100g) caster sugar\n1/4 teaspoon peppermint flavouring\n1/8 teaspoon cream of tartar\nA few drops of food colouring \n\nWhip the Egg Whites:\n•\tAdd the egg whites to the bowl and beat on low speed until foamy.\n•\tAdd the cream of tartar and increase speed to medium-high. (I didn’t have cream of tartar and chatgpt said lemon juice is a substitute)\nAdd Sugar Gradually:\n•\tOnce soft peaks form, gradually add the sugar, 1 tablespoon at a time, while beating. Continue until the meringue forms stiff, glossy peaks, and the sugar is dissolved.\nAdd favour (Optional):\nMix in the extract just before the stiff peaks stage. (I also added the food dye here)\nBake (if making baked meringue):\n•\tPreheat your oven to 90°C (200°F).\n•\tPipe or spoon the meringue onto a parchment-lined baking sheet.\n•\tBake for 60–75 minutes until dry and crisp on the outside.\nCool:\nAllow the meringues to cool in the oven with the door slightly ajar.",
        "num_comments": 61,
        "comments": [
            {
                "author": "ohshethrows",
                "body": "Looks like you needed to whip the meringue a bit longer - whipping to stiff, glossy peaks means when you pull the beater straight up out of the meringue, the meringue sticks up straight and doesn’t flop over at all."
            }
        ]
    },
    {
        "title": "my marshmellows “filling” disappeared",
        "selftext": "I wanted to make chocolate chip cookies with marshmallows inside and i realized that since it’s a sugar it would just melt in and with the cookie. Is their anyway to make a marshmallow filling without it melting",
        "num_comments": 126,
        "comments": [
            {
                "author": "Riddiness",
                "body": "It has become one with the cookie. Accept their union and bless it. Then maybe freeze the next marshmallows? Or add as soon as the cookies are out of the oven?"
            }
        ]
    },
    {
        "title": "What cake pans (or any equipment) can I use to make these mini cakes in a large quantity?",
        "selftext": "I know I could bake a sheet pan and cut out rounds but I don’t want to have an exposed crumb. Cupcake pans are an option but mine have that typical slight flare so the based would be a bit narrower than the top.",
        "num_comments": 93,
        "comments": [
            {
                "author": "Sad_Introduction8995",
                "body": "Please don’t put tulips on them :)"
            }
        ]
    },
    {
        "title": "Ideas for improving this twisters themed cake?",
        "selftext": "There’s two more larger layers for the top that are offset, just didn’t want to fully assemble yet. The buttercream blending didn’t go nearly as well as I hoped and I hate it. Any ideas 😅",
        "num_comments": 256,
        "comments": [
            {
                "author": "Jodies-9-inch-leg",
                "body": "I thought it was four stacked tires…\n\n\nMaybe if you filled in the gaps with more icing, and added some stuff that got picked up by the tornado, use the toys from a kids farm playset… fencing, barnyard animals, cows, chickens, pigs, maybe a tractor"
            }
        ]
    },
    {
        "title": "Why are my biscuits acting like the leaning tower of Pisa?",
        "selftext": "I attempted the homemade biscuits twice. In both attempts, I added sharp cheddar and jalapeño. Yet, both times the biscuits lean over.\n\n- First attempt: 220g of cheddar with 20g of jalapeños without the capsaicin (spicy component)\n- Second attempt: 100g of cheddar with 35g of full jalapeño.\n\nI changed the cheddar and jalapeño amount because the first batch was too cheesy and you couldn’t taste the heat. The second batch tastes just right. \n\nEither ways, my biscuits are leaning over. Can you let me know why it’s doing that? The recipe is in the last picture.",
        "num_comments": 90,
        "comments": [
            {
                "author": "jakehk",
                "body": "Dont twist the cutter, Bake them closer together"
            }
        ]
    },
    {
        "title": "What is this brown liquid leaking from my cinnamon rolls?",
        "selftext": "This is the “Cinna-Buns” recipe from the King Arthur baking site which I’ve made many times with great success. This latest time, after the first proof, I spread it with the filling (soft butter, cinnamon, brown sugar), rolled them and sliced them and then put the pan straight into the fridge to cold proof. When I took them out of the fridge to bake the next day, there was brown liquid leaking from the bottom of half of them. Any idea what this was caused by? The liquid has a faint cinnamon smell.",
        "num_comments": 189,
        "comments": [
            {
                "author": "epidemicsaints",
                "body": "Add a little flour to your filling next time, just a sprinkle. It will keep this from happening and also help it stay in the swirl when they bake."
            }
        ]
    },
    {
        "title": "Too much powdered sugar on my crinkles ",
        "selftext": "Hey guys, I've received a few remarks that my crinkles have too much powdered sugar on them. I can see it myself but I can't think of a way to reduce the thickness of the sugar. I basically refrigerate the dough then scoop into balls and roll them into sifted powdered sugar. I've tried to simply sift the sugar on top to get an idea of how it would look but it looks pretty bad with a massive ring of no coating. \n Do you guys have any tips? \n\nSorry for the bad picture quality but I think it gets the point across. ",
        "num_comments": 150,
        "comments": [
            {
                "author": "czaritamotherofguns",
                "body": "There's no such thing as too much sugar on crinkle cookies. Also, HOW HAVE I FORGOTTEN ABOUT CRINKLE COOKIES!?!\n\n\nThey're so squishy and delicious!"
            }
        ]
    },
    {
        "title": "Help!! Christmas fudge disaster!",
        "selftext": "Hey everyone! I need help asap! idk why, this year I decided to make Christmas treats and give them out as gifts. Saw a video on fudge and thought it was easy to make. Well idk if it's something I did or the ingredients I used, but they are not setting!!! The plain chocolate one is the closest to set, but still gooey. It's been 24hrs in the freezer IK that's not normal!\nI used 1 can of condensed milk, 1 cup of chocolate, and I'd add toppings to each one. Is there any way to fixing this?\n** I just noticed I used meltables, would that have changed anything?",
        "num_comments": 107,
        "comments": [
            {
                "author": "Puzzleheaded-Set-516",
                "body": "The Meltables are probably the reason (I don’t know what they are but they don’t sound like actual chocolate)\n\nBut this is an easy fix if they’re soft, but will hold something of a shape, Scoop them out into balls, roll in cocoa powder/sprinkles/candy canes and you have little truffles.\n\nIf it’s too soft to roll into balls I would put it in a mixer and add a little bit of icing sugar into it until it becomes slightly harder than play dough"
            }
        ]
    },
    {
        "title": "First attempt at chocolate chip cookies. What did I do wrong?",
        "selftext": "Hi everyone I wanted to make chewie chocolate chip cookies and they came out kinda flat, I thought they would rise more. My husband loves them, let me know. I think there isn’t enough baking powder. They got hard real fast.  I posted on r/cookies but I can’t see the comments for some reason. \n\nHere’s the recipe I follow.\n\n1/2cup of salted butter -melted until brown but not burnt and let it cool slightly.\n\nADD sugars\n\n1/2 cup of granulated sugar \n\n3/4 cups of brown sugar \n\nMix together with  a whisk.\n\nAdd\n\n1 egg\n\nA splash of Vanilla Extract or imitation \n\nMix with a whisk \n\nAdd through a mesh metal strainer.\n\n1 cup   and 1/4 cup of all purpose flour\n\n1tsp of baking powder \n\nGently fold with a spatula until combine. Don’t over do it.  I prefer the ones with a silicone at the end.\n\nAdd 1/3 or 1/4 cup of chocolate chip or dark chocolate, your choice.\n\nGently fold in the batter.\n\nChill in the refrigerator for 30min-1hr\n\nBake at 345F for 13-14 min.\n\nThey came out more harder than I would expect. Did I over cook them, \n\n\nI want to try to make them chewier. Any suggestions?\n\nThank you.",
        "num_comments": 164,
        "comments": [
            {
                "author": "None",
                "body": "[removed]"
            }
        ]
    },
    {
        "title": "What's wrong with my bread?",
        "selftext": "It's my first time using [this recipe](https://www.kingarthurbaking.com/recipes/classic-sandwich-bread-recipe) from king Arthur baking. I didn't make any alterations to the ingredients, but after the first hour rise on the counter I transferred it into a bread loaf and let it rise overnight. I just baked it this morning. The loaf size isn't ideal and it's pretty dense, but the most concerning part is the smell. It smells very strongly of some sort of alcohol/ hydrogen peroxide chemical. I honestly don't want to eat this. Is there something wrong with the recipe? Was my yeast bad? What could cause that smell?",
        "num_comments": 169,
        "comments": [
            {
                "author": "galaxystarsmoon",
                "body": "Why does it look like Velveeta"
            }
        ]
    },
    {
        "title": "What Flavor goes with Lemon?",
        "selftext": "So there's this recipe for lemon bars/squares from Sally's Baking Addiction. \n\nhttps://sallysbakingaddiction.com/lemon-bars-recipe/#search\n\nI was thinking of adding some flavored extract to the crust, mostly because I got some strawberry, almond, and I think banana extracts in the pantry that I frankly need to use at some point.\n\nWould adding any of these flavors to the crust, substituting or just adding it to the vanilla extract in the recipe, pair well to the lemon? If not, what flavored extract would work?\n\nInserted is picture of a batch of lemon bars I did for a party last week.\n\n\n",
        "num_comments": 984,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please  remember to read the [rules] (https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all requirements. Posts that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "I thought acetate was supposed to be non-stick and provide a smooth finish, it tore up all the sides of my mousse cake :( what did I do wrong?",
        "selftext": "",
        "num_comments": 33,
        "comments": [
            {
                "author": "None",
                "body": "You need to freeze it and remove the acetate when it’s frozen"
            }
        ]
    },
    {
        "title": "How to get these wrinkles? 1st pic.",
        "selftext": "Does anyone knows the science behind getting this cool effect on cookies? (The red ones are mine). I know about the pan banging effect but i imagine that that wouldn't work for all cookie doughs, and i have a small electric oven, i can max fit a 10 inch baking tray in there bake 4-5 cookies at a time.\n\nI want a chewy, creespy around the edges cookie, hopefully not with a super greasy feeling xd. \n\nAlso, does anyone knows how you can create your own cookie recipes? :v alrighty byee 💟",
        "num_comments": 93,
        "comments": [
            {
                "author": "Kunfuzed",
                "body": "Check out NYT Cooking Giant Crinkled Chocolate Chip Cookie recipe\n\nBasically they make a watery, sticky dough, refrigerate it in a ball, bake for 10 mins, open the oven, slam the cookie sheet down, bake for 2 more minutes, open oven, slam, repeat until a total of ~18 mins of baking."
            }
        ]
    },
    {
        "title": "How do I keep the ends from popping out?",
        "selftext": "Attached are pictures of my first and second attempt at cinnamon rolls. I’ve gotten better with forming them, but how do I keep the ends from popping out after second rise?",
        "num_comments": 123,
        "comments": [
            {
                "author": "cincher",
                "body": "I’m not sure what your question is, but I would place them in a small enough baking dish so that when they rise a second time they take up the whole dish. That way the outsides won’t dry out too much. "
            }
        ]
    },
    {
        "title": "Chocolate dip strawberry, how to prevent something like this?",
        "selftext": "This is just for myself and my partner, but not sure what I did wrong. First time doing something like this. I followed a YouTube video.\nI prepared the strawberry by washing it, then filling a bowl with water and a little bit of white vinegar and the video told me to wait 8 minutes. And then pat dry. I pat them really dry and left it out for a bit to reach room temperature.\n\n I used baking chocolate, like those chocolate chip bag ones. Warm up some water with a bowl on top(glass). Chocolate melted and then I dipped the strawberry. Then put on baking pan with parchment paper and waited for it to harden. \n\nThen I got the result in the picture. Why cant mine look good like others? I will still eat it, but still. It has a blob of chocolate on the bottom. \n\n\n\n\n\n",
        "num_comments": 233,
        "comments": [
            {
                "author": "nidojoker",
                "body": "This is normal. To prevent you can stick the strawberries with a toothpick or skewer and after dipping, stab the stick into something to allow the strawberry to just be hanging in the air"
            }
        ]
    },
    {
        "title": "What can I do to ensure wafer paper decor like this stays fine in and out the fridge?",
        "selftext": "I have to confirm this design with my client and I'm thinking if I should take on the challenge or decline this time as it'll be my first time making a cake like this and don't wanna have any issues with the wafer paper.\n\n It's quite warm/ humid where I am and I'm not sure how the wafer paper decorations will hold up. In winter, I could've decorated the cake morning of collection knowing it won't be going in the fridge for long periods of time/ overnight to keep it cool. But not sure how I can decorate it and keep it refrigerated till next day pick-up. ",
        "num_comments": 27,
        "comments": [
            {
                "author": "Intelligent_Host_582",
                "body": "I'm always fascinated by this design but I can't understand how it's cut and served without making a total mess out of it. If it were me (and assuming this is for a wedding), I would recommend that the client use this design as the bottom tier of a two tier cake. Make this wafer paper tier on a styrofoam dummy and make the other tier the one they cut for ceremonial purposes. After they do the big thing, take it back to the kitchen where the staff just serves from a sheet cake for eating purposes. And then the rest of the top tier can be saved for the first anniversary. \n\ny"
            }
        ]
    },
    {
        "title": "Mary berry’s baking bible - Is this how the procedure for a recipe be defined",
        "selftext": "This is the first baking book i got with high expectations. I’m a beginner level baker and everybody recommended getting this. The procedure for all the recipes just says measure all ingredients into one bowl and beat for 2-3 minutes then it explains one para on how to cool in pan and on cooling rack and thats all. Is this how all baking books are? Arent they supposed to show how to mix wet ingredients and then fold in the dry and not to overmix, how to bloom cocoa powder etc etc?\nShould i return it or keep it? Am i missing something or this is how all books are?",
        "num_comments": 180,
        "comments": [
            {
                "author": "Justagirleatingcake",
                "body": "Every author has their methods. I appreciate simplicity, I've been baking for 30+ years and have never bloomed cocoa powder. \n\nI would consider Mary Berry to be a reliable source until proven otherwise. Bake a few recipes and see how you like them."
            }
        ]
    },
    {
        "title": "What is wrong with my Kerrygold butter? Bought at Sam’s and stored directly in the fridge. Texture is softer than normal when pulled out the package. It does not taste off.",
        "selftext": "",
        "num_comments": 231,
        "comments": [
            {
                "author": "JasonWaterfaII",
                "body": "During the manufacturing process butter is spread flat and then rolled into logs that are pressed into the square shape we find at the grocery store. \n\nWhat you’re seeing here is the butter unrolling. It looks totally fine to me and I’ve used a stick of butter that did this and I had no issues. \n\nI’d use this and ignore everyone telling me that “butter is gold, get your money back” and the other alarmist responses encouraging me to return it to the store."
            }
        ]
    },
    {
        "title": "HELP - just realised I've used self raising flour for a short crust pastry tart. ",
        "selftext": "See photo -\n\nIs it ruined? Should I throw away the crust and start again? \n\nIs it salvageable?\n\n",
        "num_comments": 58,
        "comments": [
            {
                "author": "None",
                "body": "It’ll get a bit puffy is all. It’ll be fine"
            }
        ]
    },
    {
        "title": "Why does my chocolate cake have a circle in the middle?",
        "selftext": "I've never baked a chocolate cake before, so I don't know what I did wrong. I used [Sally's](https://sallysbakingaddiction.com/triple-chocolate-layer-cake/) recipe. It doesn't smell burnt and the toothpick comes out clean. Is this normal or an indication that I did something wrong? ",
        "num_comments": 43,
        "comments": [
            {
                "author": "epidemicsaints",
                "body": "A skin forms on the batter... then the edges cook first which makes them expand... pushing the soft batter toward the center wrinkling the set skin on the surface. Very common with  chocolate cakes because the batters tend to be runny. Any moist oil based cake bakes this way as well.\n\nSometimes the center looks like it boiled. It's normal."
            }
        ]
    },
    {
        "title": "What do you call this tart crust?",
        "selftext": "Saw this on IG: https://www.instagram.com/p/DH-Y_GCxg50/?img_index=2&igsh=MW4yazh0dW85cTVxcg==\n\nLooks like puff pastry, but couldn't find much info about it. Anyone know what this crust is called? And anyone have a guide/ video how to achieve this? ",
        "num_comments": 74,
        "comments": [
            {
                "author": "owie28",
                "body": "I wonder if there's a possibility it is layered filo dough."
            }
        ]
    },
    {
        "title": "Please, I beg you, stop using Tasty and SoYummy recipes...",
        "selftext": "Hey y'all.\n\nI haven't been active on this board for very long, but so far I've really enjoyed everyone and everything on here. As a professional in the culinary industry for over 15 years, and a professional pastry chef for the last 8, I love being able to share what I've learned over the years with those either just breaking into the hobby, home bakers looking to turn it up a notch, or even other professionals looking for new ideas. This sub has been a real pleasure, so thank you. \n\nThat being said, I just want to point out something I've noticed lately. A lot of users who are having issues with recipes are getting them from sources like Tasty, SoYummy, and BuzzFeed. If it seems like these sites are a great place for some recipes, please understand that these are not always reputable sources. For one, they have been known to steal ideas from other internet contributors, and are really designed to make money by getting you to watch their videos. They are not looking out for your best interests, only their own. \n\nIf you are using a recipe that you found in a time lapsed sped up video or from a group that is known for making these videos, please try another recipe first. You are so much better off finding a better cookie or cake or muffin recipe than you are trying to find advice on how to fix a broken one. \n\nEven as a professional, it is really difficult to know what went wrong with a recipe, ESPECIALLY if I can't taste or touch it. It's taken me 10 years of refinement to get a perfect brownie recipe, and I'm STILL working on the chocolate chip cookie. This doesn't just happen over night, and a lot of trial and error is involved, plus a ton of wasted ingredients (unless you're lucky enough like I am to have an SO who will eat anything) If you don't want to have to go through all this time and effort and flour, you're better off finding a food blog you really like rather than these baking videos. \n\nNow, I'm not trying to shame anyone. If you use these sources and they've worked for you, that's fantastic! Keep baking! But if you've used them and something seems off, please consider that it's not you, it's the recipe. \n\nThat's it from me. Happy trails, and keep baking!\n\nEdit: I just want to make something clear. If you successfully use these sources for baking, that's awesome! But I don't need to know about it. Please don't share your success stories in an attempt to prove me wrong. This isn't a wrong or right thing, and I'm not trying to make any arguments.  \n\nI just want newer bakers to understand that if you use them and they DON'T work, it is more likely the recipe than anything you did.\n\nEDIT 2: WOA! I've never gotten a Reddit award before! Not sure what it means, but COOL! Thanks kind stranger! I'm just trying to do my part in helping bakers everywhere. :) <3\n\nEDIT 3: WOA!! A platinum award. Wow. Thanks kind Reddit stranger! I will used this to pass love and cheer to other baking subs! <3<3\nAlso, lots of people asking me for my brownie recipe. I'm okay with giving it away.. maybe we could ask the mods for a special dispensation to post it? That'd be cool.\n\nEDIT 4: I'm starting to think Tasty is trouble shooting their recipes by posting them here. This is the 3rd post I've seen like this in the last month, for the same recipe...\nhttps://www.reddit.com/r/AskBaking/comments/iqthlw/advice_on_how_to_cut_down_the_sweetness_of/?utm_medium=android_app&utm_source=share",
        "num_comments": 248,
        "comments": [
            {
                "author": "fireprooflizard",
                "body": "ann reardon on youtube does some Great debunking videos on why these viral “recipes” are crap, entertaining as well as informative. she makes some great points about how these “content farms” are basically just cute spam and crowding out real bakers on youtube."
            }
        ]
    },
    {
        "title": "My Cookies vs. What I Was Going For - help!",
        "selftext": "I’ve been making chocolate chip cookies and I can’t seem to get them the consistency/texture I’d like. \n\nThe two recipes I’ve used are the *Original Nestle Tollhouse Cookie Recipe*, and *Joshua Weissman’s Chocolate Chip Cookie*. They’re coming out like photo #1, and I’m trying to get the texture of the cookie in photos #2 and #3. \n\n•I tried cooking one batch at 350, one at 375. \n375 was slightly puffier but not by much. \n•I also tried refrigerating the dough for up to 12 hours before baking with minimal change in the result. \n\nWhat am I doing wrong? Any thing I can change/add/fix to get a thicker, fluffier (but still chewy-ish) center without them spreading so much?",
        "num_comments": 516,
        "comments": [
            {
                "author": "philosophywhOr3",
                "body": "Looks like too much butter, maybe longer at a slower temp too could help."
            }
        ]
    },
    {
        "title": "Wth does this frosting need from me???",
        "selftext": "Recipe:\nhttps://iambaker.net/chocolate-ermine-frosting/\n\n\nI'm trying to make chocolate ermine frosting. Based on other posts I've read, I've tried whipping it more and putting it in the fridge for about 45 mins. Still looks like this. Please help :( \n\n\n",
        "num_comments": 64,
        "comments": [
            {
                "author": "ectocoolerkeg",
                "body": "I've had this happen with ermine frosting before - warming it up a little over a double-boiler and then re-whipping saved it."
            }
        ]
    },
    {
        "title": "Can someone help me",
        "selftext": "Chocolate Sour Cream Fudge Cookie\n\nAll ingredients are room temp, except for sour cream is chilled & softened butter. Bread flour? Creaming method. Temp is 180°c 14minutes. The dough is chilled for 1hour. What went wrong? TYSM",
        "num_comments": 122,
        "comments": [
            {
                "author": "bernath",
                "body": "They don't look that off to me. I think if you hadn't tried to cram so many on the tray at the same time and baked them a minute longer, they would've been fine?"
            }
        ]
    },
    {
        "title": "How to get this colour of buttercream?",
        "selftext": "Hi, making a cake for friend’s birthday. I’m a beginner so still learning. She wants this kind of colour of blue (the ones with the letters). Does anyone have any tips on how to achieve it?",
        "num_comments": 28,
        "comments": [
            {
                "author": "charcoalhibiscus",
                "body": "Wilton sells a “Cornflower Blue” gel food coloring which looks like pretty much exactly this shade.\n\nIf you can’t get that for some reason, try mixing equal parts blue and pink food coloring and see what you get, then adjust from there."
            }
        ]
    },
    {
        "title": "Making my bf birthday cake, first time ever baking. I am whipping brown sugar meringue buttercream by hand. No wisk. Three forks. Raw dogging. It's super thick but won't peak?",
        "selftext": "It's been 40 minutes 😭 ",
        "num_comments": 304,
        "comments": [
            {
                "author": "OtherwiseCellist3819",
                "body": "This is brave. This can take an age in a mixer..no advice, just sending luck it happens before your arms fail you"
            }
        ]
    },
    {
        "title": "My flan didn’t melt the sugar on the bottom",
        "selftext": "First time making flan. I tried baking them in smaller ramekins so I can take a neat single serving to my mother in assisted living. \n\nI caramelized the sugar to a nice brown, set them in the bottom of the ramekins, poured in my custard - liquids were combined, double strained, but not heated at all before going in. \n\nI put six ramekins in a hot water bath, wrapped foil over the tops of each ramekins but not the water bath tray. \n\nCooked for 50 minutes at 350 and rotated the tray half way though the cook time. \n\nI let them cool off to room temperature and then put them in the fridge overnight with the foil kept on. \n\nThe flan was fully cooked and nicely firm the way I like flan, but there wasn’t much caramel “sauce” because the sugar base didn’t dissolve completely. \n\n- should I have heated the custard liquid before pouring? (Recipe didn’t call for it)\n\n- should I have put an additional foil cover over the water bath tray to add more steam?\n\nBest part of making desserts yourself is getting to enjoy the mistakes before sharing with others (my mom was an excellent baker so I want to impress her)\n\n",
        "num_comments": 91,
        "comments": [
            {
                "author": "hwrold",
                "body": "I used to make these for the restaurant I work in, only we called it creme caramel. I had this issue but what solved it for me was making the caramel as a syrup (2 parts sugar to 1 part water) and cooking them on a low temp 100° Celsius for roughly 35 mins. My moulds were quite small. Make sure the caramel is as dark as possible without burning so the flavour has as much depth as possible. I also recommend letting them cool down at room temp and not fridging them too soon so the custard and caramel really melt in together. Occasionally I would have a little bit of sugar left in the bottom but not much"
            }
        ]
    },
    {
        "title": "Help with air bubbles?",
        "selftext": "My daughter wants an Oreo birthday cake. I bought silicone cake molds. This is the practice cake. How can I get rid of these air bubbles so the details are more clear? I sprayed the molds with nonstick spray, but didn’t dust it with flour or cocoa. Would that help? I also tapped the molds on the counter a few times before baking.",
        "num_comments": 63,
        "comments": [
            {
                "author": "CatfromLongIsland",
                "body": "I have never used silicon molds.  But for my first Bundt pan (bought at age 61) I researched and decided to use cake goop.  Then I added some batter to the pan and sort of pushed it into the design with a silicon scraper.  The added more batter and did the repeated pushing the batter into the design.  After all the batter was in the pan I tapped the pan on the counter.  I placed the silicon scraper flat on the surface of the batter and gently moved it up and down to try to get any air bubbles to rise to the surface.  I do the same thing when I make cheesecakes.\n\nCAKE GOOP PAN RELEASE -adapted from Sugar Geek Show\r\n\nIn the bowl of an electric mixer beat together until white and homogenous: 99 grams vegetable shortening, 106 grams vegetable oil, 71 grams all-purpose flour\r\n\r\nTransfer to a small Mason jar and store in the refrigerator.  Use a silicon pastry brush to apply a thin coat to your baking pans before baking for a flawless release every time."
            }
        ]
    },
    {
        "title": "Today I found out I've been using margarine.",
        "selftext": "So I'm incredibly embarrassed about this mistake. I'm 19 and I've been baking for years and for the past year I've been wanting to make a side gig of selling my pastries. One of my road blocks was making a stable buttercream. Just a basic American buttercream. Well for years I consistently failed as much as I kept trying and trying and it was maddening. \n\nAll this time I only ever used imperial \"butter\" becuase I was always told it was butter. And it was the cheapest. All the recipes I've ever used said to use real butter and I really thought this whole time I was. \n\nIronically I had thought I just perfected my buttercream (1 lb of \"butter\", 2.5 lb of powdered sugar, and 1 tbsp of vanilla).\n\nI feel very silly now, tomorrow I'm going to go the store and find the cheapest real butter I can find. Will my buttercream be more stable when using real butter?",
        "num_comments": 190,
        "comments": [
            {
                "author": "GypsySnowflake",
                "body": "On the plus side, you now know how to make vegan buttercream!"
            }
        ]
    },
    {
        "title": "Eclairs - First Attempt",
        "selftext": "I tried these over the weekend. I’d call it a success. One question though, if I were to make larger ones.. what tip would I use? How long would you make them? These are about 4”. Maybe XL is 6”?",
        "num_comments": 17,
        "comments": [
            {
                "author": "None",
                "body": "[deleted]"
            }
        ]
    },
    {
        "title": "Cake green??? Help?",
        "selftext": "My mother gave me a very traditional simple bundt cake recipe:\n- 7 eggs (fresh)\n- 200g of sugar\n- 200g of flour\n\nShe instructed me to beat the eggs with sugar with a hand mixer at medium speed for exactly 10 minutes. I then rigorously mixed the flour into the mixture with a spoon. I also decided to add a 1/2 teaspoon of baking powder. Then, I baked at 350°F for 40 mins.\n\nThe first time I made this cake it turned out perfectly fine, except it didn't rise as much as I thought it would. The second, third and tragically fourth time the cakes all came out looking like they do in the pictures.\n\nI baked them all the same temperature for the same time (+-10 mins). I got a brand new pack of sugar, tried to get fresher eggs, brand new flour, I folded in the flour a lot more gently... None of these things made a difference.\n\nPlease help me figure out why God hates me. I just want simple, delicious fluffy cake",
        "num_comments": 167,
        "comments": [
            {
                "author": "moosieq",
                "body": "This cake looks like you over mixed the flour and also baked it at too high a temperature. The big holes look like tunneling which happens when the gluten is overworked. It is also gummy and raw looking while being very brown on the outside: the temperature was too high.\n\nI would normally say the green color might be from your baking powder reacting with something acidic in the batter. Since there's nothing acidic I am assuming it's reacting with your bowl or mixing utensils. Copper bowls or utensils can react to make your cake green."
            }
        ]
    },
    {
        "title": "How do I get a dusty pink color?",
        "selftext": "Hi I have a pink gel coloring but I noticed I was way off with the color for my reference. Does anyone know how to make this exact color? ",
        "num_comments": 45,
        "comments": [
            {
                "author": "PinchOfAlchemy",
                "body": "You can try with a tiny bit of green, to cancel the red in the pink. You want to desaturate"
            }
        ]
    },
    {
        "title": "I beat my buttercream too death. Why isn't it smooth?",
        "selftext": "Attached are pictures of my buttercream. It isn't... smooth? I beat it for at least half an hour and the mouth feel is to die for but the frosting itself doesn't look smooth. Am I doing something wrong? (The little bit of yellow showing is from my spatula after taking it off the kitchen aid.)\n\nRecipe: \n\n2lbs butter, 1 cup crisco, 1/4 cup meringue powder, 1300g confectioner's sugar - sifted, 1/2 cup heavy cream",
        "num_comments": 61,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "Cookies didn’t spread and chocolate never melted",
        "selftext": "Hello, I made cookies today and they turned out horribly. They never ever “melted” or spread. The chocolate on top didn’t melt either. The recipe called for 9-11 minutes at 350F which I followed exactly. When I saw that the cookies never spread, and the chocolate on top didn’t melt either, I kept adding time until I realized all the cookies were cooked entirely and now I have hard ball lumps of cookie dough. I’ve baked cookies before that came out perfectly. I didn’t see anything weird or uncommon about this recipe. I also followed everything exactly with no substitutions (except brown sugar - I just used regular sugar). How could this have happened? It’s confusing because the chocolate chips never melted.\n\nThank you!",
        "num_comments": 155,
        "comments": [
            {
                "author": "pinkopuppy",
                "body": "Honestly the omission of brown sugar probably contributed to the lack of spreading! Brown sugar helps keep baked goods moist, chewy, and spreading as they should. Not trying to be rude but changing the ratio of sugars is definitely not following the recipe exactly. In the future you can add a bit of molasses to your white sugar to make brown sugar- that's basically what it is anyway. If the cookies are too hard to enjoy as is maybe they'd be tasty broken up and sprinkled over ice cream."
            }
        ]
    },
    {
        "title": "5 eggs for a cake? In this economy??",
        "selftext": "So I pull a cake mix box out of my pantry and go to read the instructions to see what all I need to get out. Then I see it says 5 egg whites! 5? For 1 cake? I don't know about yall but I certainly don't have enough eggs for that. I'm not a baking expert by any means, but every cake recipe I've seen or done said 2-3 eggs. And I know egg whites in a cake recipe is different than eggs, but goodness! That many? And the hell am I supposed to do with THAT MANY egg yolks? Lmao, it seems crazy to me. In this economy and with the current prices of eggs? Hell no. I made the mix, put in 2 eggs, popped it in the oven, and am hoping for the best. Will lyk how it turns out. Would appreciate some insight on why it is necessary.\n",
        "num_comments": 137,
        "comments": [
            {
                "author": "CookieMonsteraAlbo",
                "body": "I saw an article about a month ago arguing that it was time to bring back angel food cakes, and I was like, “In this economy? You want to bring back cakes that require an entire dozen eggs?!?”"
            }
        ]
    },
    {
        "title": "For one of my new years resolutions I’m vowing to learn how to bake. Thought I’d try a test run with (what I thought would be relatively easy) whisky banana bread as a test. But it turns out the top has cracked. Can anyone identify what I did wrong?",
        "selftext": "This is quite literally my first time trying to bake…well…anything. \n\nBaked it on 325 for 1 hour and ten minutes and it seems cooked well. Am I overthinking the crack in the top?",
        "num_comments": 265,
        "comments": [
            {
                "author": "GlitterBlood773",
                "body": "Nothing went wrong! Cracks in breads of all kinds are totally normal. \n\nBaking is a really fun hobby. I hope you enjoy it for years to come!"
            }
        ]
    },
    {
        "title": "Made lava cake for the first time and it came out very dense almost fudge like. Did I mess up?",
        "selftext": "I’ll preface this by saying I know almost nothing about baking 😄. I followed Joshua Weissman’s recipe on YouTube. Recipe:\n4 oz bittersweet chocolate\nHalf a stick of unsalted butter\n3 eggs\n1/4 cup granulated sugar\nTablespoon brown sugar\nPinch of salt\n2 teaspoons vanilla extract\n1/4 flour\nThis was a ganache center lava cake btw not an “undercooked” one.\nI melted the chocolate and butter on the side with no problem. I mixed the eggs with a hand mixer then added the salt, sugars, and vanilla. I then slowly folded in the melted butter/chocolate into the egg mix until combined. After that I folded in the flour. I baked it at 375 for 15 minutes.\n\nI did deviate from the recipe in one way though; I made the batter earlier in the day when I had free time then I refrigerated it for about 5 hours before I took it out and let it return to room temperature. I did a little research and people said it was fine to put in the fridge for a little bit so idk if that impacted the final product.\n\nSo basically my question is, is the density of the cake a result of my own error or is this the natural result of a recipe with these specific ingredients? I really wasn’t a fan of the texture and was hoping for a cakier, airier kind of lava cake. Thanks for any advice 🙏 \n\n",
        "num_comments": 67,
        "comments": [
            {
                "author": "ayayadae",
                "body": "you let it sit for five hours and all the air you whipped into the eggs has come out leaving it dense. \n\nyou really shouldn’t let cake batters sit like that. cookies it’s ok and sometimes preferable to age, or some bread doughs, or sometimes for things like pancakes or crepes a SHORT rest is fine. but not usually great for a cake. and especially not for five hours. "
            }
        ]
    },
    {
        "title": "failed frosting, what went wrong?",
        "selftext": "followed the frosting recipe here https://nickskitchen.com/chocolate-layer-cake/\n\nthe ganache like chocolate mix and the buttercream were perfect earlier, but as soon as I whipped the two together using a hand mixer, this happened :( not too sure why, i made sure the ganache was cooled and everything too \nand is there any way I can save this?",
        "num_comments": 73,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "Levain cookie failed on first attempt",
        "selftext": "Followed [Joshua Weissman recipe](https://www.joshuaweissman.com/amp/levian-chocolate-chip-cookies), chilled in fridge overnight. Took it out and waited around an hour before baking.\n\nWas oven too hot? Did I not need to wait an hour after chilling? Any help would be appreciated, thank you.",
        "num_comments": 182,
        "comments": [
            {
                "author": "None",
                "body": "You do not need to wait an hour before baking. \n\nIs your oven rack slanted or is your fan on way too high? Your cookies look literally pushed across the paper in the back corner and then the smear was burnt, indicating they smeared/fell prior to baking. \n\nSomething is not right with the oven. Start there.\n\nThe baking sheet is too small for the amount of cookies. Reduce the number of cookies on that sheet or get a bigger sheet to cook that number of cookies on."
            }
        ]
    },
    {
        "title": "Is my cheesecake okay? ",
        "selftext": "Does this look under or over baked? It has been in the fridge chilling for 16 hours. Nervous to serve it. ",
        "num_comments": 73,
        "comments": [
            {
                "author": "Pelotonic-And-Gin",
                "body": "It’s fine. It cracked because cheesecakes are temperamental babies."
            }
        ]
    },
    {
        "title": "I posted this in r/Bakeing, but it's not showing up, can yall help me instead?",
        "selftext": "",
        "num_comments": 309,
        "comments": [
            {
                "author": "Warmtomatos",
                "body": "Does it say how big the cake has to be? Making a smaller cake will cut costs, say maybe a 4inch 2 layer cake. Places the dollar tree sell flour sugar eggs etc for a little over a dollar each and should have food coloring as well. Also keep in mind the cost of the cake is only the ingredients used. Even if you buy a $10 bag a flour if you use one cup you didn’t use the whole $10 type deal. You can go online and find recipe costing sites that will tell you exactly how much your cake cost to make. Best of luck and I’d definitely be interested to see it when it’s done!"
            }
        ]
    },
    {
        "title": "Cake layers in pie?",
        "selftext": "There’s a bakery that does these layered pies with curd/custard, cake layers, and fruit compote. I’d love to recreate this but am confused at if they’re actually baking this all together - wouldn’t the middle compote sink into the bottom cake batter? Do you bake each layer enough to solidify it then add the next - but wouldn’t that make your bottom layers overdone? I’d be a little disappointed if they’re just assembling this in a baked pie shell haha. Open to any thoughts before I start experimenting! ",
        "num_comments": 27,
        "comments": [
            {
                "author": "ames_006",
                "body": "I would guess it’s a no bake type of thing. They bake just the pie crust and let it cool then add pastry cream layer that is decently thick, then add a cut out thin round of cake, blueberry compote or pie filling that is already cooked and likely cooled, more cake and pastry cream and whip cream on top."
            }
        ]
    },
    {
        "title": "Help…nonstick pan, that I also oiled. Why aren’t the corn muffins coming out???",
        "selftext": "",
        "num_comments": 156,
        "comments": [
            {
                "author": "PositiveEnergyMatter",
                "body": "cornbread muffins are always the devil, i switched to using wrappers :)"
            }
        ]
    },
    {
        "title": "how to get macarons to stay the color i first made them",
        "selftext": "so obviously, these look different. i know its the oven browning them a little but this color change is huge 😖 how do i get them to stay the same color or even closer",
        "num_comments": 41,
        "comments": [
            {
                "author": "Inyce",
                "body": "You'll have to do some testing batches with different amounts of your coloring to find the right post-bake color, blues and greens seem to change the most in baking"
            }
        ]
    },
    {
        "title": "First croissant attempt a la Claire Saffitz",
        "selftext": "First croissant attempt à la Claire Saffitz\n\nI’m a long-time home cook/baker and figured I’d try out croissants on holiday break. I followed the Claire Saffitz recipe and took some progress pics. 1: laminated dough 2: formed croissants 3: proofed croissants 4: baked croissants. I’d love some tips for improvement!\n\nRight off the bat I noticed when making the detrempe before adding the butter it was too dry according to Claire’s recipe so I gradually added water until it seemed right and then proceeded. Maybe my flour protein percentage was off? I was using harvest mills and that has pretty wide range.\n\nThe lamination seemed okay until the final fold where I could see butter peaking through at the edges. Could this be bc it was too warm? Or maybe the folding and alignment was off?\n\nI proofed in my oven for two hours with the light  on. I was afraid the steamed oven would melt the butter and I fear I was right! Even in this proofing environment I could see some melted butter leaking. Unsure how to fix this because a colder temperature would hinder proofing?\n\nThey proofed with a fervor and came out quite uneven. Is this over proofing?\n\nClaire said to only egg was the smooth surfaces not the folds but mine proofed so unevenly they were like 80% exposed folds haha. They didn’t take on enough color and I had to egg wash again halfway through baking.\n\nThe crumb cake out quite tight. Is this glad to over proofing? Underproofing? Overworking the dough? I’d love some advice for improvement?",
        "num_comments": 15,
        "comments": [
            {
                "author": "Fluffy_Munchkin",
                "body": "The oven light may have heated the oven well beyond 80F. I would recommend placing boiling water in a pan in the oven for about 15 minutes, then removing it before placing the croix in. Your best bet is to just get an ambient thermometer/humidity gauge, they're very affordable for cheap digital ones.\n\nYour tight crumb is due to either melted butter or the butter getting incorporated into the dough during lamination after getting too soft.\n\nYour croissants came out uneven because they're rolled too thick, and they aren't cut wide/long enough to be stable while proofing. A longer cut will give more \"steps\" to the croissant, which provides a more stable base.\n\nDon't worry overmuch about washing the exposed layers."
            }
        ]
    },
    {
        "title": "Help! Silicone Bundt pan is bleeding color. Safe to use?",
        "selftext": "I went to wipe down my Bundt mold before making a pound cake and it appears to bleeding color. Can I still bake with it or will it mess up my cake? Is the dye going to get in the food? ",
        "num_comments": 84,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please  remember to read the [rules] (https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all requirements. Posts that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "I need like half a cup of buttercream??",
        "selftext": "I used Swiss meringue buttercream for basically all of this cake but I ran out half way through my last shell border 😩 any suggestions? I can’t scrape the half border off without ruining the whole thing.\n\nAlso yes I’m aware it’s looking rough but allow it I’m a beginner 😭",
        "num_comments": 48,
        "comments": [
            {
                "author": "BadAshBaker",
                "body": "Could you make a 1/4 batch of frosting? But I think your cake looks really nice, not “rough” at all."
            }
        ]
    },
    {
        "title": "Why did my buttercream turn pink instead of brown???",
        "selftext": "This isnt brown right??! This is this is definitely pink right???? I bought warm brown but it’s looking like it’s pink",
        "num_comments": 132,
        "comments": [
            {
                "author": "Psychodelta",
                "body": "Get a color wheel, you'd be surprised how to mix certain colors\n\nAnyway, you're adding brown to white, it's heavily diluted...maybe need to bolster it\n\nOr like others say, your lighting could be throwing things off"
            }
        ]
    },
    {
        "title": "help it’s my first time baking cookies",
        "selftext": "first things first i’m a cookie connoisseur, however it’s my first time making cookies andddd it did not go too well, i put the dough in the fridge to chill and decided ill just take a bit of the dough which might i say is way to sticky and doesn’t look like the one in the video as i can’t even shape it up, so anyways i put the first cookie i made just as a tester came out too dry and the chocolate did not melt at all instead it dryed up and burnt a bit also the taster cookie was not chilled\n\ni then removed the dough out of the fridge and made a batch of cookies which became a mixture of cake and cookie but mostly on the cake side \n\nit doesn’t taste bad tbh, but it’s too cakey, and i don’t understand why the chocolate isn’t melting, like the chocolate became a bit soft when i made the batch but it’s not melting completely. \n\nso i would really appreciate if someone could help me out, as i don’t wanna keep wasting ingredients for no reason",
        "num_comments": 145,
        "comments": [
            {
                "author": "moosieq",
                "body": "Share your recipe so we have a better idea of what might have happened"
            }
        ]
    },
    {
        "title": "Can I use apples that are going soft for apple pie or crumble?",
        "selftext": "Will this turn out okay?",
        "num_comments": 42,
        "comments": [
            {
                "author": "septembergurgles",
                "body": "Yep. Crumble is made for imperfect fruit. I’d just cut off the really brown parts because they can taste bitter."
            }
        ]
    },
    {
        "title": "Why are my cookies underbaked in the middle?",
        "selftext": "Hi everyone,\n\nI recently tried the Levain Cookie recipe from Hijabs and Aprons, but I'm struggling with the center of my cookies coming out raw or underbaked. I followed all the ingredients as listed, including the suggested baking time. The only adjustments I made were halving the ingredients and leaving out the walnuts, as the recipe mentioned this was fine (I substituted with some extra all-purpose flour as instructed).\n\nI'm baking with a conventional oven and I checked the temperature with an oven thermometer to make sure it reached the right temp. However, the middle of my cookies still looks darker and underbaked, which is quite noticeable compared to the fully baked edges. I wouldn't mind it the center was just slightly gooey, but the color difference makes it obvious they're not fully done.\n\nDoes anyone have suggestions on what might be causing this?\n\nHere are photos of the flatter cookie after cooling for 20 mins on the baking sheet. It's even more obvious in the chunkier cookie\n\nhttps://hijabsandaprons.com/food/levain-bakery-\ncookies",
        "num_comments": 66,
        "comments": [
            {
                "author": "Outsideforever3388",
                "body": "Underbaked, slightly, is delicious. If it’s truly raw, drop the temperature of your oven ten degrees and bake 3 more minutes. Test it, then try 5 more minutes. Every oven is different and will take trial and error to determine the exact temperature."
            }
        ]
    },
    {
        "title": "Everything I bake turns out this cakey, gummy consistency. ",
        "selftext": "This was an attempt at this recipe for Fluffernutter bars: https://thesaltymarshmallow.com/fluffernutter-bars/\n\nI was careful to follow everything exactly but it still turned out like this. Cakey on the bottom and sides and gummy on the top. Everything I bake turns out like this except for a few random lucky tries (sugar cookies, an olive oil cake, and a chocolate mug cake). Store bought things turn out fine so I don’t think it’s the oven. \n\n\nOnly thing I can think of is that I don’t have a scale to measure flour but I used to bake all the time without a scale and be fine. I also have already tried adding less flour than the recipe calls for and that doesn’t work either. My grandparents were big bakers and never once owned a scale. \n\nI’ve been really interested in baking lately and it’s so frustrating that everything turns out looking like this. So any help is much appreciated! ",
        "num_comments": 198,
        "comments": [
            {
                "author": "eveningpillforreal",
                "body": "If you measure properly using cups (spooning then leveling) it should be fine. Make sure you aren’t overmixing the batter, and following the instructions exactly. I would try a similar recipe from King Arthur or America’s test kitchen, or similar, that maybe are better formulated. Hope this helps."
            }
        ]
    },
    {
        "title": "My cinnamon rolls are gorgeous but the filling oozed out. Any tips?",
        "selftext": "They tasted amazing and everyone loved it! The filling oozing out isn’t necessarily a problem but I’d wanna know what causes this and how to prevent it. Any ideas?",
        "num_comments": 55,
        "comments": [
            {
                "author": "None",
                "body": "Possibly too much filling. What are your ratios? Recipe would help"
            }
        ]
    },
    {
        "title": "Accidentally used baking soda instead of powder, mom is saying I could get baking soda poisoning.",
        "selftext": "Title is self explanatory. I used baking soda instead of baking powder not realizing I did it until I mixed it with other ingredients. I didn’t want to waste the supplies if I didn’t need to. So I cooked about 3 of the waffles (in a mini waffle iron) and they tasted fine. I only ate one and a half and my brother the other one and a half. Just incase they didn’t taste good or had side effects. And I feel fine right now. \nThe attached photo is the recipe I used. I made the stupid mistake of mentioning this with my mom around, and she started flipping out screaming saying I was gonna get baking soda poisoning and it can be fatal. I looked into it and I feel like she is exaggerating. It seems this is only the case when you ingest it more as a drink (apparently athletes will or would use it in a pregame fashion) then in a cooking manner. If it was so dangerous why would it be advertised for cooking? What is yalls advice should I just throw it all out or try to continue with eating it in the morning. ",
        "num_comments": 134,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please  remember to read the [rules] (https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all requirements. Posts that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "I think I accidentally used cornstarch instead of flour?",
        "selftext": "Is it still safe to eat these cookies even though I *probably* used cornstarch instead of flour? The “flour” was in an unlabeled container that I assumed was flour but now, I am not sure since the texture of these cookies are very off. \n\nI’ve followed this recipe many times so I don’t think it was a problem with the recipe. When making my dough, I added the right amount of flour called for (2.5 cups) but then the dough was still very runny so I kept adding more spoonfuls of flour until the right consistency, I ended up maybe adding half a cup to a cup of extra flour. I didn’t think anything of it until I baked them and I thought they were weird in the oven (pic 1). Then after pulling them out, it has a very flaky texture and it crumbled when I tried to pick it up. When eating it, it’s very flaky and dry. I only baked a dozen and still have most of the batter left. \n\nIs there anything I can do to salvage it? If I bake it, will it be edible? Is it harmful to consume lots of cornstarch? Help!",
        "num_comments": 154,
        "comments": [
            {
                "author": "Apprehensive_Bid5608",
                "body": "The cornstarch won’t hurt you but not so sure about how they will taste. Give one a nibble and report back. I’m dying to know. 😂"
            }
        ]
    },
    {
        "title": "Help!",
        "selftext": "Why does my royal icing cave in like this when it dries?",
        "num_comments": 24,
        "comments": [
            {
                "author": "hulala3",
                "body": "Cookie maker here: your consistency is a little too thin and the cookie is soaking in some of the water before it dries. It’s why the glasses frames are forming a valley in the center as well. You can add a squiggle of outline consistency to the center of the space before flooding and use a thicker flood. It also helps to set them under a fan to dry immediately after flooding."
            }
        ]
    },
    {
        "title": "Why do my muffins have so many different shapes and sizes?",
        "selftext": "They're really soft on the inside which is good but I don't know what happend on the outside. The worst part is that I used muffin mix lol",
        "num_comments": 58,
        "comments": [
            {
                "author": "bumbah",
                "body": "Thick batter and Fan oven = capping like this. Batter sets before it fully baked so it blows out the side. Lower and slower can help, add more oil/water to thin it out a bit. Rotate the pan in oven. Put convection fan on low/off."
            }
        ]
    },
    {
        "title": "Brownies round #2; are these underbaked?",
        "selftext": "I baked these at 350 for approximately 45 minutes. I placed an aluminum baking sheet under the glass pan to help them bake evenly. Sticking this metal thermometer in the center, a few wet crumbs come out, which is what I was aiming for; a fudgier brownie. \n\nHowever, after slicing in 45 minutes later, I'm concerned about their doness. The edges kept their shape but the half closer to the center got smushed while getting out of the pan. I decided to test the part of the brownie in the first picture (towards the center) with the metal thermometer; it came out clean. However, touching it with my finger, it feels like a custard. It doesn't stick to my finger at all, though. \n\nDo these just need to cool more? I honestly have very little experience with brownies.",
        "num_comments": 103,
        "comments": [
            {
                "author": "IlexAquifolia",
                "body": "To me this is the perfect brownie. It's hard to cut a fudgy brownie cleanly, in my experience. If you want clean edges, stick the pan in the freezer for a bit and then slice. Serve at whatever temperature you prefer."
            }
        ]
    },
    {
        "title": "why'd my brownie part of brookies overflowed 🫠",
        "selftext": "2nd and 3rd photos are my first attempt and also that's how i placed the cookie part.",
        "num_comments": 54,
        "comments": [
            {
                "author": "Easy-Feedback-3227",
                "body": "Cookie dough is denser than brownie batter and rises less. The brownie therefore had nowhere to rise except for squishing out of the sides since it was locked in place. As someone else said, put the cookie dough on the bottom. If the recipe said to put it on top then the issue is the recipe, not you. This is the case more often than you'd like to think. Last picture looks good though."
            }
        ]
    },
    {
        "title": "Why is my cake texture rubbery and chewy?s",
        "selftext": "The cake came out moist, but with a weird texture. I used recipetineats' chocolate cake recipe, and reduced sugar by about 130g because I don't like sweet cakes. \n\nAny idea why the cake came out not like a cake? Was it due to the reduced sugar?",
        "num_comments": 55,
        "comments": [
            {
                "author": "ravenclaw_cookie",
                "body": "It’s over mixed but you’ve also reduced the sugar by nearly a third which will also affect the texture. Sugar is a pretty important component of the cake and contributes to the structure not just sweetness"
            }
        ]
    },
    {
        "title": "My friend’s birthday party is in 8 minutes. Can I fix this?",
        "selftext": "It’s literally bubbling. I have no idea what went wrong",
        "num_comments": 210,
        "comments": [
            {
                "author": "Wintertanuki",
                "body": "i don't think that's fixable, especially not in 8 minutes 🧍🏻‍♀️"
            }
        ]
    },
    {
        "title": "cookie irons",
        "selftext": "i’ve made krumkake & pizzelle hundreds of times but the irons were electric which made it easy.  i scrounged these ‘manual’ ones (goro, gaufrette, & krumkake) at goodwill but have been wary of using them - none came with stands - anyone who’s used them on a gas stove have any tips/advice? ",
        "num_comments": 16,
        "comments": [
            {
                "author": "New-Flow-6798",
                "body": "Start on low heat, use a glove style heat mitt when handling it and show us your results please"
            }
        ]
    },
    {
        "title": "White crackly layer on-top of lemon bars?",
        "selftext": "Hey everyone,\n\nI’ve been following the Preppy Kitchen Lemon Bar recipe for a while, but I recently decided to try Magnolia Bakery’s version to switch things up.\n\nWith their version, Ive noticed a white foamy layer on top of the lemon bars that makes them incredibly ugly. They taste great, but Im wondering how to prevent that layer from forming. What could this layer be?\n\nFor context- I’ve been using glass bakeware for the more pristine looking bars, whereas I used an aluminum pan for the ugly ones. Unsure if that makes a difference. \n\n",
        "num_comments": 49,
        "comments": [
            {
                "author": "Ladymistery",
                "body": "Mine do this all the time.\n\nI just assumed that's how they were supposed to look - it's crunchy and sweet, and when you dust with powdered sugar, the powdered sugar doesn't sink in and get sticky/soggy. \n\nMy guess is it's the egg whites/sugar rising to the top while baking."
            }
        ]
    },
    {
        "title": "Never used fresh berries to make buttercream, how can I stop it from looking like brains? ",
        "selftext": "All ingredients are room temperature. It's butter, powdered sugar, and 4 fresh blackberries (no I didn't get the seeds out either). Even just 1 blackberry made it look like this and the recipe I was looking at used 15! Ugh. I kept mixing it just to try and it still looks weird! I've made normal buttercream just fine so I'm not sure what I'm doing wrong. It's kinda like... Oily? The butter and sugar incorporated fine so I'm not sure what the issue is with adding the blackberries.\n\nMy first try did the same thing but I used margarine so I figured that was the issue. Would shortening help, maybe? \n\nI just wanna eat my cupcakes. The dark chocolate cupcakes came out phenomenal and I want them so bad 😭 ",
        "num_comments": 91,
        "comments": [
            {
                "author": "epidemicsaints",
                "body": "Classic water and oil don't mix situation. It needs to be a small amount of a very concentrated cooked down puree or a powder."
            }
        ]
    },
    {
        "title": "Should I listen to my roommate and get rid of this baking sheet?",
        "selftext": "i think it’s fine! just seasoned!",
        "num_comments": 302,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "Sprinkle sugar cookie what happened?",
        "selftext": "Hi everyone, I’m starting my baking journey and have been starting with baking cookies. I found a recipe online (https://celebratingsweets.com/soft-sprinkle-sugar-cookies/) and followed the steps and measured the ingredients. Made sure my butter was room temperature left it out for like 1 hour and 1/2 to make sure it’s room temperature ..I chilled the dough for 1-2 hours but my cookies didn’t spread like how I wanted them too.. not sure what I did wrong… \nWas it too much sugar ? Maybe too much sprinkles? Anyone have any ideas? \n\nI tried pressing down on the dough the second time and that helped but the consistency wasn’t that soft.. it was a little dense .",
        "num_comments": 103,
        "comments": [
            {
                "author": "glassesforrabbits",
                "body": "The recipe did not mention chilling the dough. You softened the butter but when you refrigerated the dough it became solid again. If you baked the cool dough it would have changed the outcome. Try baking them after mixing next time."
            }
        ]
    },
    {
        "title": "What am I doing wrong my the meringue ? ",
        "selftext": "I made lemon meringue pies but the meringue looks kinda sad :') \nWhat can I do differently to get the classic torched look with an oven (if it's even possible) ?\nIt's a French meringue with a tsp of lemon juice (I don't have creme of tartar).\nI used this recipe https://youtu.be/lwtxluLYqOI?si=VNSv6Qn5k6Z8vPuq (Preppy Kitchen - \"The PERFECT lemon meringue pie recipe\") but my meringue never got the consistency shown in the video even after mixing it for ~25 min, I suspect this was the issue but I'm not sure why, should I've just kept going ?\n",
        "num_comments": 49,
        "comments": [
            {
                "author": "SnorgesLuisBorges",
                "body": "I could be wrong, so someone chime in, but it looks like you over whisked it and it's started to break?"
            }
        ]
    },
    {
        "title": "I made some chocolate chip muffins but they keep looking like this? Tips are wanted and appreciated",
        "selftext": "The recipe I followed was one that chef made us do in class, he made us use the muffin method:\n2 cups all purpose flour \n1 tablespoon baking powder\n1/2 teaspoon salt\n3/4 cup sugar \n1 egg\n1 cup milk\n1/4 melted butter\n3/4 chocolate chips\nTemp: 350°F\nI left them in the oven for about 25 minutes",
        "num_comments": 170,
        "comments": [
            {
                "author": "Farcus_Prime",
                "body": "They are just so pale. Is your ovens top heating element working? Did you put it on the middle rack?"
            }
        ]
    },
    {
        "title": "What did I do wrong?",
        "selftext": "I recently came across this chocolate soufflé cake recipe. This is my second attempt and it came out horrible once again. \nI followed the recipe accordingly and used all the right ingredients so I’m not sure where I went wrong. Are there specific techniques for making soufflé cakes? \n\nI baked it at 275°F for 75 minutes, in a hot water bath. It came out flat, moist and very light colored. \n\nThe first picture is my result and the second picture is the actual recipe results.",
        "num_comments": 94,
        "comments": [
            {
                "author": "None",
                "body": "Please share the recipe. Nobody can really assist if they don't have the base recipe to review, and share more about what you did exactly. And yes, there are specific techniques to make souffles so it makes sense to assume a souffle cake is going to behave more like a souffle than a traditional cake.\n\nIt appears the original cake has been cooked in a sloped pan as indicated by the flat \"bottom\" and sloped edges. It appears it's been turned over onto the flat top and the base is the exposed side. I would guess it's probably baked in a ceramic or maybe glass pan, not metal. \n\nBased on pictures alone, you are most likely not using the \"correctly shaped\" pan for this, because a souffle needs a little help creeping up the sides of its vessel. You're using a pan that doesn't encourage souffle-like rising. I would guess the parchment is also an issue preventing the right type of expansion of a souffle cake. \n\nAnd, just based on pictures alone, it doesn't look like you mixed your cake well for a souffle cake. Yours looks quite dense and slightly sunken compared to the recipe picture."
            }
        ]
    },
    {
        "title": "Buttercream frosting help",
        "selftext": "Hello! I need some help with my buttercream frosting. Each time I make it, I get little balls of powdered sugar in the finish product. I’ve tried multiple ways of sifting the sugar (whisk, food strainer, kitchen aid sifter attachment). I add in the sugar by 1/2 cup increments and mix (I’ve also tried mixing by hand, a hand mixer and my kitchen aid stand mixer) and still get them. Any suggestions would be greatly appreciated. Thanks!",
        "num_comments": 118,
        "comments": [
            {
                "author": "mommmmm1101",
                "body": "Go Swiss and you’ll never miss. \n\n\nSeriously. Switch to a swiss buttercream and you’ll never have this issue again."
            }
        ]
    },
    {
        "title": "Croissant dough- accidentally used whole wheat instead of white",
        "selftext": "I didn't realize until I started mixing but I had to use a locally millled whole wheat bread flour rather than my regular white bread flour. \nThe recipe is Claire Saffitz's spelt croissants.I kneeded the dough for 10 min, added an extra splash of water, but it is not getting supple and I'm not passing the window pane test. It did rise really well. \nDo I try to keep kneeling again? Do I give up and make these into bread rolls? Or is there something I can or should do so I can continue to make croissants with these. Thanks!",
        "num_comments": 30,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "Is this dulce de leche still good?",
        "selftext": "I’ve never worked with La Lechera before so I’m not sure what it’s supposed to look like. It expired in October of 2020, but I figured it’s a canned food so it’s probably fine. I’m making alfajores if that matters",
        "num_comments": 426,
        "comments": [
            {
                "author": "Shmeblee",
                "body": "For the sake of less than $5...throw it away."
            }
        ]
    },
    {
        "title": "Why does the buttercream icing have these holes? Complete newbie to baking so any advice would be so appreciated!! ",
        "selftext": "",
        "num_comments": 55,
        "comments": [
            {
                "author": "DondeT",
                "body": "It’s from air bubbles in your mix. \n\nYou can reduce them by mixing your buttercream through with a spatula before piping, but beating the ingredients together with a whisk or a paddle attachment tends to create air bubbles.\n\nPersonally I don’t mind these in my buttercream, I like the lightness it gives the overall result."
            }
        ]
    },
    {
        "title": "Used wrong type of sugar",
        "selftext": "I was making Sally’s Baking’s Chocolate Buttercream (the recipe in the comments) and instead of confectionary sugar used brown sugar which is super granulated. How can I reuse this? As buttercream it will definitely not work anymore. ",
        "num_comments": 76,
        "comments": [
            {
                "author": "ubernoodle96",
                "body": "My knee jerk reaction is to find a brownie recipe with similar ingredients, some flour, vanilla, a little more butter and couple eggs might make a decent brownie batter"
            }
        ]
    },
    {
        "title": "How did they make these filled shortbread cookies?",
        "selftext": "My local farm store bakes these filled shortbread cookies—raspberry and apricot, like a more classic thumbprint… but how are they filling them? Do you think there’s a base and a separate top? Are they piping the dough? Thanks for any suggestions and ideas.",
        "num_comments": 38,
        "comments": [
            {
                "author": "epidemicsaints",
                "body": "These look folded and pinched shut like a dumpling. Especially the way the edges look squared off from underneath and the way they are mounded in the center. The dough looks like it is on the soft side too. Just firm enough to roll out.\n\nMaybe it's a square or circle, dollop of filling, slit from edge to filling, and then these flaps are folded in.\n\nLike this, but fold in all of them:\n\nhttps://preview.redd.it/uk0lh90vupjd1.png?width=540&format=png&auto=webp&s=288ed8739acef9d76e78a4275fd45f87b6390122"
            }
        ]
    },
    {
        "title": "Green Spots on Fridge-Proofed Bagels",
        "selftext": "Hi AskBaking, I’m hoping you can help me out with an issue I’ve been having with bagel dough…\n\nThe recipe I follow calls for flour, malt powder, salt, yeast and water. After kneading, the recipe calls for shaping the bagels and stick them (resting on parchment paper on a baking tray, covered with clingfilm) in the fridge for 12/24/48hrs. \n\nI shaped these on Friday night and left them untouched until today. When I lifted them off the parchment paper to boil, I noticed that every single bagel has these unsightly green/grey spots on the bottom that look pretty grim. \n\nI’m hoping it’s not mould, but also stumped as to what it could be - attaching photos (hopefully this works). What’s happening to my otherwise delicious, sexy bagels?!",
        "num_comments": 85,
        "comments": [
            {
                "author": "bussappa",
                "body": "Looks like mold to me.  Check your frig temp."
            }
        ]
    },
    {
        "title": "What kind of braid is this, and how to form it?",
        "selftext": "A beloved local bakery closed forever this week and I am trying to replicate their cronut recipe.  \n\nThey use a different shape than most and I’m wondering if anyone knows the technique, or at least the term for this type of braid. \n\n",
        "num_comments": 20,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please  remember to read the [rules] (https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all requirements. Posts that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "What is this ingredient????",
        "selftext": "I want to make my mother in law's carrot cake recipe but one of the ingredients is a mystery. It looks like it says CTD, but I don't know what that could be. The directions on the back offer no clues. She died this past summer so I can't ask her. Any ideas?",
        "num_comments": 110,
        "comments": [
            {
                "author": "Carpet-Crafty",
                "body": "Cinnamon?"
            }
        ]
    },
    {
        "title": "i’ll say it",
        "selftext": "i’ve seen comments under a lot of posts here (and on the cooking subreddit) that are kind of mean in my opinion and one of the rules here is being kind. i didn’t want to single out the person that made a comment that caused me to post this concern, but i hate it when beginner bakers or just anyone baking in general has a question about something they may be insecure about and at least one comment will follow along the lines of “i hate bakers who don’t follow the recipe and then blah blah” or “i hate bakers who…” to me comments like that are mean, and i’ve seen them under posts even when the OP follows the recipe. like, let’s all be a bit nicer bc me personally, i think it can turn some people off from a genuine question or a passion they may have. just my two cents \n",
        "num_comments": 77,
        "comments": [
            {
                "author": "pandada_",
                "body": "Generally, we wouldn’t allow such a thread because it’s not a question but this has been a big problem lately so we will let it stay up (until people get uncivilized)\n\nEdit: also, I’ll say as a mod who has had to be the one to delete and moderate a lot of the comments and fighting going on, it’s been more frequent in the last few months. \n\nOne of the problems is also that since the subreddit is becoming more popular, it’s being suggested to random redditors who have nothing to do with baking. Those redditors are coming in and using the anonymity of the internet to say harsh things. Overall, the people that frequent askbaking are pretty civil though!"
            }
        ]
    },
    {
        "title": "First time making brownies, are these undercooked?",
        "selftext": "I haven't done a great job at my first attempt. I doubled the ingredients but ended up cooking for nearly 4 times the recommended cook time as they kept looking wobbly. Recipe said \"until the edges are set and the centre still has a good wobble\". The centre wasn't wobbling when I took them out so I thought they would definitely be ok. Are these undercooked in the centre or just fudgy? The edges are definitely overdone so I've definitely gone wrong here. Any advice would be appreciated. Thanks!",
        "num_comments": 93,
        "comments": [
            {
                "author": "Melancholy-4321",
                "body": "Brownie texture is very much a personal preference, for me those middles are peak fudgy brownie  🤤"
            }
        ]
    },
    {
        "title": "Croissant: layers are there but the formed pain au chocolat does not rise. ",
        "selftext": "I got the lamination down but the final product does not bounce up and give good separation. During proofing it just expands side ways... What could've gone wrong?\n\nMy recipe is\n\n250g all purpose\n125g water\n50g butter\n25g sugar\n2 tsp of salt\n\n125g of butter block\n\n1. Mix everything except butter until shaggy dough forms (not to over knead)\n2. Work butter in to form smooth dough and window pane test (does not require a lot of kneading. Maybe 5 minutes)\n3. Overnight in the fridge\n4. Book fold -> 30 minutes rest -> letter fold -> 1 hr rest -> final rolling\n5. Roll to pain au chocolat and proof for 2 hours in the oven with a 70F water bath\n6. 385F for 35 minutes",
        "num_comments": 60,
        "comments": [
            {
                "author": "Inevitable_Cat_7878",
                "body": "I don't see yeast in the ingredients."
            }
        ]
    },
    {
        "title": "Wedding cake Design help",
        "selftext": "I'd like to have a nontraditional rainbow cake like the one pictured. I was wondering what embellishments to add to make if more wedding themed I'll be getting a bride and groom cake topper for me and my fiancé, but am not sure of what else. More flowers? What color of flowers? And icing border?\nAny ideas would be appreciated:)",
        "num_comments": 34,
        "comments": [
            {
                "author": "None",
                "body": "I actually think white flowers on this design would pop out. Maybe, pearly embellishments? They might look nice also. "
            }
        ]
    },
    {
        "title": "Carrots turned green in my carrot cake ",
        "selftext": "I made this a couple of days ago. I've already taken a few bites before I noticed, it tastes fine. Is this mold or some sort of reaction? Can I expect to be violently ill tonight?",
        "num_comments": 75,
        "comments": [
            {
                "author": "fart_knocker3000",
                "body": "A trick we used at my old bakery was to sift the leaveners and flour together. This eliminated the green carrot issue."
            }
        ]
    },
    {
        "title": "First cinnamon roll. Tasted great but how to make them pretty",
        "selftext": "I cut into the dough first individually and roll. ",
        "num_comments": 52,
        "comments": [
            {
                "author": "Hot-Personality-3683",
                "body": "My guess is you rolled them too tightly. They need some room to rise before and during baking ; if the dough has no room to expand into the pan it’ll find another way, like here where they shot right up."
            }
        ]
    },
    {
        "title": "Best place to find these mini tart shells?",
        "selftext": "These tiny key lime pies were delicious but I’m not sure how the shell was made. Pre-made or try my hand at using a mold?",
        "num_comments": 54,
        "comments": [
            {
                "author": "Fizzle_the_clown",
                "body": "These looks a lot like whole foods tarts. Shells come in premade. They might sell them to you without toppings"
            }
        ]
    },
    {
        "title": "Anyone love baking but find decorating stressful?",
        "selftext": "The title! I’m an amateur home baker and on my gosh. Decorating can be fun but on cakes it can also be soo stressful, especially when there’s a time limit. Anyone agree? \n\nAny decorating cake advice? I’ve got the main things noted down such as a crumb coat, scraping the cake, levelling the cakes for a clean flat finish.",
        "num_comments": 171,
        "comments": [
            {
                "author": "CooterSam",
                "body": "If I ever open a shop it will be called Ugly Bakes. I love to get my hands dirty and make the most delicious breads, pies, pastries and cookies, even cakes. However, I am not patient enough to do more than \"mom frosting\" on a cake and maybe some rosettes."
            }
        ]
    },
    {
        "title": "Buttercream",
        "selftext": "I tried making butter cream with butter, cream cheese, and powdered sugar. As you can see somehow it isn’t really creamy. Is there a way to fix this without redoing the whole buttercream?\n",
        "num_comments": 90,
        "comments": [
            {
                "author": "None",
                "body": "[removed]"
            }
        ]
    },
    {
        "title": "Why do bakers like Swiss meringue buttercream and how do I make it not taste and look like straight butter?",
        "selftext": "I’ve made it twice and both times it had the taste and texture of just butter. Not meringuey, just greasy. Not sure if you can tell from the photo but it just doesn’t look quite right.\n\nI used Chelsweets SMB recipe, so maybe it’s just the recipe or my method?? I struggled for ages to get it to the right texture too.\n\nRecipe: https://chelsweets.com/swiss-meringue-buttercream-frosting/",
        "num_comments": 102,
        "comments": [
            {
                "author": "Marisarek",
                "body": "Ugh… going through that recipe took forever… I personally have always used [Stella Parks’ recipe](https://www.seriouseats.com/swiss-meringue-buttercream-frosting-recipe). If it tastes like butter, most likely the buttercream is too cold"
            }
        ]
    },
    {
        "title": "Does this plastic knife have a name? I'm in love",
        "selftext": "I bought this hard plastic contraption a long time ago, and I want to know what it actually is. I use it as a plastic knife (which is the best thing ever for cutting things in the pan without scratching it). Any ideas?",
        "num_comments": 85,
        "comments": [
            {
                "author": "MrE008",
                "body": "A sperm whale going \"huh?\"\n\nKinda looks like a blue cheese knife."
            }
        ]
    },
    {
        "title": "What causes my caramel to do this",
        "selftext": "I’ve tried making this recipe for caramel 3 times. The first time it worked perfectly, however my 2 attempts since then have seen the butter separating and the caramel going all stringy and blob-like and I have no idea why.\n\nHere’s the recipe I used.\n\n100g caster sugar\n100ml double cream\n100g butter\n\n\nFor the caramel, tip the caster sugar into a pan and heat over a low heat until the sugar begins to melt, shaking the pan from time to time (do not stir). Bring to the boil, then cook to a dark amber caramel colour. Meanwhile warm the cream in a small pan.\n\nCarefully remove the pan from the heat and stir in the warm (not boiling) cream. Return the pan to the heat and boil to 120°C/248°F. Remove from the heat and carefully stir in the butter until emulsified.\n\n",
        "num_comments": 104,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "Tres Leches didn’t absorb liquids",
        "selftext": "I baked a tres leches cake yesterday evening, following the recipe (mely Martinez) & cooling times. I also did my best to try to not overwhelm the cake and I very slowly added my liquid over the course of ~20 minutes. By the time I noticed the liquid begin to pool I panicked and that’s when I went to look up some other recipe video tutorials and almost every recipe I saw showed it go into the fridge with excess liquid and the cake soaked it up just fine, so I chose to proceed with the rest of the milk mixture and refrigerated. It’s been in my fridge overnight (about 12 hours at time of posting) and my leches has not absorbed all the way. Do I pour it off or wait longer? ",
        "num_comments": 56,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "Made shortbread using almond paste instead of ground almonds, why is it not setting? my own fault, but interested to learn why",
        "selftext": "I've used the same recipe many times to make shortbread, but substituted the ground almonds with almond paste as I need to use it up. I understand it's my fault, but just curious about the \"scientific\" reason why it wouldn't set? is it because of the oil?",
        "num_comments": 37,
        "comments": [
            {
                "author": "pandada_",
                "body": "Almond paste is NOT the same as ground almonds. Depending on the brand, it contains egg whites and sugar as well as the ground almonds. The extra sugar will definitely mess up your texture"
            }
        ]
    },
    {
        "title": "First ever cake",
        "selftext": "Hi,\n\nI’ve made my first ever proper cake today and was looking for some tips!\n\nI really struggled to get a smooth finish after crumb coating my cake. You can see in the picture there is gaps etc.\n\nI also cling filmed my cake layers like 5 minutes after taking it out of the oven and put it in the fridge. I’m pretty sure that was the wrong way to do it.\n\nI also really struggled with piping. Any tips/suggestions would be highly appreciated :)",
        "num_comments": 29,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please  remember to read the [rules] (https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all requirements. Posts that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "How do you get your buttercream colors to be this deep/vibrant and still taste good?",
        "selftext": "",
        "num_comments": 65,
        "comments": [
            {
                "author": "fishsweater",
                "body": "Photos like these tend to be edited to be more vibrant, and a lot of these cakes are also purely decorative so in real life it probably won’t look the same. Though to do this I’d recommend using gel or powdered coloring and letting it sit for a few days. Icing tends to darken quite a bit over time.\n\nAdditionally not all food dyes taste bad (I have tried every single type of highly saturated icing). The worst offenders tends to be red and black."
            }
        ]
    },
    {
        "title": "First time baking cookies, what did I do wrong?",
        "selftext": "I followed a random recipe to get an idea of what goes into cookies, I must have added too much of something somewhere though (I’m thinking flour?). Any pointers to figure out what not to do next time?",
        "num_comments": 205,
        "comments": [
            {
                "author": "Justagirleatingcake",
                "body": "Cooking is art. Baking is chemistry. You can't just eyeball from a random recipe. Even 1/2tsp too much rising agent or  a Tbsp too much or too little flour can ruin a whole batch.\n\nIf I had to guess I'd say too much flour and you overmixed them creating a strong gluten network which will result in a tough, cakelike structure."
            }
        ]
    },
    {
        "title": "Which one will get me fudgy brownies?",
        "selftext": "I used GHIRARDELLI PREMIUM HOT COCOA as a substitute for cocoa powder & it resulted in the most amazing & fudgiest brownies I have ever had. \n\nHowever, I don't live in Canada & I can't have access to the same stuff again. \n\nI tried making brownies using cheap local alternatives. The taste was okayish but it wasn't fudgy by any means & just not the same.\n\nI searched online & these are the options available to me right now:\n\n1. Dezaan Dutch Processed Dark Cocoa Powder\n\n2. Gerkens Cocoa Powder\n\n3. Van Houten Cocoa Powder Dutch Processed\n\nWhich one do you guys think is the best one to get fudgy brownies like before?",
        "num_comments": 112,
        "comments": [
            {
                "author": "tensory",
                "body": "Canada? Ghirardelli is California-based. It's not niche. I'm surprised if you can order online and really can't get Ghirardelli if that will make you happy. I'm just guessing that the super fudginess was because of the pre-mixed sugar in hot cocoa mix, while cocoa powders leave the sugar ratio up to you."
            }
        ]
    },
    {
        "title": "What are your baking superstitions or good luck charms?",
        "selftext": "In the midst of my holiday baking, I’ve noticed that both my mom and I have little “quirks” or superstitions we use while baking. \n\nFor example, I always say “have fun” to my bakes as I put them in the oven.. it started as a fun little joke but now I feel like I have to say it each time for good luck lol.\n\nMy mom tosses salt behind her shoulder, and says you should never praise how a bake looks in the oven..no praise until it is out. \n\nDo you have any baking superstitions/quirks/lucky whisks?",
        "num_comments": 158,
        "comments": [
            {
                "author": "Blu1027",
                "body": "Every time I make a pumpkin pie I talk to my grandma. Shes been gone now 18 years now.\n\nBack story:   the first thanksgiving after she passed I made a pumpkin pie using her glass pie dishes but it was a new recipe for a \"diet\"  pie using splenda and egg white with no crust to cut calories... when I put it in the oven I swear it flipped out of the oven off the rack.\n\nSo now I make her recipe as is and always ask her not to flip it out of the oven and make a mess"
            }
        ]
    },
    {
        "title": "What’s the secret behind this crinkly texture that I got in these brown butter choc chip cookies",
        "selftext": "First time I get this texture and I’m in love! I used 170g brown butter that I added 30g of water to, 220g flour, 0.5 tsp baking soda, and 150g brown sugar and 100g white sugar with an egg and an egg yolk.\n\nWhat I changed in preparation is that after mixing butter with sugars, I whisked the eggs and sugar for two minutes til paler in color. I didn’t expect to get this perfect crackly crinkly texture, what’s the explanation behind it?",
        "num_comments": 27,
        "comments": [
            {
                "author": "Garconavecunreve",
                "body": "The texture itself is result of puffing up and then collapsing of the dough surface - assuming you’ve used the same measurements before with different result: you likely incorporated more air throughout the additional creaming."
            }
        ]
    },
    {
        "title": "Are all kitchen aids just totally useless?",
        "selftext": "For YEARS I’ve wanted a stand mixer. Its seems every other recipe talks about how easy they make things, and EVERY video I see online uses one. \n\nSo I saved up and finally bought a 6 qt bowl lift kitchen aid from Costco because they were on a huge sale. And I feel like it was a huge waste of money. \n\nIs there really supposed to be a good centimeter of clearance where nothing get mixed? And even more on the bottom it seems? I mean I get that you don’t want your attachments to hit the bowl because that could damage them… but does it need to be that far away? I feel like all of the convenience of the mixer is overshadowed by the amount of time I am spending scraping down that stupid bowl. \n\nI was trying to cream a cup of butter and a cup of sugar today for cookies. I thought that would be plenty of volume to use the mixer. But every fifteen seconds or so I had to stop the mixer and scrape it down because all of the mixture got pushed up the sides and wasn’t getting mixed anymore. Is that user error? Am I missing something? Do I need to be making triple batches of cookies in order to make this thing worth it? I couldn’t help but think the whole time about how much easier it would have been with my hand mixer. \n\nI’m just feeling very defeated. The draw of the stand mixer was to be able to wash dishes or help my kids while things were mixing - but it seems this machine just isn’t made to do that. Is a kitchenaid just not for me? Or am I missing something?\n\nEdit: I will be trying the dime test tonight, thank you! Though it sounds like Kitcchen Aid just isn’t what it used to be which is pretty infuriating (why include a dough hook if you don’t want us to kneed dough? 🤦‍♀️)",
        "num_comments": 137,
        "comments": [
            {
                "author": "Emotional_Flan7712",
                "body": "Have you done a dime test? Sounds like yours would fail and you need to adjust the set screw.\n\nhttps://www.abakershouse.com/the-dime-test-for-your-kitchenaid-mixer/"
            }
        ]
    },
    {
        "title": "Why do my chocolate chip cookies always come out like this??? lol",
        "selftext": "Ive attempted to make chocolate chip cookies my entire life. I love store bought cookie dough cookies so much. But whenever I attempt homemade they come out pale, dense,  smelling eggy and baking soda/powdery. No matter the recipe I follow, whether I chill the dough or don’t, and I tried hnot to over mix after adding the flour and yet I’m still left with these. I want gooey chewy golden cookies but for the life of me I can’t understand what I’m doing wrong! Any advice? Thank you in advance! ",
        "num_comments": 474,
        "comments": [
            {
                "author": "starlight-rane",
                "body": "Looking at your previous comment I think not following the recipe is the biggest thing. Baking is almost like a science and when too many changes are made can cause things to go awry sometimes. I would try following the recipe as is without any subs.\n\nOr when in doubt, I’ve been making the toll house recipe for almost 20 years now (since I started learning how to bake), and my mom has been using it even longer. Try that one as it is written, if you haven’t already. (:"
            }
        ]
    },
    {
        "title": "Why did my pumpkin pie come out with a sponge texture?",
        "selftext": "Followed a pie recipe I found online exactly and both times they've come out with a sponge cake like texture instead of what pumpkin pie usually looks like.\nIm not experienced in baking so I have no idea what I did wrong, did I mix it wrong somehow or is it my oven? Or is it just supposed to look like this i do not know 😭😭",
        "num_comments": 96,
        "comments": [
            {
                "author": "epidemicsaints",
                "body": "This is a unique recipe, it has flour and leavening in it like a cake.\n\nA regular pumpkin pie is a custard made with eggs, milk, pumpkin, and sugar."
            }
        ]
    },
    {
        "title": "What is this rubbing off and why is it happening?",
        "selftext": "It’s stainless steel, I think it’s the base rubbing off but I’m not sure. Either way I’m concerned. Can anyone offer some insight?",
        "num_comments": 155,
        "comments": [
            {
                "author": "fneagen",
                "body": "Did you put it in the dishwasher? Because if so, that’s the reaction of the aluminum with the dishwashing detergent."
            }
        ]
    },
    {
        "title": "Why is one pale?",
        "selftext": "Same batch, same dough, baked on the same pan, in a rotating convection oven. We're at a loss.",
        "num_comments": 38,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "Why do I get these clumps when creaming butter?",
        "selftext": "",
        "num_comments": 116,
        "comments": [
            {
                "author": "pandada_",
                "body": "Your butter was too cold. Keep beating it until it smooths out"
            }
        ]
    },
    {
        "title": "Is this because I didn't chill?",
        "selftext": "This is the Nestlé recipe on the back of the cookies. I've made it many times before and have it come out just fine. This time, I cut the recipe in half, and I didn't chill the dough.\n\nThe first batch I baked at 375 for 9 minutes, as the recipe instructs. The second batch I decreased the heat to 350 and baked for 10 minutes. They turned out the same, deflating after removing from the oven. \n\nI assume this is because I didn't chill the dough. However, I also forgot to add the egg to the creamed butter and sugar until after I mixed the dry ingredients in. I'm not sure if this had an effect. ",
        "num_comments": 105,
        "comments": [
            {
                "author": "PansophicNostradamus",
                "body": "Looks like you used too much butter or not enough flour, that plus the egg mishap caused this. \n\nTry again, but double check the measurements and make sure the eggs go in after you cream the butter and sugar. \n\nMe? I’d still eat ‘em but I wouldn’t serve them. Baker’s treat!"
            }
        ]
    },
    {
        "title": "What went wrong? Tried baking a little cake in the Air Frier. Info in comments",
        "selftext": "",
        "num_comments": 144,
        "comments": [
            {
                "author": "Garconavecunreve",
                "body": "Clearly that knife did not come out clean…"
            }
        ]
    },
    {
        "title": "My crinkle cookies all get this little crust on them, I’m guessing it’s from the sugar melting? How do I fix it for next time?",
        "selftext": "",
        "num_comments": 81,
        "comments": [
            {
                "author": "FigWhisperer",
                "body": "I first roll them in granulated sugar, before rolling them in powdered sugar. The granulated sugar acts as a barrier so that the powdered sugar doesn't get dissolved by the cookies."
            }
        ]
    },
    {
        "title": "What can I bake in these? ",
        "selftext": "Will cupcakes rise too much? Brownies? Coikd I put cookie dough in them? Any savory ideas? \n\nI've had this pan for a few months and really want to use it :) ",
        "num_comments": 80,
        "comments": [
            {
                "author": "epidemicsaints",
                "body": "This is a nice one! These are usually gimmicky but this is cast iron. Do anything that you want to be a little crusty. Any muffin, brownie, cornbread, or drop biscuit.\n\nThe depth of the cups is nice, don't worry about things rising too much, use as any muffin tin."
            }
        ]
    },
    {
        "title": "First attempt at making puff pastry from scratch",
        "selftext": "I’m new to working with puff pastry, anyone have any tips to help improve the layers?\n\nRecipe- 500 grams flour\n1 1/4 tsps salt\n50 grams unsalted butter (melted and cooled)\n234 grams water\n300 grams butter (for the block)\n\nI laminated the dough 6 times and chilled it for 2 hours between every 2 folds.\nIt puffed up surprisingly well but I’m not 100 percent sure if the layers are correct \n\nAny advice would be greatly appreciated!",
        "num_comments": 20,
        "comments": [
            {
                "author": "juliacar",
                "body": "They look awesome"
            }
        ]
    },
    {
        "title": "What could have caused this?",
        "selftext": "This was a doubled recipe for M&M cookies using melted butter.  Epic fail! The dough was refrigerated overnight so wasn’t soft.  It could be due to one or several things:  \n1- Perhaps I didn’t double the baking soda?;\n2- I used dark brown sugar instead of light brown sugar;\n3- The melted butter wasn’t completely cooled to room temperature (it was lukewarm);\n4- I used spelt instead of all purpose flour (except I do this all the time with fine results).\n\nWhat do you think it was?\nWhat do you suggest I can do with the remainder of the cookie dough?\nThanks for listening. ",
        "num_comments": 180,
        "comments": [
            {
                "author": "Sea_Difference_3173",
                "body": "Looks like there isn’t enough flour"
            }
        ]
    },
    {
        "title": "helpp i accidentally made the mixes together rather than making them separately and combining, is this bad??",
        "selftext": "",
        "num_comments": 77,
        "comments": [
            {
                "author": "None",
                "body": "I have no idea but I would like to find out. Post an update OP"
            }
        ]
    },
    {
        "title": "Helpppp",
        "selftext": "Why do they look so thin? I was experimenting with shortening added in (only a tbsp) and 2 eggs instead of 1 and a yolk",
        "num_comments": 164,
        "comments": [
            {
                "author": "None",
                "body": "You answered your own question"
            }
        ]
    },
    {
        "title": "Tart shell fail",
        "selftext": "Hi guys. I tried making a tart but it just broke while baking. What can I do to prevent this in the future? I was planning to leave the tart to bake with the custard for about 2 hours at 135°C but this happened around half an hour in the oven.",
        "num_comments": 36,
        "comments": [
            {
                "author": "Fancy_Ad_5477",
                "body": "I leave the ring on until all the components are baked and cooled in the tart. Less chance of breakage"
            }
        ]
    },
    {
        "title": "What went wrong with my crust?",
        "selftext": "I made chocolate cheesecake using this recipe but the crust crumbled. I used graham crackers but followed the chilling time perfectly. Do you think it lacks butter or maybe I should’ve pressed more when setting the crust?\n\nThese are the instructions\n\nFor the base: \n1 + 1/2 cup (180gms) crushed biscuits \n3 tablespoons (37gms) melted butter\n\nRecipe link: \n\nhttps://youtu.be/4D9-gJgp4SI?si=InHStVF-CsBX5eKz",
        "num_comments": 107,
        "comments": [
            {
                "author": "Austin_Fiction",
                "body": "Its a combo of multiple things: Next time try:  \n1) Grinding the crackers finer  \n2) Adding a tad more butter than the recipe requires  \n3) Try packing it more than you did here\n\nAnyways it still looks sooo good, that I would eat it just like it is 😭❤"
            }
        ]
    },
    {
        "title": "I’m making mini layered cakes and will have some leftover cake bits. Is there anything I can do with it?",
        "selftext": "I plan on making mini layered cakes for Valentine’s Day for bring into work. I’m doing a trial run today. I’ve learned just how tilted my oven really is but also realized that I’ll have a good amount leftover cake bits. Maybe I should cut my circles closer together or use a slightly smaller cookie cutter so there’s less unused cake. Is there otherwise anything I can use the leftover cake for?",
        "num_comments": 586,
        "comments": [
            {
                "author": "juliacar",
                "body": "Eat them from the pan like a real baker"
            }
        ]
    },
    {
        "title": "Why do we divide dough into 3 pieces when making shokupan? And how can I make my bread more perfectly square?",
        "selftext": "Q#1: Most recipes I saw ask us to divide the dough into 3 equal pieces and roll it up before putting them into the pan. I also saw some people shaping their dough in one piece (lower left corner picture). So far I’ve only tried the top method. Is there any difference between the two?\n\nQ#2: is there anything I can do to make the bread more perfectly square, esp the top edges and corners? I use a pan similar to the one shown in the pictures, with a lid. 390F (convection), 25 minutes, as directed by the recipe.",
        "num_comments": 44,
        "comments": [
            {
                "author": "baapboopbeep",
                "body": "i work at a bakery that makes a ton of shokupan/milk bread. shokupan is a pretty slack dough so shaping it in pieces allows you to create more tension throughout the dough so it has a stronger structure and rises more evenly. if you shape it and bake it as a whole, it tends to collapse\n\nto get it more square, i would increase your total dough weight in the pan or proof for slightly longer but that would also slightly change your final texture"
            }
        ]
    },
    {
        "title": "How to get dye free food coloring to be more vibrant",
        "selftext": "This is my second attempt at royal icing cookies. I was wondering how do other people get their dye free icing to be more vibrant?? For the joy cookie I wanted a deeper like Christmas red and all I achieved was a dark pink lol. Give me all the tips and tricks please. Links would be amazing also! Like do y’all use the powders to make it dye free or the liquid? I used the Watkins dye free food coloring and it wasn’t cutting it. Thank you! ❤️\n",
        "num_comments": 53,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "Help! Trying to make Swiss Meringue but got glue",
        "selftext": "I'm trying to make some Swiss meringue to mix with mascarone cream, to make Tiramisu and compare with no-egg-whites, no-whipping-cream version.\nSo I put the 1 egg white & 25g granulated sugar mixture in this handy small pot, and hold it over a pan of simmering water for Bain-Marie.\nThen I whisked and whisked for some minutes, using my IR thermometer to read the mixture temp once in a while, expecting it to go to 70°C to be pasteurised.\n*But it never went over 50-51 °C* until the mixture become sticky like glue or toffee. I suppose it's gone too far to be whipped up now.\nWhat could possibly went wrong in this case?\n Thanks!",
        "num_comments": 41,
        "comments": [
            {
                "author": "HawthorneUK",
                "body": "Your IR thermometer won't give accurate readings - it's reading the very, very top layer of a foam that cools down super fast, and insulates the stuff at the bottom.\n\nIt's overcooked."
            }
        ]
    },
    {
        "title": "Weird texture in pound cake",
        "selftext": "Made this lemon poppy seed pound cake and it looked beautiful but the texture inside seemed odd. Tasted great. Only substitute I made was for almond milk instead of whole milk. What the heck happened?\n\nhttps://preppykitchen.com/lemon-poppy-seed-pound-cake/",
        "num_comments": 72,
        "comments": [
            {
                "author": "Gracefulchemist",
                "body": "Subbing almond milk can cause changes because of the higher water content compared to whole milk, and you may actually have under mixed the batter."
            }
        ]
    },
    {
        "title": "How can I get that cracked texture?",
        "selftext": "I started making red velvet cookies with cake mix flour and in the post I saw them they have that cracked texture but mine turn out smooth I added a little flour to the mix but that's it, that little flour changed them? ",
        "num_comments": 51,
        "comments": [
            {
                "author": "charcoalhibiscus",
                "body": "Yes, a little flour can definitely change them.\n\nThe “crackle” comes from the cookie’s spread; it puffs up while baking, forms a skin, and then contracts back down. If the butter/sugar proportion to the flour isn’t right, it won’t do it properly."
            }
        ]
    },
    {
        "title": "I’ve made two batches of vanilla extract that are going along nicely and smell genuinely but my almond extract still smells like strong vodka does anyone know what i did wrong",
        "selftext": "",
        "num_comments": 161,
        "comments": [
            {
                "author": "maccrogenoff",
                "body": "Almond extract is made from bitter almonds.\n\nhttps://www.simplyrecipes.com/what-is-almond-extract-5210081"
            }
        ]
    },
    {
        "title": "Anybody else almost always reduce the sugar in recipes?",
        "selftext": "Hi guys,\n\nThis post was prompted by making my first baked cheesecake. I followed this [King Arthur Baking recipe](https://www.kingarthurbaking.com/recipes/ny-cheesecake-recipe) which calls 347g of sugar. Thought that was a little crazy, so reduced it to 190g. So the cheesecake is done and it's DELICIOUS but *very* rich, to the point where I can't imagine what it would've been like if I used the full amount of sugar.\n\nI do this a lot with cakes, tarts and muffins (what I usually make) and have never had any problems, so I do wonder why recipes contain such a high amount of sugar. I guess a follow up question would be are there any particular bakes where you absolutely need the amount of sugar specified?",
        "num_comments": 130,
        "comments": [
            {
                "author": "AdkRaine11",
                "body": "Well, my policy had been to make a recipe as written, then modify.  I think part of being a successful baker, you need to test things.  And I would never reduce sugar to less than half, right off the bat.  Recipes can be played with, but most recipes are tested multiple times, so if I change too much at once, it’s hard to tease out what did what.  But that’s me."
            }
        ]
    },
    {
        "title": "Got this cute mini bundt pan from the thrift store. What should I make?",
        "selftext": "Y’all got any ideas for cake or dessert that are particularly well-suited in a small size?",
        "num_comments": 155,
        "comments": [
            {
                "author": "Mr_Whatever_",
                "body": "Mini Bundt cakes"
            }
        ]
    },
    {
        "title": "What am I doing wrong with these soufflés? They were in the oven for over 25 min and still soaked in the center. ",
        "selftext": "",
        "num_comments": 73,
        "comments": [
            {
                "author": "RemarkableMouse2",
                "body": "What recipe did you use? No one can tell you what you did wrong without more information. "
            }
        ]
    },
    {
        "title": "Is this burnt?",
        "selftext": "I made this \"Healthy chocolate cake\" using flour, water, cocoa powder, granulated sweetener, baking soda, apple sauce and water. I know it's ugly af, but although it looks kinda burnt, it doesn't taste burnt at all, does burnt chocolate cake tastes burnt? Is this edible? Thanks!",
        "num_comments": 108,
        "comments": [
            {
                "author": "unicornfarthappyhour",
                "body": "the poison control hotline in the US is 800-222-1222\n\nplease let us know if you survive the \"cake\""
            }
        ]
    },
    {
        "title": "I sell cookies made with sugar-coated nuts like almond flakes and sunflower seeds, but after three months, the sunflower seeds develop a distinct smell. How can I extend their shelf life?",
        "selftext": "Here’s the simplified recipe:\n\n- I mix almond flakes, sunflower seeds, black sesame seeds, and pumpkin seeds with powdered sugar.\n\n- Then, I flatten the mixture in a tray and bake it at 185°C (365°F) for 10 minutes.\n\n- Once the sugar has melted and caramelized, I remove the tray from the oven, cut the cookies while they’re still hot, and wait for them to cool. Then, I store them in a black plastic container (see the 3rd picture).\n\n- Next, I add a freshness chip (see the 4th picture) and seal the container with yellow tape to protect the cookies from air exposure.\n\nI’m not sure what went wrong, but after 3 months, the cookies develop a distinct smell. The taste remains the same, and the texture is still crispy, but the smell is the issue.\n\nBased on my investigation, it seems the smell is coming from the sunflower seeds. Is there a way to stop the sunflower seeds from developing this smell, or at least extend the freshness for more than 3 months?",
        "num_comments": 94,
        "comments": [
            {
                "author": "bakedbymaude",
                "body": "I'm gonna be annoying and not directly answer your question, sorry! I just think it's 100% reasonable to tell customers that the shelf life of the cookies is x amount of time, and offer them freezing and thawing instructions if they want to extend the life. That's what I do with my sugar cookies, and I don't think anyone is surprised or disappointed to learn that they won't stay tasty left on the counter indefinitely."
            }
        ]
    },
    {
        "title": "Icing colour help me",
        "selftext": "Helloooo bakers! I need some help in achieving this icing colour. I tried lime green on its own but it came out more of the colour of The Grinch! I’m not sure what it needs, possibly a hint of yellow maybe? Picture of my attempt in the comments! ",
        "num_comments": 27,
        "comments": [
            {
                "author": "None",
                "body": "I feel like the sample photo is actually a bit deeper than your attempt, meaning a bit of blue (color theory: yellow will make it lighter, more sharp and blue will make it darker, more muted). I’m thinking just a tiny bit would take the grinch out ;)"
            }
        ]
    },
    {
        "title": "Any ideas why my Pumpkin Pie has this big gap in it? ",
        "selftext": "It came out like this after baking. We used fresh pumpkin purée. Do you think we did not strain the purée of water enough? Any help would be appreciated.",
        "num_comments": 64,
        "comments": [
            {
                "author": "harpquin",
                "body": "It looks like it's under the crust and the result of a gas bubble."
            }
        ]
    },
    {
        "title": "Why did my chocolate chip cookies turn out like this?",
        "selftext": "I tried making chocolate chip cookies but got these gooey pancakes instead. No idea what when wrong ):\n\nThe recipe I followed:\n\nINSTRUCTIONS:\n-Add: 1/2 cup of sugar\n-Add: 3/4 brown sugar\n-Add: 1 teaspoon of salt \n-Add: 1/2 cup of butter\nMIX!!\nAdd: 1 egg\nAdd: 1 tablespoon of vanilla\nMIX!!\n-Sift: 1 1/4 cup of flour\n-Sift: 1/2:  tablespoon of baking soda\nMIX!!\n-Add Half bag of chocolate chips!\nMIX!! (I ended up using my hands because it was a lot easier)\n-Cover with plastic wrap and Chill for 30 minuets\n-Scoop on baking try with parchment paper \n-Bake 350 F for 12-15 min\n\n\nI still have some of the cookie dough left. Is this salvageable? What am I missing?",
        "num_comments": 218,
        "comments": [
            {
                "author": "pandada_",
                "body": "For one thing… where are the chocolate chips? I don’t see any.\n\nDid you use softened butter and cream it with the sugar? It also looks like the dough was too warm when going into the oven so chill the dough balls after you’ve scooped before baking"
            }
        ]
    },
    {
        "title": "Anyone else experience increased frequency in \"exploding\" butter when melting in the microwave?",
        "selftext": "I'm starting to wonder if the theories of increased water content in butter is true...\n\nI've used the same microwave to melt the same kind of butter (Costco's Kirkland unsalted) for YEARS with no issues. In the past 4-5 months, it keeps exploding and then I'm stuck wiping butter off the ceiling and door of my microwave. Even if I turn down the power and/or baby the hell out of the butter by microwaving at 5-10 second intervals, it keeps happening and it's starting to piss me off.\n\nAnyone else experience this? Any tips/tricks on how to prevent this from happening or at least minimizing the mess? I know melting it on the stove is probably the most common solution, but I'm lazy and don't want to wash any more dishes than I have to. Hell, I've managed to adjust most of my dessert recipes to require 1-2 dishes, as long as I can melt butter in the microwave.",
        "num_comments": 130,
        "comments": [
            {
                "author": "Ginger_Libra",
                "body": "[Bakers Are Convinced Costco's Butter Ruined Their Holiday Recipes](https://www.delish.com/food-news/a45974946/costco-butter-reddit/)"
            }
        ]
    },
    {
        "title": "My apple cider caramel split only after refrigerating",
        "selftext": "The thing is, I didn't expect it to turn out well because I didn't have cream and panicked so I used milk hahaha do you think that's the only problem?\nThe top layer is butter and then the bottom two are both caramel but I don't know what split there? So funky looking. ",
        "num_comments": 15,
        "comments": [
            {
                "author": "cancat918",
                "body": "May we see the recipe you followed and any other substitutes you made? It's very difficult to address it properly otherwise."
            }
        ]
    },
    {
        "title": "Is this brown butter burnt or good?",
        "selftext": "I can’t taste it because I’m vegan, making this for someone else.",
        "num_comments": 74,
        "comments": [
            {
                "author": "epidemicsaints",
                "body": "We need to see the solids. They should be dark like the bottom of an overbaked cookie. If it looks like coffee grounds, it's burnt.\n\nI would say go by the smell but if you don't eat butter it probably smells rancid to you. It should have a toffee/cheese smell, not a burnt/puke smell.\n\nIt looks good to me but it is right on the edge."
            }
        ]
    },
    {
        "title": "Why isn’t my no-knead bread rising well?",
        "selftext": "Full disclosure, I am a total novice baker. This is my second time baking this bread, and I just can’t seem to get the dough to rise in the oven. I’m following a video/recipe, so I’m not sure where I’m going wrong. The baker in the video shows two ways of preparing this no-knead dough, and the second way (the one I’m following) is supposed to yield a really aerated loaf! When I make it, the dough itself seems to rise the way it’s supposed to (about 2x its original size) while proofing, but it looks like it’s deflating in the oven instead of rising.\n\nStep 1: Whisk together 1.25 cups water, 1 packet of yeast, and about 2 tsp salt. \n\nStep 2: Add 3 cups of flour and mix until it comes together in a wet, sticky dough.\n\nStep 3: Do series of stretch and folds every 30 minutes for 2 hours. Totals to 4 series of stretch and folds.\n\nStep 4: Preheat oven to 425 Fahrenheit with Dutch oven inside. Once it’s nice and hot, sprinkle flour in pot and plop dough inside. Sprinkle with more flour.\n\nStep 5: Bake for 30 min at 425 with the lid on. Then remove lid and cook for additional 15-20 minutes till the desired color is reached. \n\nAdjustments I’ve tried: \n\nI used King Arthur AP flour the first time. This time, I used bread flour thinking the higher protein might result in a stronger rise, but no luck. I was also more careful in measuring my flour, spooning it into the measuring cup instead of scooping from the bag.\n\nI used lukewarm water the first time, and room temp water this time. Both times the dough was left on the counter to proof per the recipe’s suggestion, and my house isn’t particularly cold.\n\nI’d love to get your thoughts!",
        "num_comments": 101,
        "comments": [
            {
                "author": "pandada_",
                "body": "Have you checked if your yeast is still good?"
            }
        ]
    },
    {
        "title": "Why do the tops of my muffins have a rough surface",
        "selftext": "I've linked the recipe I used in the comments.",
        "num_comments": 43,
        "comments": [
            {
                "author": "raeality",
                "body": "This is a common look for banana muffins due to the moisture in bananas. The reason yours may look different than the photo for the recipe may be because the recipe gives the banana amount in number of bananas which can vary greatly in size. Using a specific volume measure or weight will yield more consistent results. Banana bread or muffin recipes with lower banana and higher flour content usually have smoother tops. Any muffin high in fruit content (applesauce, banana, etc) tends to get that bumpy wet look on top."
            }
        ]
    },
    {
        "title": "I was trying to make brownies but, I think I actually made chocolate cake. How does that happen ",
        "selftext": "",
        "num_comments": 153,
        "comments": [
            {
                "author": "KetoLurkerHereAgain",
                "body": "Odds are that you made a mistake in the doubling but just didn't realize it."
            }
        ]
    },
    {
        "title": "Compressed Cake Layers 😖",
        "selftext": "I think my cake layers are getting compressed by the weight. The cake ends up being very dense. \n- I’m baking each layer in a silicone pan. Could that have something to do with it? \n-Should I use a taller pan and split the layers instead? \n- Or is it my recipe… I doctor box cake mix for really moist Bundt cakes. (Yogurt replaces water, add one box of complimentary flavored pudding mix, add 2 Tbls white sugar - adds sweetness and keeps cake moist, splash vanilla, shake of salt, a glob of mayo, and the same number of eggs and oil as on package)\nIs there a method of supporting a tall cake to avoid this?",
        "num_comments": 80,
        "comments": [
            {
                "author": "kajacana",
                "body": "At first look, that is a wild amount of filling between the layers — looks like each filling layer is the same height as a cake layer! It’s way too much. The weight could definitely be a factor, especially when combined with what sounds like a really moist and squishy cake (unpleasantly so, if I’m being honest — cake mix with added sugar and mayo just seems unnecessary for many reasons — but if you like it then you do you). Some cakes just don’t do well when stacked, and 4 cake layers making a 7 layer cake can be pushing it even with more structurally sound cake recipes. I’d try scaling the filling way back, doing fewer layers, and maybe consider not modifying the cake ingredients so much. A cake mix prepared as directed will not be the same structurally as one with lots of added ingredients."
            }
        ]
    },
    {
        "title": "red velvet chocolate chip cookies - why the red food coloring didn’t work?",
        "selftext": "",
        "num_comments": 99,
        "comments": [
            {
                "author": "41942319",
                "body": "Looks like you added too much chocolate. For red velvet you only need a smidge to give it a slightly darker colour, it shouldn't actually be brown. The brown will \"cover over\" the red"
            }
        ]
    },
    {
        "title": "Donuts…how to make the glaze fall through the hole to show the hole?",
        "selftext": "",
        "num_comments": 44,
        "comments": [
            {
                "author": "katiegam",
                "body": "You can thin out the glaze but you can also just use a skewer after you pour over to poke a hole in the center which will make the glaze drop down and not stay consistent all the way across."
            }
        ]
    },
    {
        "title": "Chicken looking cake ",
        "selftext": "Hello guys I'm willing to make a chicken looking cake but I'm a beginner, I have a round 2 moths to accomplish my wish. Is going to be a gift\n\nI need any tip on cake chocolate cake making, and principally on how to make a resistant whipped cream, that can resist the cake form, because the whipped cream will be on horizontal and vertical positions (not upside down), and any recommendations on how to preserve it, my city gets really hot in summer.\n\nThanks🙏🏽 ",
        "num_comments": 27,
        "comments": [
            {
                "author": "pandada_",
                "body": "Does it have to be whipped cream? It’ll be very hard to accomplish that in the hotter months if that’s all you’re open to using"
            }
        ]
    },
    {
        "title": "Is Wilton food coloring awful or did I get a dud?",
        "selftext": "Bought two things of this food coloring from my local Walmart and was so bad it made my icing taste like chemicals/earwax and had to toss it. It was a real bummer since it's so affordable. Is that... normal, lmao? Or did it go bad in the store?",
        "num_comments": 71,
        "comments": [
            {
                "author": "Dazeyy619",
                "body": "How much did you use? With coloring like this you only need a dab of it. Very little. Thats why this yellow is showing as orange or red in the container."
            }
        ]
    },
    {
        "title": "Is there a website out there that verifies whether or not recipes work? Writing this while eating pieces of failed cake in my yogurt.",
        "selftext": "Although the internet is a magical place full of cutesy bloggers who promote their recipes as the BEST, the MOISTEST and the EASIEST, I found that baking a lot of these recipes had quite the opposite outcome. I get it; a lot of my cookbooks have errors like that as well, it happens.\n\nNowadays, I usually see red flags in the ingredients list before I start baking because of experience, but sometimes my cloudy brain does not pay attention at all. It would be great if y’all have recommendations regarding sites that list recipes that have been tested and verified. Any tips? Thanks <3\n\n**Edit:** Super-helpful comments, thanks, everyone!\n\n**Additional edit:** Although there does not seem to be a specific website (yet, u/brangeloo might make it happen) of the kind I'm describing above, I hereby give you a brief summary of the recommendations in this thread:\n\n* When in doubt, use reviews as a point of reference: More in-depth reviews are usually legit, look for pictures to see actual results.\n* Blogs with long-ass stories about the lives of the bloggers that contain more substance than the recipe itself are most definitely a red flag. Don't blindly click the \"skip to recipe\" button, it's not a blessing in disguise. \n* If you don't want to put in too much effort in finding out whether or not a recipe is legit, stick to the mainstream names(e.g. Mary Berry/Martha Stewart/Anna Olson/Ina Garten, etc won't put their name on something that hasn't been tested) or go the traditional route by finding a well-renowned cookbook.\n* This thread seems to crown Sally's Baking Addiction as most reliable! URL: [https://sallysbakingaddiction.com/](https://sallysbakingaddiction.com/)\n* Other websites mentioned:   \n\\- [https://leitesculinaria.com/](https://leitesculinaria.com/)   \n\\-[https://smittenkitchen.com/](https://smittenkitchen.com/)  \n\\-[http://bravetart.com/](http://bravetart.com/)  \n\\-[https://food52.com/](https://food52.com/)  \n\\-[https://www.americastestkitchen.com/recipes](https://www.americastestkitchen.com/recipes)  \n\\-[https://www.kingarthurbaking.com/](https://www.kingarthurbaking.com/) (Comments are mixed about this, some are enthusiastic while others are not)",
        "num_comments": 141,
        "comments": [
            {
                "author": "toefurkyfuckmittens",
                "body": "Sally's Baking Addiction and King Arthur Flour both have solid recipes! Both have already been recommended in other comments as well. I check KA first for breads but Sally is my go-to for anything else. \n\nThe thing I like best about Sally is that instead of dumb blogs about being a soccer mom or the perils of rainy-season mud, you get solid writing about technique, other relevant or similar or complementary recipes, etc. My baking has definitely improved over the last few years and I'm sure Sally's recipes and writings are at least partly responsible."
            }
        ]
    },
    {
        "title": "Why did my cinnamon rolls do this?",
        "selftext": "I think I may have packed them too tightly in the pan, or rolled them too tightly?\n\n\nThey definitely burnt :/",
        "num_comments": 66,
        "comments": [
            {
                "author": "pandada_",
                "body": "Your oven was likely too hot which is why the tops are burnt"
            }
        ]
    },
    {
        "title": "What is this kitchen tool used for?",
        "selftext": "",
        "num_comments": 70,
        "comments": [
            {
                "author": "None",
                "body": "[deleted]"
            }
        ]
    },
    {
        "title": "Advice for next time - remove Princess Cake from bowl.",
        "selftext": "This was my first ever go at a princess cake (Nicola Lamb/NYT recipe) and it took me 45 minutes to remove the dang thing from the bowl I constructed it in. I ended up freezing it for 15 min and prying it out with a knife/icing spatula. What did I do wrong? More icing sugar between marzipan and bowl? Plastic wrap seems like it would leave marks on marzipan? I almost gave up on this one.",
        "num_comments": 50,
        "comments": [
            {
                "author": "Admirable-Shape-4418",
                "body": "Didn't know they were constructed in a bowl in the first place, only ever saw them being made with just the dome formed with cream and then marzipanned over a la Bake Off style"
            }
        ]
    },
    {
        "title": "Homemade Rice Krispies",
        "selftext": "Hey, I don't know if this is the right place to post but... I've been trying to make rice Krispies with homemade marshmallows and every single time they turn out tasting stake or just don't have any real flavour. \n\nThis is the recipe I follow:\n\n- 8Tbsp (112 g) butter\n- 20 oz of my homemade marshmallows (appx 10 cups) {they contain sugar, vanilla, golden syrup, gelatine, and water}\n-10 cups fresh RK cereal\n\nI melt the butter fully on a low heat, then melt my marshmallows until all the marshmallows are gooey, but not fully melted, then the first time I poured the cereal in by the cup full. This time it turned out stale so I did a bit more research and tried pouring it on top. This time it tastes sweet and the inside has a nice texture, but there is no real flavour to them. \n\nAny ideas what I am doing wrong?",
        "num_comments": 85,
        "comments": [
            {
                "author": "sauceelover",
                "body": "I just made a batch where I browned my butter, added vanilla bean powder, and extra salt….they are so. Good."
            }
        ]
    },
    {
        "title": "What did I do wrong with my olive oil cake?",
        "selftext": "\nFirst attempt and first time trying it ever. It looked great in the oven but it fell shortly after I took it out. I turned it over to decorate it, so the bottom part looks more like cake and the top part looks totally compact. The only thing I changed in the recipe was using nuts milk instead of regular because of intolerance, but usually that’s not a problem. It tastes good though, so we ate it anyway. What did I do wrong here?\n\nRecipe: https://theviewfromgreatisland.com/lemon-olive-oil-cake/",
        "num_comments": 149,
        "comments": [
            {
                "author": "cameronm-h",
                "body": "Looks plain underbaked to me. Maybe baking soda and/or powder was out of date?"
            }
        ]
    },
    {
        "title": "Frosting that pairs well with Earl Grey Cupcakes?",
        "selftext": "My friend wants cupcakes for a garden party themed wedding in June and I’m gonna experiment with earl grey cupcake base beforehand. Any ideas of frosting flavors that would pair well with Earl grey? Would lavender be too much? Lemon? Idk! \n\nAny insight would be appreciated!",
        "num_comments": 247,
        "comments": [
            {
                "author": "Aromatic_Razzmatazz",
                "body": "Could you do a blow torched meringue instead of frosting? Earl grey is so subtle, flavoring your frosting is going to overpower and be the dominant flavor, which if you want that, go for the lemon! But if you want the earl grey to be the star, I vote a meringue."
            }
        ]
    },
    {
        "title": "What happened to my mix? ",
        "selftext": "What happened to my mix?  It's supposed to be Christina tosi's chocolate chip cake recipie\n\n1 stick butter room temp\n250g White sugar \n60g brown sugar\n3 eggs room temp\n110g buttermilk room temp\n75g oil\nVanilla\n\nRecipie called for it to be mixed on medium-high for 5 min, until basically white before adding in dry ingredients .Obviously dries haven't been added yet, but I know my wet ingredients aren't supposed to look like this. Did I over mix? ",
        "num_comments": 66,
        "comments": [
            {
                "author": "CreamPuff82",
                "body": "Is there a link to the recipe? Generally, you cream the butter and the sugar until it's light and fluffy for about 5 minutes. Not all the wet ingredients at once."
            }
        ]
    },
    {
        "title": "Is anyone else constantly bothered by recipes online that say to preheat the oven first, but then say that the dough has to sit/chill?",
        "selftext": "Like yes, I'm going to have the oven running for over a half hour while my dough is chilling... Do these people proofread?\n\nEdit: I understand some ovens take longer to preheat, but some of these recipes don’t even include any other mention of a chill time. That or it’s for a longer time than needed for an oven to heat, like an hour. Just instances of poorly written recipes.",
        "num_comments": 63,
        "comments": [
            {
                "author": "None",
                "body": "Unrelated but I hate when I see a 5 star review and the comment is “looks great! Can’t wait to try it!”"
            }
        ]
    },
    {
        "title": "Why can't I get rid of the lumps in my cream cheese? ",
        "selftext": "My cream cheese was at room temperature along with my butter when I put it in the mixer and it looked creamy before I put in my puree but now I can't seem to get rid of these tiny lumps of cream cheese.\n\nThe puree is fresh blackberries that were also at room temperature when I blended them up and added them to my mix.\n\nI've had the mixer running for several minutes and nothing seems to be changing.\n\nIngredients:\n\n4 tbs butter\n2.5 c of powdered sugar\n8 oz full fat generic cream cheese\n.5 cup of puree",
        "num_comments": 114,
        "comments": [
            {
                "author": "ThotsforTaterTots",
                "body": "For a moment I thought I was looking at a frightening flesh disease."
            }
        ]
    },
    {
        "title": "NYT Cheesecake Recipe",
        "selftext": "I have baked the NYT Tall and Creamy Cheesecake recipe twice now and both times it came out well. However the cheesecake was brown on the top and slightly sunken in the middle. This is what the image on the recipe looked like, but my understanding is that both of these are indicative of a bad bake. Brown on top means baked too long at too high a temp while sinking in the middle means over whipped filling.\n\nDoes anybody have experience with this recipe? Is that just the way this is supposed to look?\n\nUnfortunately I don't have a picture of a slice of the second one. The first was more dense than I wanted so I whipped the second one for longer, which made the final product lighter. Other than that they came out pretty identical in terms of browning and sinking.",
        "num_comments": 33,
        "comments": [
            {
                "author": "pandada_",
                "body": "Next time, when the top is starting to brown, cover it loosely with foil but continue to bake it. It collapses in the middle if it cools too fast. Leave it in the oven for at least an hour with the oven door slightly cracked"
            }
        ]
    },
    {
        "title": "Family candy recipe no longer turning out like it used to",
        "selftext": "In my family, we have an English Butter Toffee recipe that is universally beloved. My mom made it every Christmas and I gradually took over. It’s a simple enough recipe, but hard to nail. After years of practice, I was making excellent batches every time.\n\nThe candy is a layer of toffee and a layer of chocolate. You freeze it and then break it into pieces like bark. About ten years ago though, something strange started to happen—breaking the candy into pieces caused the chocolate layer to separate from the toffee layer. At first it happened once or twice, and then all the time. My mom and I can’t figure out what we’re doing wrong. We haven’t change how we’ve done it or the ingredients. For a while we thought it might be because we weren’t using fresh ingredients, but it still happens even when everything comes straight from the grocery store. Can anyone explain what is happening and what we can do to stop it? It would mean so much to us!\n\nRecipe below ⬇️ \n\n2 sticks margarine (Imperial) (note: can’t be substituted with butter)\n3 T. Water\n1 T. Lite Karo Syrup\n3/4 C. Sugar\n1 C. Chopped Pecans\n1 bag semi-sweet chocolate chips (minis works best)\n\nMelt margarine in an electric frying pan at 350 degrees. Add water, Karo syrup, and sugar. Stir constantly until toffee reaches desired consistency and color (about 10 min). Stir in pecans. Pour into a jelly roll pan. Spread to edges of pan. Top with chocolate chips. Once the chocolate melts, spread with rubber scrapper/spatula in a uniform layer. Freeze for at least two hours. Break into pieces. Enjoy!\n\nEDIT: Wow! So much interest! So, I’ve attempted to make two more batches. The first I used butter - turned out soupy with a different flavor, BUT it stuck to the chocolate fine. I think we can safely assume Imperial is the issue. The second batch I swapped Imperial for Land O Lakes margarine. I ended up with the same consistency as the butter and it didn’t stick. Third attempt: one stick Imperial, one stick butter-flavored Crisco. Stay tuned!",
        "num_comments": 177,
        "comments": [
            {
                "author": "LuzjuLeviathan",
                "body": "\"we haven't changed ingredients\" are you sure the company haven't changed ingredients in the ingredients you use?"
            }
        ]
    },
    {
        "title": "How to get this color cake? ",
        "selftext": "I want this deep red of a cake (more like the second one) and I can’t seem to create the color. Does anyone know how to make the color?",
        "num_comments": 53,
        "comments": [
            {
                "author": "Thbbbt_Thbbbt",
                "body": "I would try a chocolate buttercream + red food coloring gel or powder."
            }
        ]
    },
    {
        "title": "First time making bread and my the dough didn’t rise, so i re-kneaded it, is it possible i ruined it?",
        "selftext": "",
        "num_comments": 124,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "Messed up my pumpkin roll, what should I do to not waste it?",
        "selftext": "Attempted a pumpkin roll but misread the recipe and accidentally added 3 times as much pumpkin puree from what the recipe called for 🫣🫣🫣\n\nObviously I can’t make it into a roll anymore, the texture is all off. But is there anything salvageable I can do with this extra-pumpkin-y flat cake to make it worth eating? It’s just some extra pumpkin, I don’t want it to go to waste. What would you do? ",
        "num_comments": 155,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please  remember to read the [rules] (https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all requirements. Posts that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "What are these sprinkles called?",
        "selftext": "The white sugar looking stuff, I know there’s a specific name for them I just can’t think of it.",
        "num_comments": 35,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please remember to read the [rules](https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all the requirements. Posts or comments that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "Why did my cakes do this? ",
        "selftext": "Got new 6” cake pans and made a cake tonight. After baking and letting cool for 10 minutes, the edges came off when I removed from the pans. Any thoughts, suggestions or advice? Thanks in advance ",
        "num_comments": 37,
        "comments": [
            {
                "author": "Garconavecunreve",
                "body": "Too hot oven and improper pan preparation would be my guess"
            }
        ]
    },
    {
        "title": "I love whipped cream cakes but…",
        "selftext": "I love whipped cream cakes, I always use whipped cream on my cakes but I’ve never tried to draw anything on them. My sister is graduating this year and I want to draw a picture of squid ward holding a diploma and looking all beat up on top of a cake but I’m not sure what frosting to use to draw it.  I thought of royal icing but some sources say it will melt. I’ am in no way professional or know how to decorate a cake, I just want to give it a try. \nIf anyone  have suggestions about what icing to use to draw the pic or frosting that’s similar in taste to whipped cream but is easier to pipe please let me know.",
        "num_comments": 28,
        "comments": [
            {
                "author": "Miserable-Strain7709",
                "body": "So my favorite thing to do with these is a chocolate transfer. I print out a mirrored image of what I want to draw, and put the paper either under some parchment or inside a sheet protector. Once that’s set I’ll melt a ton of good quality white chocolate and dye it to all of my needed colors, and put them all into their own piping bags. I like to keep them over a warm plate to keep the chocolate liquid. Start with the finest details and outlines, and then flood your background colors over it. Pop it in the fridge and then peel it off and stick it on your cake!"
            }
        ]
    },
    {
        "title": "Help! I made this crustless custard pie and completely messed it up! 😫",
        "selftext": "I baked it for 60 minutes at 300°. It seemed runny in the middle when I took it out, but I figured that it would firm up after I had it in the fridge for a few hours. Six hours later and it's a runny mess in the middle still! It's more set around the edges, but the middle is pretty soupy. Can this be saved?? ",
        "num_comments": 28,
        "comments": [
            {
                "author": "Low_Committee1250",
                "body": "I'm sure it's still tasty I would scoop some into a bowl and top with whipped cream and eat w a spoon like custard or rice pudding . Custard pie is done when:\nCrust should be golden and filling will be puffed at perimeter with small jiggle in center, and when the tip of a knife in the center comes out clean. The temperature of the pie at the center should be between 170°F and 180 on an instant read temperature probe.\nI hope this helps!(I also love adding flaked coconut for coconut custard pie)"
            }
        ]
    },
    {
        "title": "What did I do wrong when baking chocolate chip cookies?",
        "selftext": "Please don’t be too harsh. It’s my second time baking chocolate chip cookies. I followed the recipe on YouTube by Natasha’s Kitchen: https://youtu.be/YEZPxhMneOc?si=jbD-rxsAyYvOKR3-\n\nWhy are they so puffed up and cracked? I’m trying to figure out what I did wrong so I can try again next time. \n\nI made three batches. \nFirst batch: Looked too light in color and tasted a bit floury. I baked them at 350 degrees in the oven for about 15~ minutes. Slightly larger than ice cream scooper sized balls. \n\nSecond batch: Made the dough balls smaller and baked them at 350 degrees for about 22~ minutes. Looked a lot darker in color, but still too cracked. Tasted less floury, but not the chewy consistency I hoped.\n\nThird batch: I baked them at 340 degrees in the oven for about 15~ minutes. Slightly larger than ice cream scooper sized balls. Used two parchment paper sheets. Tasted too rough. \n\nDid I possibly overmix? What causes cookies to look cracked and dry? I want to be able to bake soft cookies like in the recipe 🍪 ",
        "num_comments": 96,
        "comments": [
            {
                "author": "thoughtandprayer",
                "body": "Are you measuring your ingredients by weight or by volume? It looks to me like you are consistently using too much flour."
            }
        ]
    },
    {
        "title": "Macaron browning",
        "selftext": "Hey all! This was the first attempt at macarons, I am super proud of the end result and they are equally delicious! Though I can’t understand why my batch lost color as they were being baked in the oven. Any ideas? Thanks! ",
        "num_comments": 20,
        "comments": [
            {
                "author": "HumpaDaBear",
                "body": "You might be using a food dye that might change when drying or the heat might be doing it. Double check the label. They’re still incredible looking!"
            }
        ]
    },
    {
        "title": "Can I fix this or change it to something else? Stabilized whipped cream question",
        "selftext": "Howdy! \n\nI saw the super cute lobster cake on Pinterest and TikTok and thought I wanted to try it. My friend is from New England originally and thought it would be super cute to make for her birthday. She is also from an Italian family and brings in food all the time, so I thought (in my flavor focused mind) I wanted to make a vanilla cake with a strawberry simple syrup, with a whipped cream frosting and use ricotta to stabilize it. \n\nI whipped the tar out of the ricotta, added 2 cups of whipping cream, let that go, added some sugar. It wasn’t developing peaks. So I put the bowl in the fridge. Let everything get cold. I bloomed a little gelatin just in case (1.5 teaspoons of gelatin+ 1.5 tablespoons of water, let that set, then when I was ready to use I microwaved it to get thin). Started whipping, nothing. Added the gelatin. I’ve made stabilized whipped cream, I know that trick. Nothing. No peaks… not even soft. Added some powdered sugar to maybe…? Put everything back in the fridge again. Let everything get super cold tried to whip it again. Doubled the amount of gelatin (so a whole packet of it), added water, let it gel, then microwaved. Put the mixing bowl in the freezer for 30 minutes. Slowly added the liquid gelatin. Nothing. I’m whipping for 10 minutes at a time. \n\nI finally put that mix in another bowl and just made some buttercream icing. Adding some ricotta, for flavor (in my brain ricotta and strawberries got well together). My buttercream was soft and I was over it so… The picture is the final cake. \n\nMy question is can this ricotta/whipping cream/gelatin thing be saved? Or repurposed? I’d hate to throw it away. Thank you in advance. Like I know how to bake. I’ve never had this issue before and it’s weird. ",
        "num_comments": 34,
        "comments": [
            {
                "author": "thecakebroad",
                "body": "I think it's a lost cause unless you can make ice cream from it. \nAny time you're adding an ingredient to whipped cream, you want to get your whipping cream to at least a soft peak before any additions because it'll be too heavy to get to any chance of actually getting to a whipped point. In my experience, I could stand corrected, but I have lost a good amount of time and money (in whipped cream) learning this the hard way. \n\nAlso, especially when it's hot and humid outside, I always put my bowl and whisk into the fridge before starting. Cream in the bowl, get it all really good first. Whipped cream is such a fickle fanny, but so darn good.lol."
            }
        ]
    },
    {
        "title": "What type of pan is this?",
        "selftext": "This is a pampered chef pan that was gifted to me in a set of baking wear from a deceased relative. It is similar to a tart pan but the bottom is fixed in place and it has a deeper crust ring. Anyone know what this is used for?",
        "num_comments": 90,
        "comments": [
            {
                "author": "wheres_the_revolt",
                "body": "[It’s a flan set](https://www.etsy.com/listing/1595097143/1994s-pampered-chef-flan-pan-set-with)! But the first picture seriously looked like an ashtray to me at first glance lol"
            }
        ]
    },
    {
        "title": "Why do my cakes have angled sides?",
        "selftext": "My cakes always have angled sides, but the cake pans are straight edged... Any advice?",
        "num_comments": 99,
        "comments": [
            {
                "author": "None",
                "body": "[deleted]"
            }
        ]
    },
    {
        "title": "What are these tips used for?",
        "selftext": "My mom gave me allllll her cake decorating tips. It's a lot. She was big into cake decorating for a while. These did not come from her. They came in a cheap set I bought a while back. I have no clue what they're used for. Anyone know?",
        "num_comments": 80,
        "comments": [
            {
                "author": "milky_eyes",
                "body": "This was on amazon..\n\nSuuker 7 Pieces Pleated Skirt Piping Nozzles Set, Stainless Steel Russian Nozzles Tips Piping Set For Pastry Fondant,Cake Decorating Supplies Baking Set Tools https://a.co/d/dHWUUIf\n\nIt shows an example of how each one looks piped as well."
            }
        ]
    },
    {
        "title": "Help with my fruit tart",
        "selftext": "Im practicing making tarts and I need help. I can’t change the components of my tart so my goal is to get it the best version of it. The crust is made with pate sablee, a layer of raspberry jam, almond cream/frangipane, and lastly pastry cream. \n\nMy first question is: is the crust a good thickness? \nI tried making it 1/8 inch thick but I can’t tell if it’s too thick or too thin.\n\nSecond: How thin should the layer of raspberry jam be? I made it super thin since those were the instructions I was given the first time and made it a little thicker the next. The only issue was that it bubbled out of the frangipane layer which I’m unsure if that’s ideal or not.\n\nThird: is my crust baked enough?\nThe outer top edges are nice and brown but the sides are a little whiter and same with the bottom. The bottom isn’t crispy either, it’s soft but not soggy either. It holds its shape\n\nLast: any creative/cool ways to decorate the top of a 6” tart with fruit? All designs are usually for mini or large tarts \n\nI added some pictures so you can see my first and second versions ",
        "num_comments": 5,
        "comments": [
            {
                "author": "HundredWithTheForce",
                "body": "IMHO, Your crust is thick enough. The jam should be midway between the first and second attempts. I don't have an issue with the doneness of the crusts.  The bottom of the first attempt looks slightly darker in the center than the second attempt.  I'm not entirely sure what would cause that.  Perhaps the jam?  You also have a cleaner cut of the first attempt.  Both look quite tasty.  Good luck with perfecting the dish."
            }
        ]
    },
    {
        "title": "Photo - is this italian meringue done?",
        "selftext": "",
        "num_comments": 27,
        "comments": [
            {
                "author": "anonwashingtonian",
                "body": "Italian meringue is pretty sturdy once the sugar is added and you should keep whipping until it’s cool. However, I’m curious why you are storing it and not using right away? Uncooked meringue will change in texture and can start to weep as it sits (especially if stored in the fridge). \n\nIf you are making buttercream*, you should make the finished buttercream now and re-whip when you need to use it. \n\n*This post is tagged icing/fondant, so I’m assuming you are making a frosting.\n\n*Edit: typo*"
            }
        ]
    },
    {
        "title": "Made Sally's moist chocolate cupcakes and they sunk",
        "selftext": "Made the [super moist chocolate cupcakes](https://sallysbakingaddiction.com/super-moist-chocolate-cupcakes/). Thought I followed the instructions properly but they sunk. For what it's worth I think they taste quite nice but they're just not presentable. ;_; does anybody have tips? Ty in advance",
        "num_comments": 65,
        "comments": [
            {
                "author": "AutoModerator",
                "body": "Welcome to r/AskBaking! We are happy to have you. Please  remember to read the [rules] (https://www.reddit.com/r/AskBaking/about/rules/) and make sure your post meets all requirements. Posts that do not follow the rules will be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskBaking) if you have any questions or concerns.*"
            }
        ]
    },
    {
        "title": "What’s the secret to keeping melted chocolate, MELTED for a long period of time without it hardening? Every time I make I melt chocolate, it hardens quickly. 🥲",
        "selftext": "",
        "num_comments": 67,
        "comments": [
            {
                "author": "None",
                "body": "You have to add liquid to make a Ganache/chocolate sauce. Cream usually. Enough to keep it liquid at room temp. Regular chocolate will just harden up as soon as it cools to room temp, otherwise it would already be liquid in the packet"
            }
        ]
    },
    {
        "title": "Banana bread melted?!",
        "selftext": "I’ve made banana bread using this recipe many times and it always turned out good but today it turned into a black sticky abyss of doom and I don’t know what happened. \n\n[Banana bread recipe](https://measureofsuccess.wordpress.com/2012/07/29/easy-and-simple-banana-bread/amp/)\n\nHere’s the banana bread: [My banana bread](https://imgur.com/gallery/ZUknJdJ)\n\nUPDATE: Nevermind my sister put in powdered sugar instead of flour",
        "num_comments": 35,
        "comments": [
            {
                "author": "MadFlava76",
                "body": "Well, now we know what happens to a recipe when you substitute powered sugar for flour. Nothing good apparently. What did the dough look like? It must of had the consistency of icing."
            }
        ]
    },
    {
        "title": "How can I salvage this?",
        "selftext": "I was attempting to make a lambeth/vintage style cake and had wayyy too much faith in myself. \n\nI cut the V shape at too much of an angle so had to recut and then glue the sides as well the top for all 5 layers. \n\nThe inside is chocolate ganache and a strawberry compote which was still a little warm when I assembled.\n\nThe top has a dip on it, the sides pushed out a bit and are concave, the crumb coat went terribly wrong, and the only thing at this point keeping me from wanting to toss the whole thing is that I know it tastes good.\n\nI spent all day on this cake and entirely too much money and I’m ready to be done with it. I don’t think I have it in me to spend another day just on piping.\n\nWhat’s a quick way to fix this cake? \nAnd would it be too much chocolate to do a chocolate frosting? Should I do a strawberry jam frosting instead?",
        "num_comments": 87,
        "comments": [
            {
                "author": "AdventuresOfMe365",
                "body": "So I know it sounds insane but if you just use your mouth to eat it, all the crazy will stop."
            }
        ]
    },
    {
        "title": "Why do my pancakes have a bad aftertaste?",
        "selftext": "I got the recipe in the picture from the internet and the first time I made them they came out great. However, I have made them twice since and they have had a terrible aftertaste. Below are the differences between each cooking experience. Aside from those, all ingredients were from the exact same container as the first time. \n\n1st (good batch)\n- used buttermilk\n- cooked on Blackstone\n- had some issues with raw spots on the first couple because heat was too high\n\n2nd (bad batch)\n- used 2% milk\n- cooked on blackstone\n- cooked low and slow so no raw stops\n- my initial thought when the bad aftertaste showed up was that they had gotten in some bacon grease (cooked on other side of blackstone) which I know sometimes gives things a bad taste\n\n3rd (bad batch)\n- used 1/3 milk and 2/3 buttermilk (hindsight I should have used all buttermilk but I had a little bit of 2% that I wanted to use up)\n- cooked on non stick pan on stove\n- no raw spots\n\nOriginal poster of recipe used all 2% milk so I don’t think that’s an issue but 🤷‍♀️. Any help is greatly appreciated. ",
        "num_comments": 265,
        "comments": [
            {
                "author": "TheeMost313",
                "body": "That is far too much baking powder\n\nhttps://preview.redd.it/um1g8the8jkc1.jpeg?width=960&format=pjpg&auto=webp&s=f5deffcb044c393fa3fdd7839e4faef204ea2a50\n\nJust pulled up random recipe and it has less for a much larger recipe. I would scrap it and look for an old recipe. Like a great-grandma recipe."
            }
        ]
    },
    {
        "title": "why is my brownie not sweet :/",
        "selftext": "5 tbsp butter\n1 1/4 cups sugar\n2 eggs plus\n1 tsp vanilla\n1/3 cup vegetable oil\n3/4 cup cocoa powder\n1/2 cup flour\n1/8 tsp baking soda\n1 tbsp cornstarch\n1/4 tsp salt",
        "num_comments": 112,
        "comments": [
            {
                "author": "pandada_",
                "body": "How sweet do you typically eat? That’s a pretty normal sugar amount for brownies and I find it sweet enough. Are you using dark cocoa powder? That can make it taste more bitter as well"
            }
        ]
    },
    {
        "title": "What can I do with this chipped baking dish?",
        "selftext": "As the title says, this Emile Henry baking dish got chipped on the corner but I’m stuck on whether or not it’s still useable or what I can do with it now that it’s chipped! Any help or insight is appreciated!",
        "num_comments": 90,
        "comments": [
            {
                "author": "None",
                "body": "alright let me sum up the responses you'll get here:\n\n-It's totally fine and you should keep cooking with it.\n\n-You are already dead."
            }
        ]
    },
    {
        "title": "Our last two quiche bases have not gone to plan?",
        "selftext": "Hi \n\nMy wife and I are generally competent bakers, but are new to quiches.\n\nWe've been following a single recipe from a book with great success until the last two attempts.\n\nThe recipe involves a simple short crust pastry base, baked blind for twenty mins at 180°c before being cooled, filled and returned to the oven.\n\nThe last two bases appear to have risen up around the beads, despite no raising agent being used. The results also appear to have not cooked through entirely, there is a slight translucency to them rather than the opaque finish that we were expecting.\n\nOur latest attempt used a different tin, and a fresh packet of flour. Just to be safe.\n\nDoes anyone know what's going on?\n\nCheers,\n\n",
        "num_comments": 83,
        "comments": [
            {
                "author": "Skyehigh013",
                "body": "Did you put the pie weights directly on the crust while baking? I always thought you had to put down a layer of baking paper so the surface stays flat"
            }
        ]
    }
]