[
    {
        "title": "I have about a year+/- left. I made an offline browsable archive of my website which is a lifetime of my favorite recipes..",
        "selftext": "Unfortunately I have incurable brain cancer. I don't want sympathy or money or anything else, it would just be nice if my favorite recipes would last longer than I will. If any of the recipe collectors among you would like to download and or share the [offline browsable copy](https://www.bupkis.org/wp-content/uploads/bupkis.dotorg.zip), I'd appreciate it..  there's a link in the right sidebar. at  https://bupkis.org\n\nNo ads, no cookies no tracking, no nothing it's just my favorite recipe\n** edit: there are cookies st\n these are spectacular**https://www.bupkis.org/index.php/recipes-2/dessert/chocolate-chunk-cookies\nSorry to bother you all. It seems like everybody has years and years and years left, right up until they don't.\n\n**Edit**\n\nIt turns out that at the end of the road, the things that really mattered were good times with friends and family, And these were almost all in the kitchen. \n\nI've gotten to be relatively old, and finding out what I have certainly was not a happy thing, but given the number of my friends over the years that died with no notice from a heart attack or vehicle accident or whatever, this weirdly seems like a bit of a gift that I know what's coming and have *some* idea of a timeline. Although not a really good idea. \n\nGo home make yummy food and have your friends and family over. Actual happy memories are all that matters, money, power, status, everything else is mostly all nonsense.\n\n**Edit**\nThis outpouring support and sympathy is more than I could ever have imagined! Thank you all I really appreciate it; However in the [immortal words of Monty Python \"I'm not dead yet\"](https://www.youtube.com/watch?v=EfOW9QrLs0o) 8-)\n\nRight now I only have major annoyances but no show stoppers. \n\nI plan to continue enjoying family and friends and cooking as much as I can, it's just harder and slower now because the surgery kind of wrecked my left side. On the other hand[terrible pun intended] I'm right handed,  so I can still do a lot of stuff, it just takes longer. \n\n**PS if any of you are cooking for anybody that has cancer and has no appetite, I can tell you from first-hand experience that [the banana bread](https://www.bupkis.org/index.php/recipes-2/favorites/banana-bread) goes down really easily and sits really well.**\n\nThe weird part about all this was that I initially found it and made it for someone else who had cancer about 25 years ago, And now we make it for me.\n\nI also can't express enough gratitude that due to the efforts of friends I've never met all over the world the things that made me happy during my life will continue to make others happy for decades or maybe even hundreds of years in the future. The internet which is the very definition of \"not permanent stuff\" is now the eternal keeper of the things in life which mean the most to me which were food and friends and family.\n\nPlease note that I have read and appreciate each and every one of your replies. I have not answered them all because doing things online while missing large chunks of my brain is quite a bit more difficult than it used to be. But know that I read them all and you're all appreciated and I thank you all.\n\n**This is a [downloadable browsable offline copy  of the entire website](https://www.bupkis.org/wp-content/uploads/bupkis.dotorg.zip). It will last forever. Certainly longer than me or my web hosting company.**\n\nJust unzip somewhere including folders/directories, find \"index.html\" and double click it to browse offline\n\nTerry Carmen",
        "num_comments": 1996,
        "comments": [
            {
                "author": "Safe_Cash7091",
                "body": "OP, I would be honored to cook your recipes and will think of you when doing so. Thank you for sharing this with us."
            }
        ]
    },
    {
        "title": "Yesterday I found out that coriander is the same thing as cilantro. I'm so embarrassed, and my mind is blown.",
        "selftext": "I moved to the UK from the US a year and a half ago and was very sad about the fact that I could never find cilantro in supermarkets. Yesterday, I complained to a friend... and I learned. I'm still in shock over this revelation, and I'm ashamed that I never stopped to try this mysterious coriander herb I kept seeing.\n\nHelp me feel better - what other embarrassing food name mistakes/mix-ups have you made?\n\nEdit: I didn't expect this to get so much attention. Living in the US I didn't know that coriander as in seeds were even a thing, so just learned thanks to you guys too! Now... time for me to finally be able to make guac again!",
        "num_comments": 4044,
        "comments": [
            {
                "author": "wrightsound",
                "body": "When I started cooking and following recipes, a lot of recipes required scallions. I kept going to the store looking for scallions but they would never have it in stock. They only had green onions. I kept thinking “oh well, I guess I will just use green onions. And once they have scallions in stock, my dinner will be way better”"
            }
        ]
    },
    {
        "title": "What’s your stupidest cooking opinion so we can all fight about it?",
        "selftext": "",
        "num_comments": 10736,
        "comments": [
            {
                "author": "georgiesdaddy",
                "body": "Gold flakes on anything is fucking stupid"
            }
        ]
    },
    {
        "title": "My mother: \"I don't use salt in my cooking, I don't like how it tastes\" My mother when I cook: \"Wow OP! This tastes so good, what's your secret?\"",
        "selftext": "please end me",
        "num_comments": 1334,
        "comments": [
            {
                "author": "TheEpiquin",
                "body": "Mum: \"Help. My pumpkin soup is very bland and not at all how I envisioned it.\"\n\n\"Okay well what have you put in so far.\"\n\nMum: \"Diced pumpkin and water...\""
            }
        ]
    },
    {
        "title": "RIP Anthony Bourdain",
        "selftext": "https://www.cnn.com/2018/06/08/us/anthony-bourdain-obit/index.html\n\nA mix of a storyteller and a chef. His wit will be missed.",
        "num_comments": 981,
        "comments": [
            {
                "author": "judgedeath2",
                "body": "“It is indeed, marvelous. An irony-free zone, where everything is beautiful and nothing hurts. Where everybody, regardless of race, creed, color, or degree of inebriation is welcomed. Its warm, yellow glow a beacon of hope and salvation, inviting the hungry, the lost, the seriously hammered, to come inside. A place of safety, and nourishment. It never closes; it is always, always faithful — always there, for you.”\n\nRIP Tony, I hope you found your Waffle House.\n\n\n\n"
            }
        ]
    },
    {
        "title": "I’m cooking one meal from every state in the United States , what meal best represents your state?",
        "selftext": "Hi r/cooking! I recently completed a challenge where I cooked one meal from every sovereign nation, and now I’m onto the United States! I’ve started documenting my journey on Instagram but haven’t gotten a good response for recipe ideas. So reddit, what recipe best represents your state?\n\nIf anyone is interested in seeing the pictures and recipes you can follow me on my Instagram : emily_eats_thestates\n\nEDIT : I am completely overwhelmed and grateful with the amount of suggestions!!! This will be more than enough to get me through this challenge, thank you Reddit!!!\n\nEDIT : and a Gold?! Thank you kind stranger!!!",
        "num_comments": 24366,
        "comments": [
            {
                "author": "liontrap",
                "body": "Louisiana: Gumbo or Jambalaya"
            }
        ]
    },
    {
        "title": "Why are the \"chili never should have beans in it\" people so insufferable?",
        "selftext": "Look, I get it. You like chili without beans. That's cool, man. But when someone makes a post about chili and mentions beans, you don't have to come in and shit on it- every. Single. Time.\n\nYou do chili your way. Let the rest of us do it our way.",
        "num_comments": 4111,
        "comments": [
            {
                "author": "JustaRandomOldGuy",
                "body": "\"No rules. Don't be afraid to do whatever you want. Cooking doesn't have to have rules. I don't like it that way.\" - Masaharu Morimoto"
            }
        ]
    },
    {
        "title": "So, after I made a post on r/eatcheapandhealthy yesterday, I realised I'm not the only depressed person struggling to eat properly. So, I've started a blog of super cheap, healthy meals that require no cooking and only 2-5 minutes of prep time. It's called \"Fuck It, I'm Not Cooking\".",
        "selftext": "EDIT: [WE HAVE RECIPES.](https://missmedlandtaylor.com/)\n\n[Yesterday's post](https://www.reddit.com/r/EatCheapAndHealthy/comments/773zcl/i_just_got_out_of_hospital_for_depression_and_let/)\n\nOkay, so, I very quickly realised from comments and PMs that there are A LOT of people here on tight budgets who struggle to eat well due to depression. And a lot of self-help advice requires more energy and motivation than people with depression actually have.\n\nSo, I actually went and did it. I've made a blog dedicated to NOT cooking. It's called *\"Fuck It, I'm Not Cooking\"*.\n\nNothing I ever post will take more than five minutes to make, nor require any more preparation than chopping things and wrapping a tortilla. All of it's cheap and healthy, or healthy as long as you don't overdo the condiments. I've made a \"master shopping list\" so you only have to shop once a week, don't waste much food, and should be able to carry it all home if you don't have a car. Everything's inexpensive and easy to find in the supermarket. There'll be both sweet and savoury recipes, snacks, and healthy alternatives to cravings for crappy food. \n\nBasically, it's supposed to be as much/less effort than your usual depression eating, taste good, and be way better for you.\n\nI've spent all day setting it up, from tomorrow there will be recipes daily. So far, I've posted a few super basic recipes in with the Master Shopping List. \n\nHere's the main page: https://missmedlandtaylor.com/fuckcooking/\n\n[Here's some commentary on how and why I made it](https://missmedlandtaylor.com/2017/10/19/the-story-behind-fuck-it-im-bad-at-cooking/)\n\n[Here's the Master Shopping List, with bonus \"Master\" recipes](https://missmedlandtaylor.com/2017/10/19/the-master-shopping-list-with-some-basic-master-recipes/)\n\n\nIf you want to follow it via email, you can do it at the bottom of the webpage. It's super, super easy to do, and then it'll be sent to you and you won't have to actively keep up to date.\n\n(Cross-posted from r/eatcheapandhealthy)",
        "num_comments": 702,
        "comments": [
            {
                "author": "None",
                "body": "[deleted]"
            }
        ]
    },
    {
        "title": "A kind reminder: don’t shame people for not being able to get better ingredients",
        "selftext": "I’ve had this happen a couple times to me. I’m a student, so I don’t have the budget to go above and beyond what I already spend (eg. like on eggs bought direct from farmer because they’re over double the price of the ones I get now). \nIt’s sad that it’s a luxury to buy from the source, but please don’t push people to buy more expensive things when they say they dont have the budget, yes we know theyll taste better but that just makes it harder when we have to go back to the cheaper versions haha \n\nTL;DR not everyone has the ability to purchase the more expensive options for ingredients, don’t guilt them about it\n\nEdit: Y'all I posted this in the morning and went to class, I came back to a lots of super kind comments and a ton of awards. Just want to say thank you <3\n\nEdit: I've been trying to read every comment, I've never had a post get so big (and also I've never gotten gold before so huge thank you!!!). Hope y'all are getting creative with your meals today :)",
        "num_comments": 2099,
        "comments": [
            {
                "author": "TheLadyEve",
                "body": "Hey, so when this happens, please report the comments. If someone is shaming you for not being able to buy something, report it--we will take care of it. Please, everyone, remember **rule 5: Be kind and conduct productive discussion**. It's not as easy for us to remove these comments if we're not alerted to them (although we do still review threads, it's just that reporting makes it easier)."
            }
        ]
    },
    {
        "title": "Get your turkey out to thaw if it's 200lbs or more! This is your 200 lb warning!!!",
        "selftext": "",
        "num_comments": 725,
        "comments": [
            {
                "author": "T3hJ3hu",
                "body": "if google is telling me the truth, the largest turkey was 86 pounds, and thawing a turkey requires 24 hours per 4 pounds\n\nthat's 21.5 days of refrigerator thawing, which when added to this very moment happens to be november 23rd, thanksgiving day"
            }
        ]
    },
    {
        "title": "My mom just decided to turn up my sous vide chicken breast from 65C to 90C to \"speed up the proces\" and it's now has the consistency of leather. What food crimes have your family committed behind your back on your behalf?",
        "selftext": "Like the title says. I was going to make perfect tender and juicy chicken breast with a sous vide stick but my mom decided to overrule me behind my back by turning the temperature up from 65C to 90C \"just to be speed it up\" (even though they would have been ready right on time for dinner at 19:00 as planned... It now has the consistency of stringy leather and taste like it too.\n\nI was curious if your family (or friends) have ever decided to give you a \"helping\" hand behind your back?\n\nRecipe I was following: https://www.seriouseats.com/sous-vide-chicken-breast-recipe",
        "num_comments": 3921,
        "comments": [
            {
                "author": "NoelleRoyal",
                "body": "My mom intentionally blunts knives/ throws them away when they're sharp because she's worried about injuring herself on the sharpness of the knife"
            }
        ]
    },
    {
        "title": "For the love of god, please stop bashing American Chinese food as \"fake\" or \"inauthentic\" [Rant]",
        "selftext": "As a second gen Chinese American myself, I am really tired of people being a complete snob over authenticity to the point that they distort the history and culture behind Chinese cuisine.\n\nI've had enough of people trashing American Chinese food as \"not the real thing\" or even worse, \"Chinese food dumbed down for American people\" (like WTF?!)\n\nWhile I don't deny that Chinese food in America is different from Chinese food on the mainland, that  doesn't make it any less worthy. Sure, it has been changed to some extent to suit local palates, but that's pretty much the same thing with Chinese food in the diaspora in general. There is also Indonesian Chinese, Filipino Chinese, Singaporean Chinese, and even Peruvian Chinese  food-yet nobody calls these variants as \"fake\" or \"inauthentic\". \n\nMoreover, people had to make adaptations to the cuisine anyways in the new land due to the lack of available ingredients that they usually had back home.  No Chinese broccoli? Use western broccoli instead. \n\n One has to remember that Chinese cuisine is by no means a monolith- it's pretty diverse with a lot of regional variations-hence Beijing cuisine is different from Shanghai cuisine and Cantonese cuisine. A lot of early Chinese immigrants to the US were from the Guangdong province, hence American Chinese food is heavily based on the cuisine from that area (albeit still a limited representation).  This is the reason why later immigrants from other parts of China might find American Chinese cuisine to be strange and completely foreign. \n\nI always have to chuckle whenever someone tries hard to demonstrate what \"authentic\" and \"inauthentic\" Chinese food is by comparing a Chinese takeout dish with Cantonese origins (ie, chow mein or orange chicken) to a dish from another region in China, which is essentially comparing apples to oranges. A good example would be this [Buzzfeed video](https://youtu.be/8vMOESJwWsg) in which the host claims to try \"authentic\" sweet and sour pork for the first time, when in reality the version that she tried is no less \"authentic\" than the one she is used to. Only difference is that the so-called \"authentic\" version is another regional variation, just like the Cantonese-style sweet and sour pork many are familiar with. \n\nWhile I do appreciate people willing to take a deeper look into Chinese cuisine beyond the menu at the local takeout, there's no need to be an utter snob about it. Food is food, peeps. It's high time that we recognize American Chinese cuisine as something unique of its own.\n\nEDIT: Holy smokes this thread did blow up unexpectedly. I'm seeing a lot of amazing input from various perspectives. Here are a few additional things I want to add\n\n1) While I did mention American Chinese food in the post and title, I was also referring to Chinese food in the western diaspora in general (including Canadian Chinese food, British Chinese food, etc.) \n\n2) Regarding authenticity, yes it is something that does exist, though at the same time it is something that is very subjective. Given the insanely diverse array of Chinese cuisine, it would be disingenuous to pinpoint \"authenticity\" as solely one way of cooking. There's no such thing as \"this is the only way to do it right\". Take Kung Pao chicken for example. While the original version in Sichuan is hot and spicy, there are also other regional versions in China that are less spicy. \n\n3) Some of y'all also talked about how some people bash American/Western Chinese food out of an identity crisis- this especially rings true for a lot of second gen Chinese Americans grappling between two cultures. On one hand, American Chinese food has been looked down on for a very long time due to the perception that it is greasy, sketchy, unhealthy, etc. A lot of second gen Chinese Americans might feel ashamed to be associated with this kind of food, so they overcompensate by going on full board with the authenticity train- trying hard to prove that Chinese food is more than just the takeout menu. A much as I detest the culinary gatekeeping sentiment, I can definitely see where it's coming from. \n\n4) I also find it interesting how a lot of people think of American Chinese food as generally heavy on the grease, starch and sugar. While I do get it's kinda explainable given that general tso's chicken, sesame chicken, and orange chicken are some of the most popular American Chinese dishes, there's also way more to that as well. Heck, even American Chinese cuisine can be vast and diverse! Of course there's also a lot of less greasy, less sugary foods like moo goo gai pan and moo shoo pork. However in my state, Louisiana, there's also yakmein and crawfish fried rice. Let's bring on the goodness!",
        "num_comments": 1628,
        "comments": [
            {
                "author": "castillar",
                "body": "My wife is on a list for musicologists (related, trust me) who love to argue about whether music that incorporates non-native instruments is “authentic”. For example, is a recording of an Indian raga “inauthentic” because the musicians used a violin, which isn’t native to India.\n\nIn the midst of one of these debates, a prof posted this story. He’d served in Iran in the Peace Corps in the 1970s, and had the most amazing kebabs while he was there. He’d never been able to replicate them, though, even though he tried every Persian recipe he could find. So one time he’s at a street fair in LA and finds a Persian guy selling kebabs and it’s the same recipe! He badgers the guy to tell him the recipe, and the guy says, “Oh sure! Very traditional Persian recipe—handed down in my family for years. First, you’ll need some 7-Up for the marinade...”\n\nPeople love to get snobby over “authentic” and “traditional”. There’s probably something there about us Americans feeling unrooted, culturally, because our history doesn’t go back as far, maybe? The only time I think there’s value in the “traditional” argument is when people reduce a culture’s food to what they’ve been exposed to—like thinking Panda Express is all there is to Chinese cuisine and acting surprised when you go to Shanghai and don’t see stuff you recognize on the menu. And that’s more about recognizing the world is a bigger place than your backyard. :)\n\n**Edit:** Forgot I was on /r/cooking here, so of course people would want the recipe in question! This was 2003-2004, but I'm willing to bet the ethnomusicology list she was on has email archives, so I'm putting on my safari hat and delving into the search. I'll post back here if I find it!\n\n**Second Edit:** Well, rats. The list does have archives but is closed to musicologists only so they’re not searchable. I’ll keep looking, but I’m not optimistic."
            }
        ]
    },
    {
        "title": "I poisoned my wife and her family on New Years with fucking dried beans",
        "selftext": "The title says it all.   I made an Italian wedding soup.  Usually I sub in a can of Cannellini beans.  It’s quick, it’s simple, it’s tasty, the internet told me to.\n\nBut my wife bought special beans.  What makes these beans special?  Probably the fucking marketing, but they were on the shelf, dried, in a small plastic bag touting the wonderful properties of beans.  She bought them at a bean store in San Francisco.  Only in SF could there be a fucking bean store during a pandemic.  Great fanfare was made over this package of beans.\n\nWe soaked them for like an hour, tossed them in when we’d normally toss in the can of beans.  Cooked another 15 minutes, and served.  They were… crunchy, but the broth flavor was really good, so we figured “meh, eat this bowl, let it keep cooking.”  Kinda like slightly undercooked rice, you know?\n\nI did not know.\n\nMy wife’s sister went first.  There was unexplained running during a movie.\n\nMy wife went second.  Two down.\n\nI’m now sitting on the couch by myself with the pets listening to my brother in law make pterodactyl noises with distant cough/vomit sounds in the background from my wife and sister-in-law like a gross harmony.\n\nWe’re out of toilets to puke in.  I’m feeling about a 7/10.  I have yet to determine if time is a friend or an enemy for me tonight.\n\nTurns out, dried beans need to be soaked for 5 hours, then boiled, and always eaten very tender.\n\nThank you for this final lesson 2021.  “Purging the past” jokes are being received poorly by all those involved.\n\nAnyways, it’s 9:30 here.  Happy new year.  Here’s to fucking 2022.",
        "num_comments": 1287,
        "comments": [
            {
                "author": "protectedneck",
                "body": "To be 100% clear to anyone reading this: you HAVE to cook beans to completion. Crunchy beans aren't just unpleasant, they are harmful.\n\nThe cooking is the part that makes beans safe. As far as I understand it, the soaking is optional, however it is worth it because you save time on cooking. You can use whatever method you want.\n\nAlso, just in case you are ever finding yourself in a position where you have been cooking beans for hours and hours and hours and they're still hard: don't cook beans in acidic liquid. Even a can of crushed tomatoes in a soup can be too much. For some reason, beans don't soften and they don't fully cook when they are in liquid that is acidic."
            }
        ]
    },
    {
        "title": "/r/Cooking is joining the blackout on June 12-14th to protest Reddit's proposed API changes, which will end 3rd party apps",
        "selftext": "https://www.reddit.com/r/Save3rdPartyApps/comments/13yh0jf/dont_let_reddit_kill_3rd_party_apps\n\n#What's going on?\n\nA recent Reddit policy change threatens to kill many beloved third-party mobile apps, making a great many quality-of-life features not seen in the official mobile app **permanently inaccessible** to users.\n\nOn May 31, 2023, Reddit announced they were raising the price to make calls to their API from being free to a level that will kill every third party app on Reddit, from [Apollo](https://www.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/) to [Reddit is Fun](https://www.reddit.com/r/redditisfun/comments/13wxepd/rif_dev_here_reddits_api_changes_will_likely_kill/) to [Narwhal](https://www.reddit.com/r/getnarwhal/comments/13wv038/reddit_have_quoted_the_apollo_devs_a_ridiculous/jmdqtyt/) to [BaconReader](https://www.reddit.com/r/baconreader/comments/13wveb2/reddit_api_changes_and_baconreader/).\n\nEven if you're not a mobile user and don't use any of those apps, this is a step toward killing other ways of customizing Reddit, such as Reddit Enhancement Suite or the use of the old.reddit.com desktop interface [](/ajwtf \"and everything that goes with it!\").\n\nThis isn't only a problem on the user level: many subreddit moderators depend on tools only available outside the official app to keep their communities on-topic and spam-free.\n\n#What's the plan? \n\nOn June 12th, [many subreddits](https://old.reddit.com/r/ModCoord/comments/1401qw5/incomplete_and_growing_list_of_participating/) will be going dark to protest this policy. Some will return after 48 hours: others will go away *permanently* unless the issue is adequately addressed, since many moderators aren't able to put in the work they do with the poor tools available through the official app. This isn't something any of us do lightly: we do what we do because *we love Reddit*, and we truly believe this change will make it impossible to keep doing what we love.\n\nThe two-day blackout isn't the *goal*, and it isn't the end. Should things reach the 14th with no sign of Reddit choosing to fix what they've broken, we'll use the community and buzz we've built between then and now as a tool for further action.\n\nWhat can *you* do?\n\n1. **Complain.** Message the mods of /r/reddit.com, who are the admins of the site: message /u/reddit: submit a [support request](https://support.reddithelp.com/hc/en-us/requests/new): comment in relevant threads on /r/reddit, such as [this one](https://www.reddit.com/r/reddit/comments/12qwagm/an_update_regarding_reddits_api/.), leave a negative review on their official iOS or Android app- and sign your username in support to this post.\n\n2. **Spread the word.** Rabble-rouse on related subreddits. Meme it up, make it spicy. Bitch about it to your cat. Suggest anyone you know who moderates a subreddit join us at our sister sub at /r/ModCoord- but please don't pester mods you *don't* know by simply spamming their modmail.\n\n3. **Boycott *and* spread the word...to Reddit's competition!** Stay off Reddit entirely on June 12th through the 13th- instead, take to your favorite *non*-Reddit platform of choice and make some noise in support!\n\n4. **Don't be a jerk.** As upsetting this may be, threats, profanity and vandalism will be worse than useless in getting people on our side. Please make every effort to be as restrained, polite, reasonable and law-abiding as possible.",
        "num_comments": 0,
        "comments": []
    },
    {
        "title": "A moment of silence for the chicken stock I just poured down the drain whilst straining it.",
        "selftext": "Stupid brain.",
        "num_comments": 704,
        "comments": [
            {
                "author": "MsStormyTrump",
                "body": "It's looking at us from heaven together with my vodka sauce from last week."
            }
        ]
    },
    {
        "title": "Does anyone else who’s the primary cook in the house eat the ugly pieces at meals?",
        "selftext": "Usually I eat the ugly piece of fish or the veggies on the grill that got a little more char than you wanted. Am I alone in this?\n\nEdit: wow, thanks for all the replies, glad to see I'm not alone!",
        "num_comments": 1244,
        "comments": [
            {
                "author": "BeerInsurance",
                "body": "Yes, but I also get all the treats, like the short crispy parts of the bacon that fall off and mysteriously disappear before I can serve breakfast..."
            }
        ]
    },
    {
        "title": "Hard to swallow cooking facts.",
        "selftext": "I'll start, your grandma's \"traditional recipe passed down\" is most likely from a 70s magazine or the back of a crisco can and not originally from your familie's original country at all.",
        "num_comments": 3697,
        "comments": [
            {
                "author": "None",
                "body": "Just because it looks good on social media doesn't mean it tastes good."
            }
        ]
    },
    {
        "title": "I bought a quarter wheel (23 pounds) of parmeggiano reggiano for $11 because it was mis-labeled as .42 lbs. What should I make with it?",
        "selftext": "Went into a store and the cheese display had a quarter wheel of parm. The label on the quarter wheel was clearly incorrect, saying that it was .42 pounds, and so was only $10.92. When I went over to the register to see if they would let me actually purchase it, it rung up as it showed on the label, and the cashier let me buy it! When I got home, it weighed 23 pounds! At $25.99/pound, that's $600 of cheese for only $11! I'm planning on giving a lot of it away to friends and family. I've cut it into ~1 lb chunks, vacuum sealed them, and split them between the fridge and freezer. What recipes should I make with my haul???\n\nTLDR: Got an incredible deal on 23 lbs of parmesan cheese for only $11. What should I make?\n\nEdit: photos https://imgur.com/a/23-lb-cheese-AEZcewy\n\nEdit 2: To be clear, during the check out process the cashier was very aware that this was an absurd price for this large wheel of cheese, and had no qualms about ringing it up as it is. Also, if you look at the website for Murray's Cheese, you will notice that they are absolutely not a Mom & Pop shop, but have hundreds of locations across the USA.\n\nEdit 3: To add some context, I actually arrived at the register without the cheese, and when the cashier asked \"anything else?\" I made a joke about \"not unless you'll actually sell me that quarter wheel of cheese for $11!\" She said \"bring it over!\" so I did, and when it rang up as $11 dollars and I was in shock, she made multiple jokes about it being 11 million dollars. As multiple people have stated in the comments, NY has a law that requires stores to sell their merchandise at the labeled price.\n\nEdit 4: It is not an old banana, it is a plantain not yet ready for maduros",
        "num_comments": 1214,
        "comments": [
            {
                "author": "Homer_JG",
                "body": "You could reenact the climax of the movie Scarface but with grated parm"
            }
        ]
    },
    {
        "title": "Alton Brown announces the return of 'Good Eats' as 'Return of the Eats,' on Food Network and streaming in 2018",
        "selftext": "https://twitter.com/altonbrown/status/904449569127370753",
        "num_comments": 410,
        "comments": [
            {
                "author": "YourTokenGinger",
                "body": "I'm really excited because I love the show, but I'm a little sad it's under Food Network. It's great that he can use their resources, but I HATE how Food Network handles their content. Why do they compile collections, and keep shuffling them on and off of Netflix? And the dvds are ridiculously expensive. \nStill, I will watch, and I will love. "
            }
        ]
    },
    {
        "title": "What’s your “I’ll never tell” cooking secret?",
        "selftext": "My boyfriend is always amazed at how my scrambled eggs taste so good. He’s convinced I have magical scrambling powers because even when he tries to replicate, he can’t. I finally realized he doesn’t know I use butter, and I feel like I can’t reveal it now. I love being master egg scrambler. \n\nMy other one: through no fault of my own, everyone thinks I make great from scratch brownies. It’s just a mix. I’m in too deep. I can’t reveal it now.\n\nEDIT: I told my boyfriend about the butter. He jokingly screamed “HOW COULD YOU!?” And stormed into the other room. Then he came back and said, “yeah butter makes everything good so that makes sense.” No more secrets here!\n\nEDIT 2: I have read as many responses as I can and the consensus is:\n\n- MSG MSG MSG. MSG isn’t bad for you and makes food delish. \n\n- Butter. Put butter in everything. And if you’re baking? Brown your butter!!!!\n\n- Cinnamon: it’s not just for sweet recipes. \n\n- Lots of love for pickle juice. \n\n- A lot of y’all are taking the Semi Homemade with Sandra Lee approach and modifying mixes/pre-made stuff and I think that’s a great life hack in general. Way to be resourceful and use what you have access to to make things tasty and enjoyable for the people in your life! \n\n- Shocking number of people get praise for simply properly seasoning food. This shouldn’t be a secret. Use enough salt, guys. It’s not there to hide the flavor, it’s there to amplify it. \n\n\nI’ve saved quite a few comments with tips or recipes to try later on. Thanks for all the participation! It’s so cool to hear how so many people have “specialities” and it’s really not too hard to take something regular and make it your own with experimentation. Cooking is such a great way to bring comfort and happiness to others and I love that we’re sharing our tips and tricks so we can all live in  world with delicious food!",
        "num_comments": 4168,
        "comments": [
            {
                "author": "King_Fuckface",
                "body": "The first post I ever read on Reddit was from a woman with a bakery who was confessing she uses box mix cakes."
            }
        ]
    },
    {
        "title": "My husband and I are trying to \"cook around the world\" to expand our knowledge. Drop your favorite authentic dish from your nationality / ethnicity !",
        "selftext": "Hello culinary enthusiasts!\n\nWe are trying to globally expand our palette. We have recently started getting into South American and Latin American traditional dishes and have learned so much! We want to try different recipes that are authentic to different areas around the world. Share your favorite cultural dish and where its from! I can google the recipes later, just names is fine!",
        "num_comments": 4037,
        "comments": [
            {
                "author": "myotherbannisabenn",
                "body": "I saved [this post](https://www.reddit.com/r/Cooking/comments/gu6xfh/nearly_every_suggestion_i_got_for_my_every/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) because I thought it was cool. It has a document with a list of Reddit’s ideas about what constitutes the quintessential dish from each country. Might inspire some ideas, and it’s fun to look through."
            }
        ]
    },
    {
        "title": "I am in my 30’s and only now discovered the joy of roasting vegetables. I have been MISSING OUT.",
        "selftext": "I got a box from a meal kit delivery for the first time because I’m a terrible cook and need some serious help. One of the recipes gave a bunch of carrots which I usually don’t love, and the recipe said to peel, chop, and throw on some oil, salt and pepper and then pop into the oven. “blech” was running through my head the whole 5 seconds it took to put this together. \n\nBut! What came out was MAGICAL. Crispy, almost sweet in a way. I immediately wanted more, which is the first time in the history of my life where I was like “give me more vegetables”. \n\nThe epiphany is almost worth the ridiculous amount of money I spent on this box of food. \n\nNow I want to roast every vegetable I buy. Suggestions welcome :)\n\nEdit: I am so excited to see how passionate people are for roasted vegetables! I’ve been reading the comments all day and I can’t wait to try some of your suggestions :) \n\nAlso I removed the name of the meal kit delivery place because apparently people think I’m advertising and I’m definitely not. I just put that info there so you all know how I made this discovery! The rest of the meals I got were nothing to write home about lol.",
        "num_comments": 1630,
        "comments": [
            {
                "author": "None",
                "body": "Omg literally any veggie! Salt, pepper, and a little oil then pop them into the oven for a bit. Roasted carrots, asparagus, broccoli, sweet potatoes and green beans are probably my favs though!"
            }
        ]
    },
    {
        "title": "To the redditor who said to heat up flour tortillas, holy shit, thank you 👏",
        "selftext": "I've been cooking for lots of years but never once had thought to heat a flour tortilla up. I just used them right out of the package.\n\nWell about 3-4 weeks ago I read a post that lovingly reminded gringos like me to heat them on the stove before using ... And wow I have been missing out.\n\nNow my fiance can't get enough of anything using them.. from wraps and burritos to quesadillas and tortillas for hummus dipping.\n\nThanks you, I feel like a new man in the kitchen 😆\n\nEdit: I love the comment section, Reddit is undefeated haha. I am doing my penance to the tortilla gods for my past injustices",
        "num_comments": 1949,
        "comments": [
            {
                "author": "None",
                "body": "I can't believe you've never heated your tortillas"
            }
        ]
    },
    {
        "title": "Crazy idea: Every container of cooking oil should have it's smoke point on the label.",
        "selftext": "",
        "num_comments": 395,
        "comments": [
            {
                "author": "Earthicus",
                "body": "This is not a crazy idea at all!\n\nIt shouldn't be a law or anything, but a company that listed the smoke point of their oils would win my instant respect.\n\nYou should send this idea to the manufacturers.  It's certainly practical."
            }
        ]
    },
    {
        "title": "Never in my life have I ever added too much garlic to a (cooked) meal. Anyone else feel the same?",
        "selftext": "Raw garlic is an exception because it's very pungent and strong, but for stews or soups or pasta and stuff, I've never been like \"Damn, that's too much garlic.\" And I always see chefs going \"two or three cloves of garlic\" and I'll always do 2-3 times that much. \n\nIs it just me or is garlic the best aromatic, maybe even the best ingredient?",
        "num_comments": 1458,
        "comments": [
            {
                "author": "ILoveBentonsBacon",
                "body": "My wife crusted salmon in minced garlic one time when she was learning to cook. That was inedible."
            }
        ]
    },
    {
        "title": "If you have a non cooking SO, what is something you find very simple they found highly impressive?",
        "selftext": "My husband doesn't know ANYTHING about cooking. A couple weekends ago I asked him to help me whip some cream for a whipped cream frosting because I don't have the counter real estate for a stand mixer and my arms were dying. He was watching me finish the whip and the moment it formed he lost his shit. He thought it was the absolute coolest thing he'd ever seen. And I'm just like dude...it's just whipped cream... He proceeded to tell everyone at dinner how cool it was. I mean I felt proud he found it that cool but also found the whole situation really silly.\n\nEdit: Thanks every one for all the lovely replies! I really wanted to spark a wholesome conversation and this has definitely been super wholesome!\n\nEdit 2: thank you for the gold kind stranger! Never thought I'd have a post on popular! Especially one about food! I'm loving all the replies so much and I'm so happy my husband being silly and cute sparked so much wholesome conversation!!",
        "num_comments": 2706,
        "comments": [
            {
                "author": "Flight_Harbinger",
                "body": "I'm on the other end of this but my GF used to make biscuits and gravy for me in the morning after noticing that I'd order it at our favorite breakfast place a lot. They were amazing and I was too terrified to ruin the perfection to ever attempt. After she passed away, it took a long time but one morning I decided I just wanted some comfort food and tried my best. \n\nTurned out it's really easy and blew me away. Reminds me of her though."
            }
        ]
    },
    {
        "title": "What foods are you unashamed to NOT be snobby about?",
        "selftext": "**HOLY SHIT.** Didn't expect this to blow up this far.\n\nI usually try to respond to everybody when I start a thread, and at least upvote everybody who comments, but obviously that isn't possible in this thread.  Glad to see people enjoyed it.  To all those who gilded, thanks, and I know I missed a lot of you in the mountain of responses, so if I missed you: thanks.\n\n*****\n\n1. Ketchup.  One day I'll be bored enough to decide to try to make my own ketchup, but right now nothing equals Heinz.\n\n2. Garlic.  I don't use garlic powder, but I do buy the peeled stuff and refrigerate it.  Futzing around with whole heads of garlic and the papery skin is just a little annoying.\n\n3. McDonald's.  I don't eat fast food very often, but I do like a good quarter pounder with cheese now and then, supersize the Coke and fries and to hell with the pearl-clutchers.\n\n4. Breakfast cereal.  Sure, sometimes the hippy-dippy Seven Whole Grain Colon Blow Quinoa Explosion stuff is fine if you add some fruit, but I'm Generation X; gimme a couple bowls of Captain Crunch Oops All-Berries.\n\n5. Hot dogs. I don't make a steady diet of them, but gimme a simple hot dog in a bun with chili from a can, diced onions, and yellow mustard.  Awesome.  Gimme three, actually.\n\n6. Milk.  I have no curiosity about raw milk, I don't need your authentic, hand-strained, teat-to-table beef milk.  I just drink whole milk.  I never, however, drink skim milk.  Which is water, that's lying about being milk.\n\nEDIT: I’m asking what foods are you NOT snobby about.  What el cheapo, prepackaged, processed, ghetto, trailer park, not-highbrow foods do you cling to?",
        "num_comments": 6898,
        "comments": [
            {
                "author": "Zookeepered",
                "body": "Instant noodles. That Shin Ramyun spicy stuff is so good, I don't think there's anything else I crave as regularly as I do that. I try not to have it too often because it's a total sodium bomb but gosh do I miss it if I haven't had it in a month. People on this subreddit love to tell you that making \"real\" ramen at home isn't that hard! You just need about 8 hours of time and the foresight to have started 3 days ago! \n\nNah, give me that good ol' red package."
            }
        ]
    },
    {
        "title": "What food authenticity hill are you willing to die on?",
        "selftext": "Basically “Dish X is not Dish X unless it has ____”\n\nI’m normally not a stickler at all for authenticity and never get my feathers ruffled by substitutions or additions, and I hold loose definitions for most things. But one I can’t relinquish is that a burger refers to the ground meat patty, not the bun. A piece of fried chicken on a bun is a chicken sandwich, not a chicken burger.",
        "num_comments": 11600,
        "comments": [
            {
                "author": "Flare_hunter",
                "body": "What has been done to hummus by marketers."
            }
        ]
    },
    {
        "title": "What's that one food you just f-ing hate?",
        "selftext": "I fucking hate quinoa. I hate it so much. I used to be a picky eater when I was young, but now that I'm older I try and eat almost anything.\n\nBut fuck quinoa. It just flat out fucking sucks. It tastes like nothing and yeah it's pretty good for you but there's just as good for you food that tastes infinitely better.\n\nIf I had 3 genie wishes, I'd use one to erase quinoa from all of existence.",
        "num_comments": 12372,
        "comments": [
            {
                "author": "NordicUomo",
                "body": "Don’t know what the name even is, but my Italian family friends love this stuff I can only describe as “meat jello” and they had a chicken and tuna version that was sent straight from hell. The mom is an amazing chef so I’m sure it’s good food, but no meat should have that texture"
            }
        ]
    },
    {
        "title": "What’s your “weird but life-changing” cooking hack?",
        "selftext": "For me, I have two. \n\nThe first is using a chicken stock cube (Knorr if I’m feeling boujee, but usually those cheap 99p a box ones) in my pasta water whilst the pasta cooks. It has the double use of flavouring the pasta water, so if you’re using a splash for your sauce it’s got a more umami, meaty flavour, and it also doubles the tastiness of your pasta. Trust me.\n\nSecondly - using scissors to cut just about anything I can. It always seems to weird people out when I cut up chicken thighs in particular, but it’s so good for cutting out those fiddly veins. I could honestly never go back to cutting them up using a knife.",
        "num_comments": 3939,
        "comments": [
            {
                "author": "CorneliusJenkins",
                "body": "Cutting hot peppers and don't want an unfortunate accident in the bathroom (peeing, changing contacts, etc) later? When done, rub a little neutral oil (canola, vegetable) on your hands, then wash with a little dish soap. The capsaicin (spicy chemical in the peppers) essentially binds with the oil, then the dish soap takes care of the oil on your hands."
            }
        ]
    },
    {
        "title": "My Mother just threw a whole plain 1 lb. chunk of ground beef in the toaster oven. What crimes happen in your house?",
        "selftext": "",
        "num_comments": 3453,
        "comments": [
            {
                "author": "foxandsheep",
                "body": "My grandmother never learned to cook. One day she cooked chicken breast that had “marinated” in only distilled white vinegar. Absolutely inedible. Called my MIL begging for help. She recommended soy sauce. Apparently it hide many sins. It did not hide that particular sins however."
            }
        ]
    },
    {
        "title": "Please just buy the rice cooker",
        "selftext": "I can only really testify this for jasmine rice and basmati rice, but please, for the love of god, just buy the rice cooker. It’s 20$, (do not get an expensive one, it just needs one button) but I guarantee the increased amount of cheap rice you will make returns a positive ROI. It is remarkable how consistently the rice makes fluffy, Al dente grains. I’ve seen countless images of stovetop rice turning out mushy because messing up is so easy. Or maybe some stovetop users don’t know what rice should taste like. Also you don’t need butter, fat is just not necessary for rice and extra calories. Last thing is that it’s dishwasher safe and no risk of the rice sticking like it can with a regular pan. \n\nI’m gonna throw a rice cooker use recipe that you can make every weeknight: Thai curry. Just mix store bought curry paste with coconut milk, add any veggies and proteins, and serve over rice. Trust me, making rice from the rice cooker will also make it survive being drenched in hot sauces when some stovetop rices won’t. \n\nI really promise that putting 20 dollars aside for a rice cooker will be one the best culinary decisions of your life. So many healthy, easy, weeknight recipes can be made. So just please, make the investment. ",
        "num_comments": 2544,
        "comments": [
            {
                "author": "two55",
                "body": "I'm going to make a specific advocacy: you should browse Craigslist/fbm/ whatever it is in your area and buy someone's unappreciated rice cooker that got used twice. You will find a $300 zojirushi device that's more consistent than God and sings clair de lune for $20 from a college student or newlywed who \"doesn't get it\""
            }
        ]
    },
    {
        "title": "PSA-Do not try to hide an ingredient in your cooking from someone who asks you directly if your recipe includes blank",
        "selftext": "Since I’m seeing this in one of my favorite baking groups right now, this is my seasonal request for truth. If someone asks you does your item contain fill in the blank, answer truthfully. People with food allergies, alcohol concerns, religious restrictions  or straight out anaphylactic concerns, all have a really hard time during the season of homemade treats. Please don’t say no when your item contains alcohol nuts gluten etc. people ask for very specific reasons, and you do not want to be the person who sends them into the hospital or craving",
        "num_comments": 1592,
        "comments": [
            {
                "author": "None",
                "body": "[deleted]"
            }
        ]
    },
    {
        "title": "My hamburgers have become so gross, that my boys won't even eat them. Could use some suggestions.",
        "selftext": "SOS: My burgers have gone from family favorite to something no one wants.\n\nTwo boys, 13 and 25, used to devour my burgers like they hadn't seen a meal in ages. Now? They're leaving sad, barely-touched meat discs on their plates. My boys have opinions, and they're brutal: 'weird,' 'too dry,' 'too oily,' 'too greasy,' and the soul-crushing 'it doesn't have any taste.'\n\nTo me, they've always been rather plain, but that seemingly was never a problem before. Something has changed, though I'm not sure what.\n\nI'm using 80/20 ground beef, fresh as can be, from a decent grocery store in Massachusetts (Shaw's). My wife likes hers still mooing, but the boys want theirs perma-charred - no pink allowed.\n\nCurrent recipe (use at your own risk): 7 oz of beef, manhandled into submission, flattened, and sacrificed to a medium-high skillet for 4 minutes per side. Cheese gets a 60-second cameo at the end. Brioche buns because I really do try to make my fam happy.\n\nI've never had to season ground beef before, but maybe that's where I've gone wrong? Is there a secret burger society I'm not privy to? A bovine illuminati?\n\nI could use some help. How do YOU make your burgers taste like actual food and not sad cow discs?\n\n**EDIT: Wow, something like 80 comments in about 8 minutes. I'm doing it wrong. :)**  \n**90+ minutes in, and now 500+ comments, I certainly hit a nerve with tasteless burgers. I'm really sorry and I won't do it again. Promise! :(**\n\n**Smash Burger Success!**\nJust finished dinner. There’s grease everywhere, I’m still cleaning up, I didn’t expect that much grease to come out on my griddle, and all over the kitchen floor - I usually have a grease catcher over my frying pan.\n\nRegardless, everyone is happy! My wife gave it props too so all in all, excellent work everyone, you all made it happen! \n\n**TY Reddit!!**",
        "num_comments": 3490,
        "comments": [
            {
                "author": "None",
                "body": "Salt and pepper and stop “manhandling” it. You’re not making meatloaf. That just dries it out."
            }
        ]
    },
    {
        "title": "Are people still stupid enough to genuinely think that MSG is bad for you and that Chinese Restaurant Syndrome is really a thing?",
        "selftext": "\nEdit: This blew up much bigger than I thought it would. It was just a late night rant. After sleeping on it and rereading it this morning I do realise I could have possibly used a slightly better tone here. I stand by what I said 100% but I could have possibly done it without insulting people. Apologies if I have upset anyone. \n\n**I'm going to point out at the start here that I think and hope that I am not talking to the majority of the members of this sub if you do nothing else just read the links provided, you don't have to read my rant**\n\nI posted an off the cuff comment in here recently replying to someone in the UK who was asking what they should buy at a Chinese supermarket. I said MSG crystals because they genuinely are essential in Chinese cooking. I got downvoted for it which doesn't bother me apart from the fact that this is a cooking sub and debunked racist conspiracy theories shouldn't really have a place here.\n\nIt genuinely did start with a hoax, it s complete bullshit. I am going to hope (probably in vain) that the idiots will read the links as I'm not going to do their homework for them but I know they won't.\n\nI'm writing this for the idiots, so I'm discounting the fact that most of you vaguely intelligent people realise that glutamates are naturally present in a hell of a lot of food (apologies again for the rant), let's just imagine for a minute that tomatoes, cheese, mushrooms and meat don't contain glutamates. I mean they do and all you sufferers eat this stuff all the time but the minute it's a little Chinese tasting you have a reaction.\n\nIt's a genuinely ingrained racist reaction and you should as members of cooking sub that celebrates cuisine from all over the world be disgusted with yourselves (talking to the idiots again).\n\nMSG is a fantastic additive that everybody should have in their kitchen, it is no different from adding a pinch of salt to your cooking, not just Chinese food, it adds a depth to tomato sauces, cheese sauces, fried chicken. It truly is fantastic stuff.\n\nAnyway, as I said, apologies for the rant, I'm sure most of you understand the benefits of it, this is just for the small coterie of idiots that still cling to this ridiculous theory. \n\nhttps://www.newscientist.com/article/mg14119082-400-science-why-msg-myth-is-a-load-of-chop-suey/#:~:text=Chinese%20restaurant%20syndrome%20was%20born%20in%20April%201968,experienced%20whenever%20he%20ate%20at%20a%20Chinese%20restaurant.\n\nhttps://news.colgate.edu/magazine/2019/02/06/the-strange-case-of-dr-ho-man-kwok/",
        "num_comments": 1142,
        "comments": [
            {
                "author": "bug-hunter",
                "body": "Chinese food makes my wife sick, and she was sure it was MSG.\n\nTurns out she’s allergic to soy."
            }
        ]
    },
    {
        "title": "This is your 476 pound turkey thaw reminder!",
        "selftext": "One day per 4 pounds is the general thaw time for a frozen turkey to thaw in the fridge. Get to thawing those extra large birds!",
        "num_comments": 336,
        "comments": [
            {
                "author": "anothertimelord",
                "body": "Damn, I forgot to put my 490 pound turkey in the fridge last week! Do you think it will be fine???"
            }
        ]
    },
    {
        "title": "What bad cooking habits get on your nerves? For me it’s when people use the highest flame setting to cook EVERYTHING. It is wasteful, overcooks food, overboils everything and it really does ruin pans.",
        "selftext": "",
        "num_comments": 3830,
        "comments": [
            {
                "author": "Alaylaria",
                "body": "When people fuck with the timer/burner when I’m cooking. I had some tomato sauce going at a nice even simmer, but apparently someone else in my household thought it should be boiling like pasta water, so they jacked up the temp to high and added more time to the timer..."
            }
        ]
    },
    {
        "title": "I'm going to cook one recipe from every country and document it. If people could tell me what they think is their countries best dish I'd be eternally grateful!",
        "selftext": "",
        "num_comments": 6208,
        "comments": [
            {
                "author": "tr0gdar",
                "body": "Botswana: seswaa and pap. Pounded beef and maize meal."
            }
        ]
    },
    {
        "title": "You can just use the whole tiny can of tomato paste. It's fine.",
        "selftext": "I see people on here frustrated all the time about what to do with extra tomato paste... recipes rarely call for it, but when they do it's usually like half of that tiny can and then you have a weird amount left over. I struggled with this for years. Sure you can buy the squeezy tubes instead, they're great, but sometimes the can is what you have. \n\nJust use the whole can! It's really not adding that much to whatever you're probably making with it anyway, and if anything it'll probably be more delicious. \"Oh no! My chili is packed with too much savory tomato goodness!\" You will never hear people say this. It is a nonsense phrase. I've started doing it every single time and I haven't had a problem yet. They have been lying to us. Join me in casting off our shackles. \n\nEDIT: I am getting a bunch of comments berating me personally from people who say this is horrible advice because they do not like tomatoes. If you do not like tomatoes, I would encourage you to do some self-reflection on whether you are the target audience of this advice before commenting.",
        "num_comments": 1099,
        "comments": [
            {
                "author": "I_Must_Be_Going",
                "body": "Tubes are a lot more expensive than cans\n\nI freeze unused tomato paste by the tablespoon (dump tablespoons of tomato paste on a plate covered with plastic film, keep in the freezer for a few hours until they become rock hard, store in a ziploc bag for future use)"
            }
        ]
    },
    {
        "title": "I believe most of American Vegetarian foods are awful because they are trying to substitute for meat.",
        "selftext": "Perhaps I should post in Vegetarianism but I want to discuss the idea.\n\nMy wife's friend came to stay the weekend and being as she's vegan she cooked for us. The food was really good.\n\nI wanted to learn more and bought some Beyond Meat patties they were surprisingly similar to texture to a well done burger. I tried Beyond Meat at a fast food place and it tasted like an overseasoned paste that left regret on my tongue for the rest of the day. \n\nVegetarian foods in America try to replace meat. MorningStar is never going to replace a prime rib with black beans. But it won't stop them from trying.\nThis is in direct contrast with asian foods (the other half of my heritage). Where vegetable dishes seem integrated into cultural norms. Hinduism and Indian food for instance. Or Thai foods, Chinese foods have vegetables take up the entire dish. These foods also are heavily influenced by auxiliary tastes. Instead of the beef talking, its aromatic spices and insanely hot peppers.\n\nI'm making sweeping generalizations. But I wonder if it's possible to create foods that are not simply lesser imitations of what you really want (fake chicken nuggies) but a mainstay dish. And if it is possible to make it simple enough for an American pallette and accessible to cooks who don't have much time. Maybe there are and I don't know about them.\n\nTL;DR Is it possible to create true vegetable focused dishes in the USA that arent trying to replace meat as the star of any given meal.\n\nEdit: Thank you for your thoughtful replies and rewards. I'll try to get to your comments!\n\nEdit 2: I want to say I do not think that vegetarians are trying to substitute meat for everything. My vegan guest certainly didn't do that and didn't throw tofu in everything to attempt to cover for meat. u/Whoisdecoy shared this in the comments and I think this guy does a much better job explaining: https://www.youtube.com/watch?v=2mYcsM05lDk&feature=youtu.be&t=279",
        "num_comments": 1079,
        "comments": [
            {
                "author": "rabbithasacat",
                "body": "> Is it possible to create true vegetable focused dishes in the USA that arent trying to replace meat as the star of any given meal. \n\nOf course it is. \n\nMy grandparents in the rural deep South raised all their own food, both plant and animal. They had meat, but not every day; most meals were a plate full of 5 or 6 hearty vegetables, augmented by cornbread, biscuits or hush puppies, and often a fruit-based dessert like apple turnovers or pumpkin pie. And each of those vegetables was a delicious dish - fried green tomatoes (it's a beloved real dish, not just a movie), stewed green beans & eggplant, corn pudding, whatever came out of the garden that day. This was simple farm food, and a way of life throughout their community. There are hundreds of such dishes, based on real whole food, throughout the U.S. and the whole world, not just Asia.\n\nWhat is stuck in American cuisine is the British template for \"meat and two veg\" - the idea that there is one big entree of something, and a couple of sides. That's still seen as a norm and as long as that is so, companies will attempt to replicate it, but without the meat. But it's not necessary, as your friend demonstrated."
            }
        ]
    },
    {
        "title": "When you read a recipe and think \"That's not going to work\" but it's written by a professional, so you follow it exactly..... and it doesn't work.",
        "selftext": "That's right Mary Berry, I'm looking at you. \n\nThat rich, moist chocolate cake you promised ended up dryer than a hot day in the Sahara and packed full of weird, gritty bits of cocoa. \n\nAll in one method my arse.",
        "num_comments": 1352,
        "comments": [
            {
                "author": "perumbula",
                "body": "Martha Stewart's recipes can be like this.  One will be the best version you've ever made of the thing.  The next recipe will be worse than the one you found on pintrest with three exclamation points in the name."
            }
        ]
    },
    {
        "title": "How do you make someone understand MSG is not A Bad Thing™️?",
        "selftext": "I have a container of MSG in my kitchen - I love the stuff, it’s amazing. \n\nI’m also aware it’s in pretty much EVERYTHING already. \n\nI had brought a dish to a potluck and received glowing reviews - everyone loved it. One person asked what I’d put in it, and as soon as I said MSG, she and her boyfriend immediately “had a headache” from it. I told them they’re full of crap, because they’d eaten it and been fine until I said anything about it, and even listed a number of products that include it, but nothing could sway them. From there, they told a number of other people about it, and I caught a lot of flack. \n\nIs there any way to convince people this bullcrap is in their head and stems from a pretty racist article that was written (and even retracted by the author) back in the 80s or 90s?",
        "num_comments": 2125,
        "comments": [
            {
                "author": "Kayakorama",
                "body": "I thought I had a MSG problem.\n\nTurned out I have a slight soy issue and regular soy sauce gives me a headache. I use coconut amino now....and msg.\n\nEdit add: Chinese food is one of the few times I had soy"
            }
        ]
    },
    {
        "title": "Be honest, are you one of those cooks who, when a recipe calls for a clove of garlic, you say, ahh, to heck with that, i'm adding 5 or 6 or more?",
        "selftext": "",
        "num_comments": 1201,
        "comments": [
            {
                "author": "pksullivan",
                "body": "In many recipes, yes. If the garlic isn’t being cooked (such as in cold sesame noodles or tzatziki) then I am much more likely to follow the recipe’s low ball suggestion."
            }
        ]
    },
    {
        "title": "Unpopular opinion: Jamie Oliver is misunderstood",
        "selftext": "It’s become very popular to bash Jamie Oliver these days, with the fried rice incidents of his. People are (rightfully) pointing out how that his food is not authentic this or authentic that. And the outrage seems to be exacerbated by the UK’s long and horrible history of colonialism. Like, «you stole our spices and now you butcher our food». But I think people are judging him on the wrong premise. I don’t think making authentic dishes has ever been his point. Most people in the UK are very normal working class people with poor diets. Whose worlds are their local communities, and they do what they can to get by. And these normal, busy people are Oliver’s target group. He’s a champion when it comes to public health, and his goal is to get the public to make their own food and eat healthier. For them, chilli jam and soy sauce is probably exotic enough. So adding soy sauce to a dish makes it «Asian». Because that’s how it is to the people he’s speaking to. Had he gone full authentic, it wouldn’t have served the purpose at all, as nobody would have bothered. His shows aren’t meant for British Asians with a strong knowledge of the cuisine of their country of origin. And I don’t see how that’s offensive or wrong.\n\nI’m a massive foodie, and I would never go to Jamie if I wanted to learn how to make for example pad thai. Cause his recipes aren’t meant for that, they’re not meant for foodies who want to spend an entire Saturday making the perfect dandan noodles *just* as the locals do it.\n\nI just came across an episode of Gogglebox where a Jamie Oliver show was on, and I think the gogglers’ reactions speak for themselves. He manages to get them excited and curious about the food he’s making, and that’s a win in my book.",
        "num_comments": 1311,
        "comments": [
            {
                "author": "DreddPirateBob4Ever",
                "body": "A lot of my mates bitch about him but I was there when he taught them to cook and before they labelled themselves foodies and act like they're world travelled chefs. They just don't like being reminded they were clueless. He taught a generation of stoners and clubbers how to cook something beyond the 2 meals their mum taught them and the one they read in the Guardian. I was one of those stoners and I owe Jamie a hell of a lot. He taught me more than just to cook; he taught to know ingredients, to look beyond recipes and train my instincts, to know what to swap in when I was out of something. He taught me to love cooking. He gave me the enthusiasm to learn, and that's priceless and what all the greats do: they enthuse you to learn the art of something. \n\nI hope he reads all these. He gets too much stick from people who have forgotten how much he changed a generation of mouthy youths who now cook damn well, healthily and cheaply for their friends, partners and families. And they pass on that enthusiasm too."
            }
        ]
    },
    {
        "title": "What are you stress eating on election night?",
        "selftext": "I think I'm going to make a giant pan of double-marshmallow rice krispie treats then drizzle them with dulce de leche and sprinkle with kosher salt.",
        "num_comments": 3227,
        "comments": [
            {
                "author": "orwhatevernshit",
                "body": "Smashed red grapes from Spain. A whole bottle of ‘em."
            }
        ]
    },
    {
        "title": "\"Thaw overnight in the fridge\" has to be one of the biggest lies of all time.",
        "selftext": "I don't know what temperature people who say this are keeping their refrigerator at, but if it's warm enough that your meat thaws from frozen solid in it overnight, there's no way it's any safer than leaving it on the counter. Just put two chicken breasts in the fridge overnight to thaw aka doing nothing for no benefit because, 12 hours later, they're still frozen as solid as when they went in. \n\n\nSo is everyone lying? Is everyone thawing 2 chicken breasts as long as a turkey in the fridge? Not a chance anyone is thawing anything in a fridge in one night. ",
        "num_comments": 1279,
        "comments": [
            {
                "author": "SprinklesOriginal150",
                "body": "The only thing I can thaw in the refrigerator that quickly is fish."
            }
        ]
    },
    {
        "title": "Why the FUCK is every recipe site an ad ridden, slow moving goddamn cancerous excuse for a website?",
        "selftext": "Does anyone have a reliable recipe/tips for pan seared filets? I’m cooking steaks on a cast iron for my mom for the first time and I’m sick of these terrible websites. ",
        "num_comments": 714,
        "comments": [
            {
                "author": "TheFiZi",
                "body": "Might be what your looking for:\n\nhttps://www.seriouseats.com/recipes/2012/12/butter-basted-pan-seared-steaks-recipe.html\n\nTo help you with websites in general install uBlock Origin (by Raymond Hill/Gorhill)"
            }
        ]
    },
    {
        "title": "What’s your culinary hot take?",
        "selftext": "Here’s mine:\n\nWhen properly seasoned and cooked down, store-bought, canned, crushed tomatoes are totally adequate to make a very good tomato sauce. It is not worth the effort to peel fresh tomatoes, and good fresh tomatoes are better off not being cooked anyway.\n\nI will die on this hill.",
        "num_comments": 5148,
        "comments": [
            {
                "author": "None",
                "body": "you don't make tomato sauce because your tomatoes are so much better, you make tomato sauce because there's too goddamn many of them, you hate your neighbors, and wasting food is a sin"
            }
        ]
    },
    {
        "title": "I blow dry my chicken before roasting and my desserts contain soy sauce, culinary confessions that actually work",
        "selftext": "I've got three that completely changed my kitchen game.\n\nFirst,, freezing fresh ginger and grating it frozen. I used to avoid recipes with ginger because peeling and mincing that stringy mess was such a pain, and it always went moldy before I could use a whole piece. Now I just keep a knob in the freezer and use a microplane to grate it straight from frozen, no peeling needed, no strings, no waste, and it actually grates BETTER frozen than fresh. Game-changer.\n\nSecond, adding a splash of soy sauce to chocolate desserts. I know it sounds absolutely insane, but a teaspoon in brownies or chocolate cake batter doesn't make them taste Asian at all, it just makes the chocolate flavor deeper and more complex. Something about the umami. My friends have been trying to figure out my \"secret ingredient\" for years.\n\nLastly, using a hair dryer on chicken skin before roasting. Sounds ridiculous but it completely dries the skin so it gets shatteringly crisp in the oven. I have a cheap one I keep just for cooking. My grandmother walked in on me blow drying a chicken once and nearly called for a wellness check, but now she does it too.\n\nWhat weird cooking tricks have you stumbled upon that actually work?",
        "num_comments": 1198,
        "comments": [
            {
                "author": "GingerIsTheBestSpice",
                "body": "Keep your saran wrap/ plastic wrap in the fridge. It won't stock to itself,  ever,  while you're cutting it. But it warms up immediately & sticks to your bowl you're covering. Yes, even the cheap kind will work better."
            }
        ]
    },
    {
        "title": "Let's play a game. List a food/ingredient that you absolutely hate, and someone else replies with a recipe that might change your perspective on that food/ingredient.",
        "selftext": "For example, I hate liver. To me, it has a nasty bloody, mineral-y flavor and the texture is akin to an eraser. Surely there's some dish out there that might make me like it?\n\nAlso, if you can't eat a certain food due to allergic or religious reasons, don't list it. Making shrimp 50 different ways will still kill you. But it will be delicious no doubt.\n\nedit: If you have the cilantro soap gene then there’s nothing we can do for you. Sucks to suck I guess. Use parsley if you still want the greens without that offensive cilantro taste.",
        "num_comments": 7179,
        "comments": [
            {
                "author": "melonbb_",
                "body": "For OP, try liver in Vietnamese food like bun bo hue.\n\nEdit: I’m just going off of what my mom makes"
            }
        ]
    },
    {
        "title": "Asking my fellow Americans to get on board with the metric system, at least where baking is concerned.",
        "selftext": "For real!  Weight measurements (grams) are superior to volumetric (cups, tablespoons)  in every way.\n\nCase in point:  I just put together a pizza dough that called for weight measurements ([this one by Basics with Babish)](https://basicswithbabish.co/basicsepisodes/2017/10/23/sauces-9w5tm-2njph-5ahwj-hsl7s-fh6cr-dfapr).  Got out my digital scale, put on my mixing bowl, tared (zeroed) off the weight.  Added flour, tared, added salt, tared, added yeast, tared, added water.  Mixed everything by hand.  Ended up with NO EXTRA dirty dishes!  No cups, no teaspoons.  Nothing.\n\nHonestly, the rest of the world knows already this. I have a medical degree, so metric is second nature (it's what the scientific world already uses).  Just hoping that the bakers of America can get on board and maybe help change for the better.\n\nEdit:  Thank you, kind person, for my first ever award!",
        "num_comments": 1316,
        "comments": [
            {
                "author": "jammasterdoom",
                "body": "Because the world is a terrible place, cups and tablespoons also vary wildly in volume between the US, UK and NZ/Aus."
            }
        ]
    },
    {
        "title": "I didn’t realize until I was older that “love” is a very real ingredient in food. No one makes sandwiches quite like my mother does. Even with the same bread, meat and cheese.",
        "selftext": "",
        "num_comments": 450,
        "comments": [
            {
                "author": "None",
                "body": "'Love' is the meticulous attention to tiny details that add up to a higher grade of sandwich; spreading the butter right to the edges, folding the meat for more surface area rather than putting it on flat, picking that healthy looking lettuce leaf, making sure there's consistent seasoning across every bite...brb I need to make a sandwich."
            }
        ]
    },
    {
        "title": "I caramelized 25 pounds of onions yesterday. Everything smelled like onions overnight even with all the doors and windows open. Today is day 2 of onions. How do I prevent everything in my house from smelling like onions until next year?",
        "selftext": "Final update for the true onions: All the cooking is done. I have another wonderful pot of caramelized onions. The smell really wasn't too bad once the cooking finished. Since we've got a huge orange tree and Costco sized vanilla extract, I put a big handful of orange peels, a couple generous swishes of vanilla extract, and some water in a pot and let it simmer. The house smells great. I will never forget you onions out there. \n\nUpdate 2: After doing a majority of the cooking in the instant pot outside, the onions are now on my stove. Luckily I just got a new range hood less than a week ago so that's on full blast. Guess what we've decided to include in dinner tonight? Hint: it's onion rings.\n\nUpdate: Day 2 is upon us. I just finished cutting up about 8 quarts of onions. I have an instant pot coming up to pressure on my porch as we speak. A fan is blowing in the direction of my cutting station to the window. I immediately washed all my cutting equipment  and wiped the counters with a mix of dish soap, water, and lemon essential oil. I promise I’m not a crazy essential oil lady, I just like the smell and it makes a good cheap all-purpose cleaner. See you all in about 2 onions for another update?\n\nEdit: Thanks to everyone for their suggestions. I have decided to postpone the onion marathon until tomorrow due to me being drugged up on Benadryl and not wanting to enter an onion-induced coma. Tomorrow is a new onion. Wish me onion. Onion.",
        "num_comments": 1074,
        "comments": [
            {
                "author": "baaltic",
                "body": "Caramelize 50 pounds of garlic now"
            }
        ]
    },
    {
        "title": "My mom cried after I cooked my grandma’s old stew recipe",
        "selftext": "Hello this is my first post and I wanted to share something special for me, I found my grandmother’s old recipe book tucked away in a box. On the very first page was a chicken stew recipe I’d heard my mom talk about many times. She always said how much she loved it growing up, and how my grandma used to make it all the time. So I thought, what better way to surprise her?\n\nThe recipe called for a lot of garlic way more than I was used to and at first I wasn’t sure if it was a mistake. But I didn’t want to change anything. I followed it exactly, down to the instruction that said not to add salt until the chicken fat began to rise and impurities could be skimmed off. It felt like I was learning more than just a recipe and more like how my grandma used to cook.\n\nWhen I served it, my mom didn’t know I had followed that specific recipe. But as soon as she smelled it, she froze. She looked at me, confused, then smiled softly. I watched as her eyes welled up with tears. She didn’t even need to say anything, I knew that smell had brought her back.\n\nI broke down too, not gonna lie. It was one of those rare moments where food becomes something so much more than food.❤️\n\nAnyway, I just wanted to share this moment with you all. It reminded me why I love cooking, and how powerful a recipe can be. Can’t wait to hear your experiences 🫶",
        "num_comments": 453,
        "comments": [
            {
                "author": "BeautifulPainz",
                "body": "My mother invited me for lunch about 9 months after my dad had died. I sit down and she hands me a steaming bowl of beans “these are last of your fathers from the freezer”\n\nI cried so hard. \n\nDad always made huge pots of beans and would freeze the leftovers."
            }
        ]
    },
    {
        "title": "What is a food you hated until you ate it properly prepared?",
        "selftext": "For me it was salad. As a kid, all the salads I was exposed to were iceberg lettuce with a wheel of watery cucumber, and a mealy wedge of tomato. The dressings were either industrially made or non-emulsified vinaigrettes that tasted like straight oil. It was a revelation the first time I had a quality salad! Now they’re almost all I eat. Eating brussels sprouts roasted was a similar experience. You?",
        "num_comments": 3434,
        "comments": [
            {
                "author": "redchindi",
                "body": "Zucchini. My mother (who was a splendid cook in almost every other way) always cooked them to death and into an indistinguishable mash. \n\nZucchini fried in some oil for a short time are so tasty."
            }
        ]
    },
    {
        "title": "Joshua Weismann’s content has really taken a nose dive in quality",
        "selftext": "I’ve been watching him for a couple years now and I haven’t really thought about how much his content has changed over time.\n\nRecently I watched his bagle video from 3+ years ago and it was fantastic. It was relaxed, informative and easy to follow. Now everything has just turned into fast paced, quick cut, stress inducing meh… If he isn’t making cringy jokes, he’s speaking in an annoying as hell high pitched voice.\n\nHe’s really gone from a channel of amazing quality with really well edited and relaxing content to the stereotypical Youtuber with the same stupid facial expression on his thumbnails and lackluster humour.",
        "num_comments": 1852,
        "comments": [
            {
                "author": "WaldoJeffers65",
                "body": "I still use his bagel recipe whenever I want to make them, but I've completely stopped watching him otherwise."
            }
        ]
    },
    {
        "title": "Respect to the YouTube Chefs who didn't sell out",
        "selftext": "Not that my opinion matters, but I just appreciate that Chef John, Ethan Chlebowski, and Alex the French Cooking Guy never deviated from the objective of their work, which is to bring awesome ideas and recipes for normal folks to cook.\n\nSome of my all-time favorite YouTube chefs have completely sold out and now rank the best sandwiches in the US, show 100 ways to cook a steak, and so on. I respect the aforementioned YouTubers staying the course and just sharing with us what they find cool and interesting.\n\nThat's all!",
        "num_comments": 2103,
        "comments": [
            {
                "author": "None",
                "body": "Chef John is the coolest mother fucker of all time. I've been learning from him for like 20 years or more."
            }
        ]
    },
    {
        "title": "My apology to lemon juice",
        "selftext": "I used to not understand why acidity (through adding lemon juice) was so important in certain dishes.\n\nEvery time I watched a cooking video where the cook added lemon juice to a hearty soup or a pasta sauce, I cringed. “That can’t be good…” I thought.\n\nI was a fool.\n\nToday, I was making a Turkish-inspired lentil soup, one of my favourites. Well, I accidentally burned the onions and garlic. Only slightly — not too much — but definitely just enough to be noticeable.\n\nThe cheapskate that I am, instead of tossing it and starting over as I should have, I rolled with it... which turned out to be a big mistake. The bitterness was definitely there.\n\nPanicked, I looked online, and learned that apparently, lemon juice *can* offset some of such bitterness. Desperate, I added just about a tablespoon of freshly squeezed lemon juice, and simmered it on low for a bit longer than I usually would.\n\n*It worked.*\n\nWhen I tasted it once it was finished, I couldn’t believe it. The bitterness was gone. My husband, unaware of the situation, happily ate it without noticing anything unusual. I even asked afterwards, and he insisted it tasted just as it usually does.\n\nSo, lemon juice… I’m sorry. I now respect you in hearty recipes, not just in fresh ones or in tea. I will definitely never doubt your addition again.",
        "num_comments": 417,
        "comments": [
            {
                "author": "saintinthecity",
                "body": "Lemon juice forgives you. It's nice like that"
            }
        ]
    },
    {
        "title": "What is the most horrifying thing your parents did to food?",
        "selftext": "Every time my dad grills hamburgers, he doesn’t season the patties at all, squeezes all the juice out of them, and then wayyyyyy overcooks them. The end result is a weird, dry, falling apart, dark gray hockey puck. I love him but his burgers are something else!\n\nEdit: I’m glad our taste buds could die together here",
        "num_comments": 5146,
        "comments": [
            {
                "author": "edwardcantordean",
                "body": "My mom cooked everything to DEATH.  I was accused of being the pickiest eater in the world until I grew up and ate properly cooked food. \n\nShe only ever steamed vegetables (for much too long),  except carrots,  which she roasted until they somehow both shriveled and slimy. \n\nPork chops, chicken, \"steak\", burgers, all cooked exactly the same: baked at 350 for 30-45 minutes. \n\nI thought I hated SO MANY THINGS! But no,  my mom just didn't know what she was doing. \n\nWhich is weird, because my grandmother was a cook in a very high end restaurant. 🤔"
            }
        ]
    },
    {
        "title": "Diseased Chicken for Dinner? The USDA Is Considering It. A proposed new rule would allow poultry plants to process diseased chickens. That’s the last thing Americans need.",
        "selftext": ">Consider the decision last month by the agriculture department’s Food Safety and Inspection Service to allow poultry plants to process diseased chickens for human consumption.\n\n>In July the FSIS approved a petition from the National Chicken Council requesting that slaughterhouses be allowed to process broilers infected with Avian Leukosis — a virus that causes chickens to develop cancerous lesions and tumors. Inspectors would no longer be required to examine the first 300 birds of each flock for signs of the disease, and processors would be able to cut off tumors and lesions and then process the rest of the bird. The approval has led to a proposed rule change that is now before the food safety administrator Paul Kiecker.\n\n>Here’s what we know about Avian Leukosis: A small percentage of birds (less than 1%) are diagnosed with the virus each year, but it spreads quickly through flocks and tens of thousands of chickens are condemned annually due to exposure. While it’s unlikely that the virus could transfer from chickens to humans, it’s not impossible. There is some evidence that workers exposed to birds infected with the disease in the U.K. have developed antibodies, indicating a transfer of the virus from animal to human.\n\nhttps://www.bloomberg.com/opinion/articles/2020-08-11/diseased-chicken-for-dinner-the-usda-is-considering-it?fbclid=IwAR2iBPSwV1UtufkTK1s-XoXoZmZBd4xHccTpodLXqWC_dOaVY0_1-46ACEQ",
        "num_comments": 912,
        "comments": [
            {
                "author": "todaystartsnow",
                "body": "i swear all the recent headlines read like a preamble to the freaking hunger games."
            }
        ]
    },
    {
        "title": "I had Hidden Valley Ranch made out of a packet instead of a bottle for the first time, and I get it now",
        "selftext": "I've only ever had the premixed bottled/packaged junk and never understood this American obsession with Ranch. *Really? This is the salad dressing hill you wanna die on?*\n\nBut no. Buttermilk, mayonnaise and sour cream mixed with what I can only assume is dill and garlic-infused powdered crack cocaine make an entirely different beast.\n\n&#x200B;\n\nI'm in danger, aren't I?\n\nWhat other Ranch secrets have I not discovered? What else can I do with these little paper packets of culinary narcotics?\n\nEdit: Y'all are some proper ranch heads. I love it. I'm gonna compile all the suggestions here in a later edit (AKA when I have time tomorrow). So far I'm already bursting with food-crack inspiration.\n\nEdit 2: Time to try and compile this wellspring of ranch-infused crack cocaine information into some comprehensive list, for the betterment of humanity of course (but not their waistlines).\n\n# <<These aren't all full recipes>>\n\n# Dips:\n\n***Low Cal***\n\n* [Low-cal, cottage cheese/cashew dip](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj0gw4?utm_source=share&utm_medium=web2x&context=3) (([Option 2, no cashews](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqiy1uz?utm_source=share&utm_medium=web2x&context=3)))\n* [Ranch Cucumber Salsa](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj9ggb?utm_source=share&utm_medium=web2x&context=3)\n\n***ALL THE CALS***\n\n* [\"Crack Sauce\"](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj2ply?utm_source=share&utm_medium=web2x&context=3)\n* [Sour cream and Frito scoops for when you've lost control of your life.](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqiv19k?utm_source=share&utm_medium=web2x&context=3)\n* [Doctor your spicy ranch with adobo sauce, garlic, and more MSG](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj243x?utm_source=share&utm_medium=web2x&context=3)\n* [Beer Cheese Dip](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj4i8v?utm_source=share&utm_medium=web2x&context=3)\n* [Chuy's Jalapeño Cilantro Dip](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj2y2b?utm_source=share&utm_medium=web2x&context=3)\n* [Corn Dip](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj5f6b?utm_source=share&utm_medium=web2x&context=3) (Which is apparently life altering)\n* [Cheese, Cheese and Onion Dip/Spread](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqiyzk6?utm_source=share&utm_medium=web2x&context=3)\n* [Easy-peasy spinach dip](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqivru9?utm_source=share&utm_medium=web2x&context=3) ([Spinach Dip 2: Ranch Boogaloo](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqm6yrv?utm_source=share&utm_medium=web2x&context=3))\n* [Cheesy Bacon Ranch Dip](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjadn9?utm_source=share&utm_medium=web2x&context=3)\n* [Ranch Aioli](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqkak4d?utm_source=share&utm_medium=web2x&context=3)\n* [Ranch Taco Dip](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqliyy4?utm_source=share&utm_medium=web2x&context=3)\n\n***Basic Ranch Add-ins***\n\n* Cilantro (if ye not be cursed by your genes)\n* Jalapeños\n* Salsa\n* Pickle juice\n* Pickled jalapeño juice/brine\n* Vinegar\n* Worcestershire Sauce (MORE MSG?!)\n* Chives\n* Garlic Powder\n* Pepper\n* Taco seasoning\n* Mashed avocados\n* Chipotle peppers in adobo\n* Hot sauce\n* Bleu cheese\n* Bacon\n* Japanese 7 spice + Sugar\n\n# Meals and sides:\n\n* [Mississippi Pot Roast](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj1ew9?utm_source=share&utm_medium=web2x&context=3) (I spelled Mississippi in my first try. Wowwee)\n* [\"The Monday\"](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqlpb3g/?context=3) AKA Mississippi Pot Roast but with Tomatoes\n* [Add it to eggs!](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqivrcx?utm_source=share&utm_medium=web2x&context=3)\n* [Add it to mashed potatoes.](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqioq9j?utm_source=share&utm_medium=web2x&context=3) That's it, that's the side.\n* [Roasted Ranch Cauliflower](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjh65e?utm_source=share&utm_medium=web2x&context=3)\n* [Oven-roasted, butter-ranch potatoes](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqiwi2c?utm_source=share&utm_medium=web2x&context=3)\n* [Cheesy Chicken Ranch Mac](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqiwli5?utm_source=share&utm_medium=web2x&context=3) (honourable mention [Cranberry Crack Kraut Meatballs](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqixsvj?utm_source=share&utm_medium=web2x&context=3))\n* [Add it to dredge for Fried Pickles](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqizk2e?utm_source=share&utm_medium=web2x&context=3)\n* [Chicken Bacon Ranch Fried Chicken](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj13uw?utm_source=share&utm_medium=web2x&context=3). Man's hubris knows no bounds.\n* [Butter, Wine and Ranch sauce](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjah1g?utm_source=share&utm_medium=web2x&context=3). This person just drinks it. ^(Are you ok?)\n* [Ranch Pasta Salad](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqiztrw?utm_source=share&utm_medium=web2x&context=3)\n* [Ranch Pinwheels](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj2gvx?utm_source=share&utm_medium=web2x&context=3)\n* [\"Greasy Chicken\"](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj36w7?utm_source=share&utm_medium=web2x&context=3) aka Ranchtacular Chicken Wings\n* [\"Crack Chicken\"](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj6d3f?utm_source=share&utm_medium=web2x&context=3)\n* [Ranch Garlic Bread](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqio6de?utm_source=share&utm_medium=web2x&context=3)\n* [Add it to breadcrumb toppings, tuna casserole, and mac'n'cheese](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqixzd8?utm_source=share&utm_medium=web2x&context=3)\n* [Ranch Green Beans](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqizv92?utm_source=share&utm_medium=web2x&context=3)\n* [Cheesy, Creamy Ranch Potatoes](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqizzuh?utm_source=share&utm_medium=web2x&context=3)\n* [Parmesan Ranch Roasted Potatoes](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqle06n?utm_source=share&utm_medium=web2x&context=3)\n* [Ranch Jalapeno Poppers](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj7ru0?utm_source=share&utm_medium=web2x&context=3) ^(This person also does it with habaneros.... I'm worried)\n* [Taco-Ranch Chicken Soup with Beans](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjqqxo?utm_source=share&utm_medium=web2x&context=3)\n* [Chicken Bacon Ranch Quesadillas](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj17jm?utm_source=share&utm_medium=web2x&context=3) ([Option 2 w/ Recipe](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqlexka?utm_source=share&utm_medium=web2x&context=3))\n* [Parmesan Ranch Chicken](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj4tgf?utm_source=share&utm_medium=web2x&context=3)\n* [Creamy Bacon Chicken Pasta](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj8pbe?utm_source=share&utm_medium=web2x&context=3)\n* [Broiled Ranch Chicken](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjkeic?utm_source=share&utm_medium=web2x&context=3)\n* [Cheesey Ranch Chicken Tender Sandwiches](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjllqy?utm_source=share&utm_medium=web2x&context=3)\n* [Mix it with cream cheese, toss it on bread and cover it in more cheese (and bacon)](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjtvaq?utm_source=share&utm_medium=web2x&context=3)\n* [Chicken... Ranch... Tacos...](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj3iix?utm_source=share&utm_medium=web2x&context=3) ^(Mic drop optional)\n* [Grilled Chicken Teriyaki with Miso Ranch](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj3owg?utm_source=share&utm_medium=web2x&context=3) \\>> ([Link to video](https://www.youtube.com/watch?v=8eg3OECZD3A))\n* [Air-fried Ranch Chicken Thighs](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjaqct?utm_source=share&utm_medium=web2x&context=3)\n* [Ranchy, Cheesy Tostadas](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqkkzq4?utm_source=share&utm_medium=web2x&context=3)\n* [Ranch Roasted Wings AND Parmesan Garlic Ranch Wings](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjebtm?utm_source=share&utm_medium=web2x&context=3)\n* [More Ranch Fried Chicken](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjfq3r?utm_source=share&utm_medium=web2x&context=3)\n* [Slow Cooker Buffalo Chicken Sandwiches](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqlddhs?utm_source=share&utm_medium=web2x&context=3)\n* [Even MORE Ranch Fried Chicken](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqk8wsm?utm_source=share&utm_medium=web2x&context=3)\n* [Ranch Crack \"Cubed\" Marinade](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjia3a?utm_source=share&utm_medium=web2x&context=3)\n* [Cold Veggie Pizza](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjzw93?utm_source=share&utm_medium=web2x&context=3)\n* [Mix it in your burger meat](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj5zom?utm_source=share&utm_medium=web2x&context=3) ^(()**^(Disclaimer:)** ^(once you add anything to the ground meat it's more of a meatloaf or meatball sandwich, but still delicious))\n* [Cheesy Slow Cooked Ranch Chicken Sandwiches](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gql7epc?utm_source=share&utm_medium=web2x&context=3)\n* [Spicy Slow Cooker Shredded Ranch Chicken](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gql9iex?utm_source=share&utm_medium=web2x&context=3)\n* ~~\"Chicken Crack\"~~\n\n# Snacks:\n\n***Simply toss it on***\n\n* Popcorn\n* Breakfast potatoes (hashbrowns or home fries I suppose?)\n\n***Mix it up***\n\n* [Mix some saltines with oil, pepper flakes, and ranch](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqiv1ev?utm_source=share&utm_medium=web2x&context=3). Easy!\n* [Mix the powder into pizza dough](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj6osb?utm_source=share&utm_medium=web2x&context=3) ^(which just sounds all kinds of wrong, but who am I to judge art)\n* [Ranch Baked Pretzels](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj0fpa?utm_source=share&utm_medium=web2x&context=3), ([Option 2](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gql9ru5?utm_source=share&utm_medium=web2x&context=3))\n* [Add it to potato soup](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjm9q5?utm_source=share&utm_medium=web2x&context=3)\n* [Add it to Frank's Red Hot](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj78kl?utm_source=share&utm_medium=web2x&context=3)\n* [Toss it in your chili or taco soup](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj7r9w?utm_source=share&utm_medium=web2x&context=3)\n* [Mix it with cajun spice and toss it on fries](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj8ga2?utm_source=share&utm_medium=web2x&context=3)\n* [Mix it with chicken bouillon to make MAXIMUM OVERDRIVE food crack](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj9t6c?utm_source=share&utm_medium=web2x&context=3)\n* [Toss it all over oyster crackers](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqk9619?utm_source=share&utm_medium=web2x&context=3)\n* [Toss it on already sauce-tossed wings](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqizoev?utm_source=share&utm_medium=web2x&context=3)\n* [Toss it with french fries](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj12ue?utm_source=share&utm_medium=web2x&context=3)\n* [Mix it in with your deviled eggs](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjh2aw?utm_source=share&utm_medium=web2x&context=3)\n* [Add it to your white chicken chili](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjl5ps?utm_source=share&utm_medium=web2x&context=3)\n* [Add it to scalloped potatoes](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjllhz?utm_source=share&utm_medium=web2x&context=3)\n* [Add it to Pizza Rolls with **MORE** cheese.](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjqez2?utm_source=share&utm_medium=web2x&context=3)\n* [Toss it on cucumber with EXTRA salt to ruin the health benefits of eating cucumber as a snack](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqks91u?utm_source=share&utm_medium=web2x&context=3)\n* [Roast chickpeas with it](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqku7ia?utm_source=share&utm_medium=web2x&context=3)\n* [Mix it with BBQ sauce](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gql1680?utm_source=share&utm_medium=web2x&context=3)\n* [Make pepitas](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqlhlxa?utm_source=share&utm_medium=web2x&context=3)\n* [Put it in your Chex Mix](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqltmqr?utm_source=share&utm_medium=web2x&context=3)\n* [Mix it with leftover spaghetti.](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqlpm1r?utm_source=share&utm_medium=web2x&context=3) ^(This is either pure heresy or this person has reached a higher plane of enlightenment)\n\n# Tips and Tricks:\n\n* Biggest tip is apparently to buy big ol' jars of the stuff. I will work on finding a source in the frigid North...\n\n**UPDATE for Canadians: Bulk Barn has a** [Ranch Dip Mix seasoning](https://www.bulkbarn.ca/en/products/all/ranch-dip-mix-2866)**. It is 80% as good and like 10% the cost.** Pray for me.\n\n* Milk is for the **weak** and buttermilk is for **winners**\n* The real MSG-infused edible crack is the friends we made along the way\n* Make your own buttermilk if you don't have any by mixing 1 Tbsp Lemon Juice into 1 Cup milk.\n* [This person claims it can be mixed with water to make.... plasma?](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjhesp?utm_source=share&utm_medium=web2x&context=3)\n* [Freeze it and melt it like some mad scientist](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj9a2k?utm_source=share&utm_medium=web2x&context=3)\n* Use cottage cheese or Greek (or Balkan?) yogurt in lieu of mayonnaise for a healthier ranch\n* [Use the powder like fun dip on carrots.](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjybkp?utm_source=share&utm_medium=web2x&context=3) Pure insanity\n* Don't even use ranch and instead use [Instant Noodle packets...?](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjhe6h?utm_source=share&utm_medium=web2x&context=3)\n* [.... Put butter on a Poptart...?](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqkdw9c?utm_source=share&utm_medium=web2x&context=3) But not Ranch.\n\n***Dip the following items in Ranch:***\n\n* Carrots\n* Celery\n* Pizza\n* Fries\n* Chicken tendies\n* Buffalo wings! ^((Bleu Cheese purists need not apply))\n* Fried cheese curds\n* Tater tots\n* Onion Rings\n\n# Make the seasoning yourself, ya goof :\n\n^(Even though I probably won't)\n\n* [The \"We don't use MSG but it still has MSG\" option](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqj0ho9?utm_source=share&utm_medium=web2x&context=3)\n* [The \"We **actually** don't use MSG\" option](https://www.epicurious.com/recipes/food/views/ranch-dressing-51182850) ([Option 2](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqiyigs?utm_source=share&utm_medium=web2x&context=3))\n* [The \"Chili's Copycat Ranch Dressing\" Option](https://www.reddit.com/r/Cooking/comments/m2e254/i_had_hidden_valley_ranch_made_out_of_a_packet/gqjoo7t?utm_source=share&utm_medium=web2x&context=3). ^(There's no joke. That's it. It has pickle juice in it.)\n\n&#x200B;\n\n&#x200B;\n\nEdit 3: For everyone suggesting dipping pizza in Ranch, it is now on my to-do list. In Eastern Canada we have a different dip for pizza and garlic cheese fingers; I submit to you [Donair Sauce](https://forgetfulmomma.com/2020/07/20/sweet-donair-sauce-recipe/). It's a perversion against god and man but boy is it good on a shitty slice of pizza.\n\n&#x200B;\n\nEdit 4: No, I do not work for Hidden Valley Ranch and this is not an astroturfing campaign. I suspect Hidden Valley would take umbrage with the fact I use the words 'crack cocaine', and the fact that I am willing to swear ^((fuck, shit, balls)).  I'm just some turd from Eastern Canada who got bored yesterday while studying and remembered the packet of ranch sitting in the cupboard. ^(And then in lieu of studying spent an unhealthy amount of time editing this post. Whoops.)",
        "num_comments": 1223,
        "comments": [
            {
                "author": "phoenixwaller",
                "body": "You can use the powder as seasoning on various things. It's been a while since I kept it around though, cause yeah, it's easy to go ranch crazy. (hint, you can also get it, NOT in the packets. Like in a jar, a big jar... I think I got mine from Sam's club back in the early 00's)"
            }
        ]
    },
    {
        "title": "It is wrong to put beans in chili? An exhaustively researched and written argument",
        "selftext": "No.",
        "num_comments": 1611,
        "comments": [
            {
                "author": "gruntothesmitey",
                "body": "If you like beans, add them. If you don't, don't.\n\nChili is meant to be poor person's food. Working man's food. Beans are just a way to stretch the meat when you don't have much of it."
            }
        ]
    },
    {
        "title": "I just tried kimchi for the first time. Is it acceptable to just stand here eating it out of the jar like a savage or am I supposed to cook with it or something?",
        "selftext": "Edit: Sooooo, the amount of responses has been overwhelming.  Today I tried a kimchi grilled cheese.  It was good but didn't change my life.  I also put it on a cracker with some peanut butter.  It wasn't gross but it was alright.\n\nHowever, just eating it from the jar has changed my life. It was a revelation.  I want to have some kimchi fried rice but my jar is pretty much gone. I see that I've opened a whole new world.  I just stood in the asian grocery store and I saw what brand an asian person chose and I just chose that one. No regrets.\n\nThis was the brand:\nhttps://www.seriouseats.com/images/20110304-kimchi-taste-test-bing-gre.jpg",
        "num_comments": 1023,
        "comments": [
            {
                "author": "Martissimus",
                "body": "Kimchi is great as a side dish on its own, but kimchi eggs, kimchi fried rice, kimchi grilled cheese are fantastic too, try them at least at some point."
            }
        ]
    },
    {
        "title": "My best friend just told me that whenever she's sad and wants comfort food, she doesn't crave her mother's cooking, she craves mine. Best compliment I've ever gotten, and I will never forget. Whats the best compliment you've received?",
        "selftext": "I'm over the moon right now, thank you to Kenji for teaching me things.",
        "num_comments": 687,
        "comments": [
            {
                "author": "MarshallApplewhiteDo",
                "body": "My Bolognese recipe convinced a girl to go on a third date with me when her roommate ate the leftovers and she realized she desperately craved it again.\n\nOur third anniversary is next month."
            }
        ]
    },
    {
        "title": "I detest kitchen gadgets that only serve a single purpose. What are some exceptions to this?",
        "selftext": "",
        "num_comments": 4875,
        "comments": [
            {
                "author": "Pinky_theLegend",
                "body": "If you're into canning, a jar lifter. Just started canning, and I had a couple colossal fuck ups because I hadn't gotten my jar lifter from amazon yet. My rubberized tongs didn't get good enough grip to grab my processed pickles, slipped, lost a quart jar of painstakingly made kosher dill. I also didn't heat my metal tongs long enough when I went to grab my jars out of the pre-boil, and the cold metal won against hot glass. \n\nTl;DR- just get a fucking jar lifter if you're canning"
            }
        ]
    },
    {
        "title": "Can we normalize Not grinding whole spices for everything?",
        "selftext": "Like yes, I know that it will be better/fresher/stronger/make you see god, but, I'm a professional chef and I very rarely grind my own spices.  I'm tired of seeing recipes call for freshly ground stuff. It's not always efficient, or accessible to grind your own. Opt instead for buying quality ground spices. And even then, if all you can afford are dollar store spices, that's ok, it still works, and really, it doesn't make thaaaat much of a difference. Add some acid and salt and you're good to go.\n\nEdit: the snobbery of saying only food using fresh ground spices is good is what I'm taking issue with. Not everyone can afford a blender or coffee grinder, or even have the space for it.  Cooking should be accessible to Every One. And they shouldn't be shamed for not being able to.\n\nEdit2: God damn I didn't think this would blow up so much.  My point is, no one should gatekeep anything related to cooking. Everyone's skills and level of dedication are different. It has always been my goal to make cooking fun and accessible to Everyone.  You shouldn't look down on anyone because they cant/don't use the bestest most expensive rare ingredients and tools. And honestly, 95% of people don't know shit when it comes to food. \nIf your barometer of a good recipe is whether they use fresh ground spices or not, then you should have enough skill to figure out how to make the switch.\nAlso, not everyone on reddit has a penis.\n\nEdit3: thank you for the awards, I find it silly. Spend that money on some quality pre ground spices!",
        "num_comments": 1299,
        "comments": [
            {
                "author": "None",
                "body": "[deleted]"
            }
        ]
    },
    {
        "title": "Confession time: what cooking sin do you commit?",
        "selftext": "I don't use a pepper grinder...",
        "num_comments": 5006,
        "comments": [
            {
                "author": "Marta_Meow",
                "body": "Did commit: While in college, I was responsible for cooking the turkey one Thanksgiving while my mom was working and other family were hunting. My mom left very clear instructions, number one being “wash the bird.” I did, with soap. More specifically, with  Lysol because, as I head learned in a food science class, turkeys were germy. Fifteen years later I am still not allowed to participate in prepping the turkey. \n\nThank you for the silver! "
            }
        ]
    },
    {
        "title": "Friendly reminder: even if you cook “unhealthy” it’s still most likely healthier then the takeout or fast food you’d get instead",
        "selftext": "You wouldn’t believe how much fat, salt, and sugar is even “healthy” takeout options, and how calorie dense it is. They also sometimes will use processed foods.\n\n\nIf you cook a home cooked meal, even if it’s “unhealthy” it’s most likely more healthy then the takeout you’d get",
        "num_comments": 742,
        "comments": [
            {
                "author": "GeneralSalty1",
                "body": "A fun quote I hear a lot is: \"The reason restaurant food tastes so much better is because the cooks don't give a shit about your health\""
            }
        ]
    },
    {
        "title": "What misinformation about cooking, that a lot of people seem to believe, bothers you the most?",
        "selftext": "For me, it's when people say that you shouldn't wash a cast iron pan with soap. You absolutely should do that, as dish soap doesn't contain lye anymore.\n\nAlso, when people say that you shouldn't wash mushrooms in water because that makes them lose flavour. If that were true, the flavour would go away in the rain.",
        "num_comments": 4940,
        "comments": [
            {
                "author": "sephora__addict",
                "body": "The prep time in any recipe is generally severely understated"
            }
        ]
    },
    {
        "title": "Can we make a push for every recipe to include weights for all ingredients?",
        "selftext": "Ok, so I know this may not matter a ton in some cases but I 100% hate volumetric and 'generic' measurements.\n\nWhat is a \"1 medium onion\" (my grocery store literally only carries 'jumbo' yellow onions unless I buy a 5 lb bag)?\n\nWhen a recipe calls for \"1/2 cup fresh sage leaves, finely chopped\" does it want packed leaves or lose leaves? In general, due to the order I assume this means \"Get 1/2 cup fresh sage leaves then chop them\" but there is a big difference between \"1/2 packed cups\" and \"1/2 loose cups\".\n\nI know not everyone has a scale (especially a sensitive scale) but why can't we just say \"1 medium onion (about 1 cup or 100 grams)\"( no idea if that is a good conversion or not just using a example).\n\nFor the most part, it probably doesn't matter but sometimes I really would like to have a weight so I can just tare the scale and start adding the next thing.\n\nEdit: I feel the need to clarify 2 points:\n\n1. I'm mostly talking about in \"professional\" recipes (i.e. ones that people are paid to write). If you post something on reddit/your blog I don't really mind (and I don't mind overall to be honest it's mostly an annoyance).\n2. I'm not advocating dropping volumes. I'm just advocating adding weights as well. MANY recipes already do this in reverse (i.e. 4 ounces parmesan, grated (About 2 cups)) so if something is not well suited for volume it would be nice to have weight as well.",
        "num_comments": 1069,
        "comments": [
            {
                "author": "clearmoon247",
                "body": "While not specifically what you are asking,  here are the conversion notes we've put together over the years to properly do volumetric recipes by weight:\n\n* Powdered Sugar - 1 cup - 140g\r\n* Granulated Sugar - 1 cup - 230g\r\n* Light Brown Sugar - 1 cup - 240g\r\n* Sucralose - 1 cup - 30g\r\n* Corn Syrup - 1 Cup - 340g\r\n* Butter-Flavored Shortening - 1 Tbsp - 11g\r\n* Butter-Flavored Shortening - 1 Stick - 88g\r\n* Butter-Flavored Shortening - 1 Cup - 176g\r\n* Lard - 1 Cup - 200g\r\n* All-purpose Flour - 1 cup - 160g\r\n* Yellow corn meal - 1 cup - 160g\r\n* Bread Flour - 1 cup - 135g\r\n* DIY Bread Flour - 1 cup - 125g AP Flour + 5g Vital Wheat Gluten\r\n* Grated Coconut - 1 Cup - 88g\r\n* Graham Cracker - 1 Cup - 116g\r\n* Semi-Sweet Chocolate Chips - 1 Cup - 173g\r\n* Custard Powder - 1 Tbsp - 6g\r\n* Cocoa Powder - 1 cup - 90g\r\n* Cocoa Powder - 1 Tbsp - 6g\r\n* Honey - 1 Cup - 352g\r\n* Molasses - 1 Tbsp - 20g\r\n* Peanut Butter - 1 Cup - 240g\r\n* Ketchup - 1 Cup - 280g\r\n* Vegetable Oil - 1 Cup - 224g\r\n* Vegetable Oil  - 1 Tbsp - 14g\r\n* Pecans – 1 Cup - 113g\r\n* Pumpkin Puree - 1 Cup - 244g"
            }
        ]
    },
    {
        "title": "I wish people would stop rating online recipes after making a dozen substitutions/changes",
        "selftext": "I don't mean to gatekeep people from making adjustments to suit their own tastes or anything, but GOD ALMIGHTY can these people stop \"reviewing\" recipes based on the changes they make?\n\nI find sites like AllRecipes to be especially guilty of this. Reviewers will rate a lasagna recipe 5 stars for tasting \"just like their Italian grandmother's,\" only for them to elaborate that they subbed all the spices, and used obscure meat that are impossible to find, and sourced mozzarella and ricotta from Rome or wherever. You also have the opposite extreme, where people rate a chocolate chip cookie recipe 1 star (or complain that they would rate \"zero starts if they could\"), and it turns out \"all they did\" was sub eggs with flaxseeds, used vegan butter instead of the real stuff, and replaced flour with almond meal--and they wonder where they went wrong. \n\nEnd rant. Thanks for coming to my Ted Talk.",
        "num_comments": 535,
        "comments": [
            {
                "author": "WEugeneSmith",
                "body": "Or those who have NOT made the recipe, but clog up the comment section with \"This looks great. I can't wait to try it\".\n\nTRY it, then post you comments."
            }
        ]
    },
    {
        "title": "Help, my ‘famous homemade cake’ is actually just a box mix and now I’m stuck living a lie",
        "selftext": "Update: You guys are crazy about this story i can’t answer to you all but thanks you so much for the help, and recipes you shared with me ❤️  I came clean to my boyfriend & he thinks it’s funny. So I’ve decided to tell the truth to my friends once I baked a great replacement recipe to give them as a make-up. They won’t buy the Alsa batter mix because of the palm oil in it, and I shouldn’t either tbh.. I’ll keep you updated in the cooking sub 👩‍🍳\n\nI’ve really dug myself into a hole. It all started at this event where we were supposed to bring a cake. I had totally forgotten, didn’t have time, so I grabbed one of those ready made cake mixes, like Alsa (maybe its a French brand idk ). Of course, I didn’t dare admit it was just a box mix(edit not a box mix, but a already made batter) , since the whole idea was to bring something “homemade”… But then the cake was such a hit. Like, such a hit that ever since, people keep asking me to make my “famous” chocolate cake for every birthday, every party… \nThis has been going on for years now. Everyone keeps begging me for the recipe, and I’ve tried a million times to recreate it with recipes I find online, but the result is always so disappointing compared to that cursed mix. And now my friends are getting annoyed at me for not sharing the recipe, cause I keep saying I will.\nSo please, I need help figuring out how to reproduce this chocolate cake. On top of everything, the mix is ridiculously expensive, and I’m tired of wasting money and lying to my friends!\n\nÉdit3: here is the actual list of ingredients \nIngredients: Palm oil, EGG 21%, sugar, cocoa powder 18% (sugar, cocoa mass, cocoa and low-fat cocoa powder, natural vanilla flavor), WHEAT flour 10.3%, a stabilizer (glycerol), powdered CREAM, powdered EGG white, a pinch of raising agents (diphosphates and sodium carbonates), a little salt, and a preservative (E202).\n\nEdit2: it’s actually not a box mix, my translation isn’t the best. It’s a pre-made batter ready to be put in cake mold and int the oven. Not my video but here’s what it’s look like https://www.tiktok.com/@lesdelicesdemaryam/video/7397920950995488032\n\n\nEdit: I’m French and very few people actually uses ready to bake mix. Everybody ate really healthy and nothing pre-made, I think that’s why no one recognised my fake cake and liked it so much. It really is tastier than any chocolate cake I tasted. I’m also sick of eating this unhealthy mix, so if you have a recipe that tastes the same I’ll be eternally grateful 🙏 (on the package there’s a lot of bullshit in the ingredients and no info for the amount so I can’t really copy that)",
        "num_comments": 1715,
        "comments": [
            {
                "author": "dcorangebird",
                "body": "My great aunt's famous pineapple upside down cake was a secret for years, when she got up there in age I needed it so begrudgingly she told me to get a pen and paper:\n\n\"Go to the store and get a can of pineapple rings, a jar of maraschino cherries, and a box of Duncan Hines pineapple upside cake mix, follow the instructions on the side of the box\"\n\nYou're not the only one 🙂 just come clean"
            }
        ]
    },
    {
        "title": "Hot Sauce has Ruined my Life",
        "selftext": "\nI have always enjoyed my food, but never been fussy, if I go to a restaurant I have pretty much always enjoyed the experience and like to try new things.\n\nAround 18 months ago this all changed...\n\nI had some hot sauce in the fridge given to me as a gift. I cooked some poached eggs for breakfast and decided to add this rather than my normal salt/pepper.\n\nI'm now a shadow of my former self. The sauce added so much flavour and depth to what I already thought was a delicious breakfast... it blew my mind...\n\n It is now IMPOSSIBLE to enjoy food without some kind of spice. I genuinely feel unsatisfied if food doesn't have some kind of kick. The average restaurant experience is now ruined. Bland food genuinely upsets me now and I look down upon people who have not been 'awakened' to the point that I have had arguments.\n\nI talk about hot sauce in my sleep. I fight strangers in the street.\n\n Last night, making love to my wife, in the moment of climax instead of screaming her name I screamed out  'HOT SAAAUUUCE'. She is now leaving me after I said her porridge was bland. \n\nI have lost control and it's all the Hot Sauce's fault. \n\nAt least I'm not a Tottenham fan though, things could be worse...\n\nEdit: since everyone wants to know what Hot Sauce it was, the original is long gone. But the closest I can get is Nali, from Malawi, it's a different gravy and I'm happy to give them some free advertising 😘✌\n\nEdit 2: thank you for all the recommendations I've just spent about 50 quid on chili oil and Hot Sauce you bastards",
        "num_comments": 973,
        "comments": [
            {
                "author": "None",
                "body": "That's the worst supervillain origin story I have ever come across."
            }
        ]
    },
    {
        "title": "What do kids eat?",
        "selftext": "In the US, children's food is typically macaroni and cheese, chicken nuggets, and pizza. My kids adore these foods. \n\nWhat do kids in other countries eat? What recipes do picky-eaters all over the world use?\n\nEdit: I'm really looking for recipes/ideas, not parenting advice. I know I am responsible for them eating healthy foods. That's why I made this post. I want them to try new things. If a kid in India likes something, then there's a good chance my kid in Kansas might like it too.",
        "num_comments": 2286,
        "comments": [
            {
                "author": "slammajammamama",
                "body": "In Japan, curry rice (like a japanified version of curry) and “hamburg” (beef patty often with minced onions in it, eaten with a sauce and with rice, not between buns) are classic kids’ favorites. There are a bunch more but the first two that pop in my head."
            }
        ]
    },
    {
        "title": "PSA: Don’t buy the fancy butter",
        "selftext": "I let myself buy the fancy butter for my holiday baking this year, and now I can never go back. My butter ignorance has been shattered. I just spend a lot on butter now, I guess. ",
        "num_comments": 967,
        "comments": [
            {
                "author": "Dolessrem",
                "body": "Supplemental PSA: there's a place for the good stuff and a place for the basic bitch butter. Keep both and save your wallet (some)"
            }
        ]
    },
    {
        "title": "MIL only has a glass cutting board, no real butter, and one rack in the oven. Happy Thanksgiving! What hell are you enduring today?",
        "selftext": "",
        "num_comments": 1568,
        "comments": [
            {
                "author": "localnarwhals",
                "body": "Eight adults, three children, one shower."
            }
        ]
    },
    {
        "title": "What’s the worst home cooking you’ve ever witnessed?",
        "selftext": "One time I was invited to a friend’s home, she said she’s cooking, I was excited since she’s from a different area in China, so the food must be different and good. \n\n\nHowever I saw her tossed frozen tofu in a hot pan, then dumped a bunch of sauce, then microwaved some meat, almost cook it, tossed it in the sauce too. \n\n\nIt was kind scary. During dinner time, she said “well you are not a big eater huh”. I mean, how could I be a big eater with that weird overcooked salty food? \n\n\nI was invited again, to make dumplings together. I brought dumpling skin (from a market, I can’t make them). She said she’s going to make the skin, I was excited, I haven’t had fresh dumpling skin for years. \n\n\nIt turns out she bought a tool on Amazon, thinking that would work, obviously she doesn’t know how to use a rolling pin either. The skin was so thick, also sadly not holding the fillings inside. \n\n\nI kinda took over and said let’s use the store brought skin, here are the fillings I made. The dumplings turned out pretty great, then she started to invite me over every weekend to “cook together”, took me a little while to find out I became her family’s free weekend cook. \n\n\nI grew up around men and women that cooked well, maybe that makes me very picky.",
        "num_comments": 3532,
        "comments": [
            {
                "author": "Bluemonogi",
                "body": "Things happen but I had never seen someone catch a casserole on actual fire until last Thanksgiving. They scraped the burnt top off."
            }
        ]
    },
    {
        "title": "When you realize you’ve just spent two hours on what the recipe estimates for 40 minutes.",
        "selftext": "Mood.",
        "num_comments": 710,
        "comments": [
            {
                "author": "None",
                "body": "[deleted]"
            }
        ]
    },
    {
        "title": "SHOUTOUT TO THE HOMIE WHO SAID REPLACE YOUR RICOTTA WITH BÉCHAMEL IN YOUR LASAGNA",
        "selftext": "Gods, it was delicious\n\nEdit: thanks for sharing your input and your own recipes, friends. \n\nPlease understand there’s regional differences all over the world for food. As a community of food lovers, let’s do less judging and more appreciating those differences.\n\nCook what makes you happy. 😊",
        "num_comments": 865,
        "comments": [
            {
                "author": "currycurryhurry",
                "body": "I’m half Egyptian and we make a casserole type dish called macaroni bechamel, and I always make mine with an extra thick ass layer of it on top. Look into it buddy!"
            }
        ]
    },
    {
        "title": "As if 2016 couldn't get any worse, I just saw a coworker put mayonnaise in the guacamole she was making for our office potluck",
        "selftext": "",
        "num_comments": 813,
        "comments": [
            {
                "author": "DrKomeil",
                "body": "Wait til you hear that a lot of people mash up peas and put them in guac."
            }
        ]
    },
    {
        "title": "The \"Salt, Fat, Acid, Heat\" cookbook is going to forever be my recommendation for first cookbook to those new to the practice",
        "selftext": "If you haven't picked up the book, you should consider it. Of the cookbooks I've been exposed to it's by far got the lowest barrier to entry to cook from. Plain language, describes every technique, great illustrations.   \n\nBut the biggest thing is it's divided into 2 sections. The \"elements of cooking\" and the recipes. The former (which is half the book's length) is a culinary course that covers just so much. Techniques, ingredients, the science behind how cooking works, how to improvise, etc.  \n\nThe book sets out not to be a list of recipes to make, but to teach you how to cook with what you've got. And it succeeds.   \n\nBasically, it teaches you how to cook, not just how to make things.   \n\nEdit: I see both a lot of love and a lot of hate coming from the Netflix show.   \n\nPlease bear in mind that the Netflix series is really just promotional material. It's not an adaptation. Don't make a judgement either way based on it. And yes, anyone that's touched the book can tell some of the people complaining in the comments watched the show without touching the book.   \n\nEdit 2:  \nFor those of you wondering about if you should buy the book after watching the show, here's my suggestion.   \n\nIf you liked the show, buy the book. Regardless of what you liked about the show, you will find more of it in the book and will enjoy it.   \n\nIf you didn't like the show because it didn't teach you much, buy the book anyway because the book teaches what you were expecting the show to.   \n\nIf you didn't like the show because you didn't like her or the tone the show set, do not buy this book. It is more of her and the tone is the same, you will not enjoy it.",
        "num_comments": 539,
        "comments": [
            {
                "author": "slaintebrian",
                "body": "I agree, amazing book and a great series. But I’d strongly suggest it as a combination read with The Food Lab, I think. Not saying one is better or worse, just two incredible works, some recipes but more how to think about food, and how to think about how things work and why. If you liked one you’d like the other."
            }
        ]
    },
    {
        "title": "Opinion / rant: what the hell happened to Joshua Weissman",
        "selftext": "I started watching Joshua 3 years ago he was the one who got me into kombucha. But as time progressed and he got more famous he's way of cooking, speaking and acting really changed. He's recipes can not be followed at all, if you gonna try you have to Google a shit ton because he skips so many important steps that your hair goes gray.\n\nAnd he's series of but better is so ridiculous prestigious and snobby it makes me go insane. McDonalds or Taco Bell isn't so bad that you have to spit it up and throw it in the trash like it's some rotten meat. He's latest video of Pizza Huts cinnamon sticks he just don't get it wrong on how the are made but ridicule people that eat it. I refuse to believe that he has never eaten on the places that he spit out food from when going in college or going on a trip as a kid.\n\nTell me your rich and pretentious without telling me. Also, papa kiss fucking stop you make me puke mate. \n\nI feel like there's not many YouTubers left out there that actually keeps things humble except food wishes. It really sucks. Progress is good Josh, but progress the wrong way isn't.",
        "num_comments": 2188,
        "comments": [
            {
                "author": "None",
                "body": "[deleted]"
            }
        ]
    },
    {
        "title": "What had you been cooking wrong your entire life until you saw it made properly?",
        "selftext": "I've just rewatched the Gordon Ramsey scrambled eggs video, and it brought back the memory to the first time I watched it.\n\nEvery person in my life, I'd only ever seen cook scrambled eggs until they were dry and rubbery. No butter in the pan, just the 1 calorie sprays. Friends, family (my dad even used to make them in a microwave), everybody made them this way. \n\nSeeing that chefs cooked them low and slow until they were like custard is maybe my single biggest cooking moment. Good amount of butter, gentle heat, layered on some sourdough with a couple of sliced Piccolo tomatoes and a healthy amount of black pepper. One of my all time favourite meals now\n\nEDIT: Okay, “proper” might not be the word to use with the scrambled eggs in general. The proper European/French way is a better way of saying it as it’s abundantly clear American scrambled eggs are vastly different and closer to what I’d described",
        "num_comments": 2534,
        "comments": [
            {
                "author": "EatsAlotOfBread",
                "body": "To stop stirring stir-fry like a maniac and to let it brown a little. Yummmmmm.\n\nI did not learn learn from anyone in particular, I just quickly washed a dish while the thing was cooking and stirred slightly later than usual. The flavor was so much better."
            }
        ]
    },
    {
        "title": "What is your \"Oh my gosh, you HAVE to give me this recipe\" dish that people always request for you to make?",
        "selftext": "And obviously include the recipe, if you can! Share the love!",
        "num_comments": 2085,
        "comments": [
            {
                "author": "kapowless",
                "body": "Since we're deep into BBQ and grilling season, my most requested summer recipe is the Moroccan inspired marinade I use for grilled veggie kebabs. It's zesty, spicy and full of bright herbs. Here ya go:\n\n\nMoroccan Veggie Marinade\n\n1/4 c olive oil\n\n1/4 c lime juice \n\n3-4 cloves garlic, minced\n\n1 tsp ground coriander\n\n1/2 tsp ground cumin\n\n1 tsp paprika\n\n1 tsp chili powder\n\n1/2 tbsp salt (I use flaked kosher)\n\n1/2 tbsp ground black pepper\n\nFresh cilantro and mint to taste, chopped fine.\n\n\nWhisk all ingredients together thoroughly, toss with vegetables (I use hunks of bell pepper, zucchini, red onion, and brown mushrooms for the kebabs, tastes amazing!). Marinade for at least one hour before grilling, though 3-4 hrs is best. You can use leftover marinade to brush on the kebabs while grilling.\n\nHope somebody here can get some tasty use from it, defs gonna try out a bunch of ideas on this thread. Thanks for all the ideas!\n\nEdit:  Wow, thanks so much for the upvotes and awards guys, wasn't expecting this to get so much love haha. Glad my recipe could be of use to you guys!"
            }
        ]
    },
    {
        "title": "In over a decade of cooking, I’ve injured myself with cheese graters more than with every other kitchen tool put together. There has to be a better way.",
        "selftext": "I’m 25, and I’ve been doing most of my own cooking for over a decade now. I’ve never seriously hurt myself in the kitchen, but I’ve had little cuts and burns like anyone else. Through all that time, I’ve hurt myself with a cheese grater at least once a year, and twice I’ve taken noticeable chunks out of my fingers. \n\nThere has to be something I can do to stop grating bits of my hands into the food. Help!",
        "num_comments": 1165,
        "comments": [
            {
                "author": "Ana-la-lah",
                "body": "For me, it’s the cutter on saran wrap. Good finger gash every few years."
            }
        ]
    },
    {
        "title": "I'm so tired of these shitty ass blog type recipe websites filling up Google search results. Does anyone have a no-bullshit place they go for for good recipes for anything and everything?",
        "selftext": "",
        "num_comments": 1255,
        "comments": [
            {
                "author": "TheLadyEve",
                "body": "[Check out all of the previous posts about this, you'll probably find some good recs](https://old.reddit.com/r/Cooking/search?q=recipe+sites&restrict_sr=on&include_over_18=on)"
            }
        ]
    },
    {
        "title": "Cooked chopped chicken is NOT an ingredient!!",
        "selftext": "Every recipe that says \"10 minutes prep\" but lists \"cooked, chopped chicken\" as an ingredient is a liar and should be deleted. Let's just ignore 20 minutes of prepping the chicken. \n\nLet me show you my delicious 1 minute lasagna! Ingredients: 1 lasagna!\n\nRant over",
        "num_comments": 837,
        "comments": [
            {
                "author": "TerrifyinglyAlive",
                "body": "I once saw a cake recipe that claimed it didn't have flour as an ingredient... because it used cookies busted up in a food processor."
            }
        ]
    },
    {
        "title": "What pieces of culinary wisdom are you fully aware of, but choose to reject?",
        "selftext": "I got to thinking about this when it comes to al dente pasta. As much as I'm aware of what to look for in a properly cooked piece of pasta -- I much prefer the texture when it's really cooked through. I definitely feel the same way about risotto, which I'm sure would make the Italians of the internet want to collectively slap me...\n\nWhat bits of culinary *savoir faire* do you either ignore or intentionally do the opposite of?",
        "num_comments": 4705,
        "comments": [
            {
                "author": "josemartinlopez",
                "body": "Listen to the spirits of your ancestors instead of a measuring spoon to know when to stop pouring soy sauce"
            }
        ]
    },
    {
        "title": "Butter is so much better for the outside of a grilled cheese than mayo",
        "selftext": "I regret ever buying into the hype over putting mayo on the outside of a grilled cheese-- my every instinct KNEW it was not going to taste right, but I had to try at least once.  It was so much worse-- it tasted off and no improvement in crispiness.  I saw so many chefs (looking at you, Bon Appetit) doing it and swearing by it that I was convinced I might have messed it up the first time and should try again.  Nope, same result!\n\nThis is a classic \"if it ain't broke, don't fix it\".  A grilled cheese was always perfect-- there is no hack or improvement to this platonic ideal of crispy, buttery bread breaking through to the warm lava flow of melty cheese.  The butter is an essential element, giving the nuttiness of it browning in the skillet and perfect texture.  Go ahead and riff on it with all the combinations and additions all you like, making delicious melts of all varieties, but don't change the core elements: bread, cheese, and BUTTER.  Sometimes we need to realize \"oh right, it's been done this way forever because we figured out it's perfect like this\" (this applies to a lot of kitchen gadgets too, when the basic tools + basic practice and understanding are so much better).",
        "num_comments": 1588,
        "comments": [
            {
                "author": "None",
                "body": "I tried it once.  It's easier to spread, but the end result doesn't taste as good.  To me it's one of those hacks that sacrifices quality for convenience."
            }
        ]
    },
    {
        "title": "This sub saved my foot",
        "selftext": "Awhile back someone posted \"A dropped knife has no handle.\"  \n\nThe other night I was washing the dishes, my hands were wet and soapy.   I turned to grab the big chef knife that was left on the kitchen island behind me.   (I hate it when people who clear the table do that!  Seriously,  take three more steps and bring everything to sink.)  The knife slipped out of my hands and I actually tried to grab the handle! That saying came screaming into my head.  I threw my hands in the air and jumped back.  The knife landed where my bare foot would have been.\n\nSo thanks to all you wise cooks out there!  You saved me a hospital trip.",
        "num_comments": 419,
        "comments": [
            {
                "author": "Rogahar",
                "body": "A friend of my mum's at her last job lost the use of their left hand permanently after someone left a big kitchen knife in a sink full of other things. They reached in while cleaning dishes and whoop - severed all the major tendons in her hand."
            }
        ]
    },
    {
        "title": "What cooking hill will you totally die on?",
        "selftext": "I break spaghetti in half because my kids make less of a mess when eating it....",
        "num_comments": 8135,
        "comments": [
            {
                "author": "TheRoastedCapon",
                "body": "Eggs are always cooked LAST when cooking breakfast. I don't know why hot eggs are important to me, it just is."
            }
        ]
    },
    {
        "title": "Am I going crazy or has the quality of groceries gone way down even post pandemic?",
        "selftext": "Having to peel many layers of onion because of slimy dark layers. Lots of bad garlic in a bulb. Questionable meat quality. Is it just my area or has anyone else experienced this too?",
        "num_comments": 1166,
        "comments": [
            {
                "author": "None",
                "body": "I’m in Washington state US and I am glad to see I am not the only one noticing bad onions! I buy onions more consistently than any other vegetable and I have found bad onions at every single grocery store from the discount warehouse to the bougie upscale stores. Pre 2020 I rarely ever encountered that. I’m starting to buy twice what I need in case I get a few bad ones."
            }
        ]
    },
    {
        "title": "My Asian mum threw away my single origin kalamata extra-virgin olive oil because it tasted bitter. What are your worst food disasters resulting from other people's well-meaning actions?",
        "selftext": "",
        "num_comments": 3207,
        "comments": [
            {
                "author": "badmonkey247",
                "body": "My sister-in-law stopped by the house while we were out.  We returned shortly, and she proudly presented the basket of green bell peppers she'd harvested for me from my garden.\n\nThey were California Wonders, and I had planned to keep them on the vine until they turned red."
            }
        ]
    },
    {
        "title": "What is your cooking hack that is second nature to you but actually pretty unknown?",
        "selftext": "I was making breakfast for dinner and thought of two of mine- \n\n1- I dust flour on bacon first to prevent curling and it makes it extra crispy\n\n2- I replace a small amount of the milk in the pancake batter with heavy whipping cream to help make the batter wayyy more manageable when cooking/flipping  Also smoother end result",
        "num_comments": 4258,
        "comments": [
            {
                "author": "pirfle",
                "body": "Powdered buttermilk.   \nI only recently found out about it but I have wasted so much buttermilk when all I needed was a bit."
            }
        ]
    },
    {
        "title": "What food do you consciously prepare \"wrong\" because you like it better that way?",
        "selftext": "",
        "num_comments": 6424,
        "comments": [
            {
                "author": "None",
                "body": "When i was a kid i would come home from school and mom would leave the ingredients out for dinner and I was pretty much expected to have dinner ready when they got home from work. \nMeatloaf was a fairly common dinner as it was easy to make and everyone liked it. \n\nOne day I was pissed at my parents about who knows what and as revenge I dumped about half the container of garlic powder into the ground beef mixture and put it in the oven. \n\nWe all sit down to dinner and my dad takes a bite of meatloaf and says in his gruff voice: “This is the best goddamn meatloaf I’ve ever had!” \n\nLearned an important lesson about garlic that day "
            }
        ]
    },
    {
        "title": "Does anyone else have a favorite burner on the stove?",
        "selftext": "Mine is the bottom right one lol",
        "num_comments": 1005,
        "comments": [
            {
                "author": "satoh120503",
                "body": "Bottom right, unite! Lol"
            }
        ]
    },
    {
        "title": "He poured a huge pan of stock down the sink. I'm still in shock.",
        "selftext": "I made a chicken stock yesterday with a month's worth of vegetable scraps from my freezer. I was so excited about all the lovely things I was going to do with it, 4 hours on the stove. Honestly one of the best stocks I have ever made. I had recently read a thread on here about kitchen mistakes and people were saying the worst is when you forget to place a pan under the strainer, and accidentally poured their stock down the drain. So, obviously I was hyper vigilant about it. Strained my stock and set it in the pan to one side to cool. Next time I go into the kitchen the pot is empty. How thoughtful, he must have put it in the fridge. No, he poured it down the drain claiming he thought it was dirty dish water, like a pot left to soak. I am shocked and disappointed and confused as to how anyone could mistake an aromatic stock for soapy dish water.\nThis is not the way.",
        "num_comments": 904,
        "comments": [
            {
                "author": "bobs_aspergers",
                "body": "I had a night porter turn the flame off on a beef stock I had going overnight. Wasted ~100lbs of bones, and a similar amount of veg."
            }
        ]
    },
    {
        "title": "My cottage pie made a grown man cry",
        "selftext": "I've got 18 people camping at our property while attending a training course. I've been cooking evening meals (simple stuff) for them for the past 6 days and last night was cottage pie. One of the attendees (not a UK national) asked me what he was eating. I initially thought there was a problem but when I explained the dish, he welled up and thanked me; it tasted exactly the same as a meal his grandmother used to make him, apparently she learned it while in England during WWII but he never knew what it was called nor the recipe.\n\nWas a lovely moment and demonstrates that food really can touch your soul",
        "num_comments": 287,
        "comments": [
            {
                "author": "donac",
                "body": "Lol, I spontaneously cried once, over a Scandinavian chicken and rice dish. It was super embarrassing because I was in a semi fancy restaurant,  and the waitress was right there! Needless to say, everyone was very surprised. \n\nThen, I had to explain that it was something that my grandmother made me as a child, and I just never expected to taste it again."
            }
        ]
    },
    {
        "title": "Can we all take a moment to thank recipe sites for starting to put, \"Jump To Recipe,\" buttons at the top of their pages?",
        "selftext": "Finally, we can skip all the babble that's only there to boost search engine results! I've been using so many more recipes online as a result.",
        "num_comments": 215,
        "comments": [
            {
                "author": "dennsby",
                "body": "Speaking from a food blogger perspective, I don't like making the giant wall of text either, but Google makes you do it or they won't show it to anyone. Also, without anything to read, the time on page goes down significantly, which Google dislikes as well. Of course, I still respect people's time, so I use the Jump To Recipe button."
            }
        ]
    },
    {
        "title": "Measuring by weight is SO MUCH EASIER AND PRECISE than measuring by volume.",
        "selftext": "It’s beyond me why we as Americans can’t get on with it.\n\nLike seriously - no more wondering if you tapped your cup of flour enough. No more having to wash all your measuring cups and spoons. No more having to worry about the density of your ingredients:\n\n>*“is one cup of finely shredded parmesan more than one cup of coarsely shredded parmesan?”*\n\nYou put all your ingredients in one bowl and you reset the scale each time you need to measure a new ingredient. That’s it. Easy peasy.\n\nLess cleanup. More preciseness. Why not??",
        "num_comments": 1073,
        "comments": [
            {
                "author": "CourtneyLush",
                "body": "I would say this because I'm in the UK and already signed up to team weighing scales by default. Owning a set of scales makes baking using ratios a breeze. Want to bake a smaller batch of rolls, not a problem with a set of scales, larger cake,  ditto. \n\nThat said I tend not to use scales for stews, casseroles etc. I just use what I've got and eyeball the rest. But any kind of baking, I'll ignore any recipe that doesn't specify weight."
            }
        ]
    }
]