{
  "Importance of modern cookery": "Bulk cookery has existed for thousands of years, as long as there have been large groups of people to feed, such as armies. Modern cookery system has started after the middle of eighteen century. At the time food production in France was controlled by guilds. The great chefs were employed in house and Escoffier was one of the main people working in food preparation under guilds. Auguste Escoffier left behind a legacy in the French culinary industry. He invented some 5000 recipes, published “Le guide culinary text book” and developed approaches to kitchen management. His carrier in culinary arts began when he was 12. He entered in apprenticeship in his uncle’s restaurant in nice. Then he went on another apprenticeship when his age was 19. This time he was working in Paris. Escoffier was the very first chef who worked directly for the public. His 2 main contributions were 1. Menu planning and recipe standardization (the simplification of classical cuisine & classical menu) Do you know! 2. Steam line workplace with standardization of Monsieur Boulanger opened the first kitchen designations. free standing restaurant in Paris in 1765. Escoffier is the founder of modern cookery who starts working on modern cuisine. He used different innovations in his cooking. He combines different recipe and creates some 5000 new recipes which place and major role in the beginning of modern cookery.",
  "Elevation of modern cookery with the passage of time": "The art of cooking and presentation is considered very ancient. The first cook was a man, who put a chunk of meat close to fire and cooks it. He discovered that meat is cooked this way is too much tasty and delicious. It’s the starting of cookery. With the passage of time, it was very important to introduce innovation and variation in dishes because people get bore from old cuisines and recipes. New recipes and cuisines and introduced by different chefs and cooks according to their regions, traditions and religions according to the demand of their customers. It’s the period in which modern cookery make a new turn to the betterment and bright future.",
  "Distinguish with classic and modern cookery": "Classic cookery Modern cookery Classic cookery is the era of cookery in Modern cookery is the cookery which describes which food was served in large portions. the innovation in classic cookery. No standard recipe was followed in this Standard recipe card is followed in modern cookery. cookery. Classical cookery is ancient as human George Auguste Escoffier is the creator of civilization. modern cookery Sour cooker slow cream cheese cake – Salted caramel cheese cake- modern cookery classic cookery",
  "Food trends around the world": "Food trends are the changes in food preferences. Some of the trends are long lasting and remain favorites for years. Food trends are often advertised in magazines and around the internet. Trends can come to the innovation in basic foods.",
  "Food trend characteristics": "Some of the food trends characteristics are listed below. • Healthy cooking according to balance of nutrients • Alternate carbohydrates • Flexitarian diet Food trends in burgers • Dining outs • Innovation in desserts • Fusion cuisines",
  "Types of food trends": "Food trends are set according to traditions and regions. The different types of food trends in club foods, fast foods and street foods include: • Add more vegetable portion in meals • Healthy sweeteners instead of sugar • More beverage options • Separate and more attractive kids‟ menu • Smart and unique appliances • Rapid deliveries • Artificial intelligence • Healthy alternatives of fats and butters • More cooking practices Food trends in fast food • Environmental friendly packaging • Usage of healthy herbs • Pop up marketing techniques Food trends in Street foods Food trends in club foods",
  "Introduction to Food Science": "Food Science is a name which is used to describe the application of scientific principles to make, create and maintain a wholesome food supply. Food Science helps us to make best use of the food resources. It minimizes the waste as well. Most of the food materials are from the biological origins. Food Molecular gastronomy Science has given us: • Frozen Food • Canned Food • Microwave Meals • Milk packs • Snacks • Nutritious new food • More easily prepared traditional food Because most food materials are from the biological material how they behave in harvesting, processing, distribution, storage and preparation is a very complex problem for understanding all of these broad-based training is required. The proper application of food science is known as the food technology. Food technology is used for the selection, preservation, processing, packaging, distribution and use of save and healthy food in our daily life.",
  "Molecular gastronomy": "Molecular Gastronomy is the scientific process which is concerned with the physical as well as the chemical transformations that occur during the whole process of cooking. These processes and interactions are explored and manipulated to yield favorable, functional and artistic results. In short, the Gastronomy is the study related to sense of taste, smell. The molecular gastronomy is a practice of changing of physical state of food to enhance flavor, texture and appearance. Examples of Molecular Gastronomy Some examples of molecular gastronomy foods are jellification, smoking, sous bide, concerting oil into powders, turning vinegar into edible balls or sphere, Cocktails in ice spheres, instant setting ice cream, and spaghettis made from vegetables and many more.",
  "Principles of cooking": "Gelatinization Gelatinization is a process which occurs during the process of cooking. Gelatinization takes place in the cooking converts any liquid to jelly by using gelatin, agar and pectin. In this process the starch becomes soft and edible Examples of Gelatinization The foods items in which gelatinization take place are • Porridge • Rice pudding • Pasta • Sticky Rice Do you know! The most common examples of starch gelatinization are found in the sauce, pasta and baked goods. In sauces starch are added to liquid to make them thick while heating. The starch will absorb the extra liquid and swell resulting in the liquid becoming thicker. The process of gelatinization Caramelization Caramelization is a process where sugars change its color because of heat. It is also known as Millard reaction. It is the process of cooking the sugar until it turns into brown. When table sugar is heated to high temperature about 155°C to 182°C it turns into brown. At this temperature, the sugar compounds begin to break down and new compounds forms. Examples Caramelization is used in the production of different food items such as Crèmebrulee. Caramelized onions are also used in some dishes such as French Onion Soup Coagulation means transformation of proteins from a liquid state to a solid state. It indicates a clear change in the Caramelizaton in crème brulee fluid to turn to a solid or semisolid (gel) state. Many food items are depending on the process of coagulation while cooking. It is a very visible change. This process takes place when denatured proteins separate from other nutrients and solidify. Example: Raw eggs being cooked Coagulation process in eggs Key Points  Bulk cookery has existed for thousands of years, as long as there have been large groups of people to feed, such as armies. Modern cookery system has started after the middle of eighteen century. At the time food production in France was controlled by guilds.  The art of cooking and presentation is considered very ancient. The first cook was a man, who put a chunk of meat close to fire and cooks it. He discovered that meat is cooked this way is too much tasty and delicious. It’s the starting of cookery.  Classic cookery is the era of cookery in which food was served in large portions.  Modern cookery is the cookery which describes the innovation in classic cookery.  Food trends are the changes in food preferences. Some trends are long lasting and remain favorite for years. Food trends are often advertised in magazines and around +the internet.  Food Science is the science which is used to describe the application of scientific principles to make, create and maintain a wholesome food supply. Food Science helps us to make best use of the food resources. It minimizes the waste as well.  Molecular Gastronomy is the scientific process which is concerned with the physical as well as the chemical transformations that occur during the whole process of cooking.  Gelatinization is a process which occurs during the process of cooking. Gelatinization takes place in the cooking of many traditional starchy foods and starch based desserts  Coagulation means transformation of proteins from a liquid state to a solid state. It indicates a clear change in the fluid to turn to a solid or semisolid (gel) state.",
  "History of Pakistani/Mughlai region & their cuisines": "Mughlai cuisine is considered to be the combination of almost all the Asian cuisines which were impractical that time. Mughlai cuisine/Pakistani cuisine is strongly directed by Turkish cuisine of Central Asia (Pakistan, Northern India, and Bangladesh). This cuisine is consisting of many dishes which were developed in the medieval indo-Persian cultural centers of the Mughal Empire. It is the combination of the cuisine of Indian subcontinents with the cooking standards and styles and the recipes of central Asian and Islamic cuisines. Mughlai is a cooked food in a Pakistani & Indian style which came as a result of Mughal rule in India from 1426 to 1857. It is a Different aromatic spice, nuts; dry fruits are added in this food. That’s why the flavor of Mughlai/Pakistani cuisine can range from mild to spicy. Following are the Mughlai / Pakistani dishes Biryani Pulao Kababs Kofta Haleem Nihari Samosa Qorma Bakar khani Chicken tikka Tandoori chicken Aloo ghost Some other dishes of Pakistani/Mughlai dishes include: • Keema muter • Shahi kofta • Rashmi kabab • Daal makhni • Chicken moti pulaoo • Kastoori Mughal tikka • White kofta • Harisa etc Some desserts of Pakistani/Mughlai cuisine are South Asian saviyan Shahi tukray South Asian halwa Phirni Sherbet Gulab jaman Jalebi Kheer",
  "Dining trend of Pakistani/Mughlai regions": "In Pakistani/ Mughlai cuisine, they people taking their meal in large plates, which are not much bigger in sizes. They take their meals separately in their own plates. In the Pakistani/Mughlai cuisine, the food is prepared in special spices and herbs which can make this cuisine special and unique from the others cuisine. There are many parts of their meals for example, rice, chapatti, naan, bread, meat. Vegetables, cereals, salads, raita and one or two sweet dishes are present. Dining Style and Food platter of Pakistani/Mughlai cuisine Traditional style of dining Ancient Thal of Dinner in Mughal/Pakistani cuisine",
  "Types of cooking methods, tools & equipment used in Pakistani/ Mughlai cuisine": "The Mughlai cuisine was a tough and time-consuming cuisine. In this cuisine butter- based curries and various numbers of sauces are included. This cuisine is so indulgent and it was created to make people want more food. The names of these foods are also very attractive and intriguing, which may attract people to try new dishes in Pakistani/Mughlai style. In Mughlai cuisine, dishes like mild to medium hot cream and nut-based gravies, rice dishes with lot of nuts, dry fruits, rich creamy desserts, spices like cardamom, cloves, nut mug, saffron, and cinnamon. These popular gravies also pair well with rice and bread. Cooking methods Following are the common cooking methods in Mughlai/Pakistani cuisines. 1. Deep frying 5. Roasting 2. Boiling 6. Pan frying 3. Stewing 7. Steaming 4. Sautéing Deep frying Deep frying is the moist heat cooking method in which food is cooked in hot oil. Normally, a deep fryer is used for this purpose. Examples include fried kebabs, paratha, rolls, samosa and chicken. Deep fried chicken Boiling Boiling is the type of moist heat cooking method in which food is cooked in hot water at 100C. Examples include boiling of rice, potato, vegetables, corn and chicken. Boiling of potato Stewing Stewing is a moist heat cooking method in which combination of solid food, is cooked in liquid and serve as gravy. Examples include aloo ghost, chicken korma, yakhni pulao etc. Aloo ghosht made with stewing Sautéing Sautéing is a fat fry cooking method in which food is cooked in a little amount of fat on high heat. Examples include stir fry of vegetables, mushrooms and onions . Sautéing of vegetables Roasting Roasting is the dry heat cooking method in which food is cooked in an oven on dry heat with a least temperature of 150C. Examples include roasting of whole chicken. Roasting of chicken Pan frying Pan frying is a fat fry cooking method in which food is cooked in a minimum amount of fat. Example includes shallow frying of kebabs, mutton, chicken etc. Panfrying of mutton chops Steaming Steaming is a cooking method in which food is cooked in steam. This is mostly done in a steamer. Examples include steaming of vegetables and meat. Steaming of vegetables Tools, utensils and equipment: Pans Pots Tongs Spatula Copper pot Mortal & pastel Serving pots Wok Crockery Cutlery Knives Rolling pin",
  "Spices, sauces and staples used for cooking in Pakistani/Mughlai cuisine": "Basic spices of Mughlai cuisine are listed below Saffron Cardamom Black pepper Dry fruits Nuts Cloves Coriander powder Nutmeg Cinnamon sticks Turmeric Salt Red chilli Cumin seeds Bay leaves Ginger Garlic Sauces in Mughlai/Pakistani cuisine Basic sauces used in Mughlai/Pakistani cuisine include plum sauce, mint sauce and corianders sauce. Mint, coriander and plum sauce Staples Following are the staple food of Mughlai cuisine Rice Wheat bread (roti, puri) Lentils Vegetables Yogurt Fruits",
  "Cooking Methods involved in Pakistani cuisine": "Following are the cooking methods used in Pakistani cuisines 1. Deep frying 5. Roasting 2. Boiling 6. Pan frying 3. Stewing 7. Steaming 4. Sautéing These methods are already described in previous topic",
  ".3": "Recipes Recipe of a dish describes a set of instruction for preparing a particular dish, including a list of the required ingredients for preparation of the dish. Murg malai kabab Name of dish Murg malai kabab Preparation time Cooking time 40 mins 25 - 30 mins Number of portions: 4 Size of unit: 1 Commodities: Items Quantity Items Quantity Chicken boneless 500 gm Butter 25 gm. Salt As per taste Egg 1 Ginger paste 10 gm. Cream 250 gm. Green chilli 10 gm. Garlic paste 10 gm. Nutmeg 2 gm. Lemon juice 3 gm. Black pepper As per taste Germ masala 2 gm. Method  Wash chicken, add all spices in it and mix well.  Then add butter and lemon juice.  Marinate it and leave for 3 hours.  Arrange chicken on skewers and fry it. Murg malai kabab Shahi Chicken Korma Name of dish Shahi chicken korma Preparation time Cooking time 50 mins 10 mins Number of portions: 4 Size of unit: Commodities: Items Quantity Items Quantity Chicken 1 kg Dry Red chillies 3 Tomato 2 medium Coriander powder 8 gm. Onion 4 medium Salt As per required Milk 250 ml. Saffron 1 pinch Oil 200 ml. Kasoori methy 10 gm. Ginger paste 9 gm. Black pepper As per required Garlic paste 9 gm. Bay leaves 2 Cumin seeds 5 gm. Curd 125 gm. Cardamom 5 Cashews 25-30 Method • Heat the handi or kadhai and add oil into it. Once the oil is hot enough add onion into it fry them nicely and take out the onions and keep aside. • Reduce the flame and add spices like bay leaf, dry whole red chili and cumin, stir it nicely then add onion, tomatoes, ginger garlic paste and all the remaining spices into it and cook masala. • In the meantime, marinate the chicken with some Shahi chicken korma salt and turmeric. • Once the masala appears cooked add marinated chicken into it and allow the chicken to cook in the bhunna masala. • While the chicken is cooked gently add curd and 10 - 15 cashews blended paste into it. • In the meantime, take a small bowl and mix milk, sugar and saffron strands into it. Whish the mixture and add it to the gravy along with some water. • Cover the lid and cook it for 10 - 15 minutes. Once the chicken appears cooked add in the kasoori methi. • At the end garnish it with coriander leaves and remaining cashews Shahi tukray Name of dish Shahi tukray Preparation time Cooking time 50 mins 10 mins Number of portions: 4 Size of unit: 1 Commodities: Items Quantity Items Quantity Full fat milk 1 liter Cardamom powder 5 gm. Sugar 250 gm. Ghee 20 ml for frying Saffron 8 stands Almond flakes 10-12 Brown bread 4 slices Raisins 10-12 Method Making rabri • Soak saffron strands in warm milk and keep it aside in a bowl. • Boil 1-liter milk in a heavy bottom pan. • Once you get the first boil that is after 5 minutes simmer it on a low flame and keep boiling till the milk reduces in half quantity. • Keep scraping the cream from the sides of the pan and add it into the milk. • Now add sugar and Saffron strands into the milk and keep stirring it in between. • Allow the milk to boil further for 20 minutes stirring it in between till the milk becomes thick and has almost reduced to 1/4 of the quantity. • Transfer the milk into a bowl and let it cool under the room temperature. • Once its cooled down keep the rabri into the refrigerator. Making sugar syrup • Add sugar, cardamom powder and water into a pan and boil it till sugar dissolves. • It will take approximately 3-4 minutes. • Boil the syrup till you get one thread consistency. Keep it aside and let it cool. Bread slices • Cut the core of the bread slices and keep it on a plate. • Take a small pan and heat it. Add ghee in the pan and heat it on a medium flame. • Once the ghee is hot fry the bread slices till they are crispy and golden brown in color. • Remove it and keep it on a plate. Garnishing • Heat ghee in a small pan and fry almond flakes and raisins in it. • Once they are nicely brown in color remove them in a bowl. Bread Socking • Once you have fried the bread slices in the ghee, soak them in the sugar syrup for 3-4 minutes and place it on a serving plate. SERVING SHAHI TUKRA • We have done all the necessary preparations for making Shahi Tukra. • Now it‟s time to assemble it just before serving. • Take the serving plate where you had placed the bread slices soaked in sugar syrup (in the step above) and pour the chilled Kesar rabri on it and garnish with fried dry fruits and sprinkle some dry rose petals on it. • Serve it chilled and relish it. Shahi turkay",
  "Traditional herbs and spices of Pakistani cuisine": "Traditional herbs Traditional spices Mint Cardamom Coriander Cloves Bay leaves Nutmeg Fenugreek Mace Cinnamon Black pepper",
  "History of Arabian/Greek region & their cuisines": "The history of Arabic cuisine goes back to the old civilizations of Middle East. These people used to make their food from the products they cultivated such as wheat, spices, grains and vegetables. They enjoyed meats such as poultry, mutton and lamb. Arabic cuisine is the cuisine of Arabs which is famous all around the Arab world from the Maghreb to the Fertile Crescent and the Arabian Peninsula. These cuisines are 1000 of years old and reflect the pure culture of trading in different ingredients which are used in Arabian cuisine such as spices, herbs, vegetables, meat and fruits. The Arab regions have many similarities, but also unique traditions. They have also been attracted by climate, mutual commerce and cultivation. Some popular Arabic dishes are as follow Hummus Manakesh Umme ali Grilled halloumi Shanklish Falafel Arabian shawarma Tabouleh Shish tawook Dolma Sulemani chai Baba ghanoush Do you know: In the Levant, Arabic coffee is a most liked beverage but Arabic tea is also much enjoyed in Jordan and Palestine. Some examples of Arabic desserts includes Kunefa Qatayef AishEi-Ssaraya Barbosa",
  "Dining trend of Arabian region": "The Arabian cuisine is the cuisine of the Arabs, Arabic cuisine is the cuisine which is defined as the various regional cuisines spanning the Arab word, from the Maghrib to the Fertile Crescent and the Arab Peninsula. These cuisines are centuries old and it tell us the culture of trading in spices, herbs and other food items. All the Arabic regions have their own similarities, but also unique traditions. In Arabian cuisine some dining trends are very unique and popular in the Arab countries. The Arabs like to eat in a specific thal which is bigger in size. They use to take their meal in groups. A single thal is served to a group of people. They like mutton roast, cooked with specific arab spices and olive oil. They like such a food which is a bit salty but not a spicy one. Following are the commonly used food items of Arabic Cuisine • Bread • Olive oil • Sauces • Olives • Sweets • Dates • Vegetables • Nuts • Special Teas and Kehwa • Mutton Dining trend in Arabian cuisine",
  "Types of cooking methods, tools & equipment used in Arabian cuisine": "The Arabic cuisine is one of the oldest cuisines. Arabs are very conscious about their heaths and diets. They mainly use olive oil and butter to cook their food. They use light flavors in their cuisine. They prefer the grilling and baking methods of cooking instead of frying. These methods are quit healthier than the other cooking methods. These techniques help to minimize the calories of the dish while still adding flavor. They use cereals as a basic diet. Grains like wheat and rice are used as the major staples. In the Greek cuisine they used to follow frying, breaded, simmering, roasting, grilling, poaching, pickling etc. Grilling, baking and roasting in Arabic cuisine Tools and equipment Mortal and pastel Spatula Wooden spoon Food processor Pyrex ovenware Skewers Pots Thermometer Do you know: Arabs eat olives with almost every meal even in the breakfast.",
  "Types of sauces, spices & staples used for cooking in Arabian cuisine": "The herbs and spices which are mostly used in the Arabic Cuisine are listed below Sumac (sumac flowers are picked and Zaatar (the mixture of Wild thyme, sumac and drupes are ground into a reddish - purple sesame seeds) powder) Tarragon Mastic Caraway Paprika Some other herbs and spices are including. • Sesame seeds • turmeric • Saffron • Garlic • Black pepper • Parsley • All spice • Coriander Sauces The most delicious and popular dressings used in the Arabic Cuisine is the combination of olive oil, lemon juice, parsley, garlic, tahini (sesame paste), Labaneh (strained yogurt) and often seasoned with different ingredients such as onion, garlic mint. Some famous Arabic Sauces are Shatta sauce Arabic garlic sauce Traditional toom Arabic bean sauce Middle eastern yogurt sauce Daqoos sauce Staples In Arabic/Greek cuisine the most famous staples are wheat (khobz bread and couscous) fish, seafood, goat, lamb, beef, dates, almonds, olives, various fruits and vegetables.",
  "Ingredients available for Arabian cuisine": "Following ingredients are the keys that make the Middle Eastern food flavorsome  Biharat  Sumac  Carob Molasses  Bulgur  Dried Barberries  Saffron  Aleppo Pepper  Cracked freekeh Ingredients 6 ingredients are used most in Arabic / Greek cuisine  Sesame Seeds  Bulgur  Pomegranate Molasses  Mint  Lemon  Saffron  Couscous",
  "Cooking methods involved in Arabian cuisine": "The basic cooking methods used in Arabian cuisine are 1. Grilling 2. Baking 1. Grilling Grilling is a dry heat method of cooking in which food is cooked in little amount of fat. Grilled holloumi Examples includes grilled holloumi, lamb mandi etc. 2. Baking Baking is a dry heat cooking method in which food is cooked in oven at specific temperature and time. Examples include umm ali, basbousa, kunafeh, baklava etc. Recipes Kunafa -Arabian dessert Creamy hummus: Name of dish Hummus Preparation time Cooking time 45 mins 10 mins Number of portions: 4 Size of unit: 1 Commodities: Items Quantity Items Quantity Chick peas 150 gm. Olive oil 24 gm. Chickpea liquid 250 ml. Lemon juice 5 ml. Tahini 125 ml. Method  Combine the ingredients and cook well. Falafel Name of dish Falafel Preparation time Cooking time 45 mins 10 mins Number of portions: 4 Size of unit: 1 Commodities: Items Quantity Preparation time Cooking time 45 mins 10 mins Dried chickpeas 225 gm. Parsley 350 gm. Scallions 1 bunch Salt As per taste Garlic cloves 4 medium Method  Combine all ingredients  Mix well and make small balls  Deep fry them Arabian laham mandi: Name of dish Arabian laham Preparation time Cooking time mandi 50 mins 10 mins Number of portions: 4 Size of unit: 1 Commodities: Items Quantity Items Quantity Mutton 1 kg. Green cardamom 4 Rice 500 gm. Cloves 4 Carrot 2 grated Black pepper 10 Capsicum 2 slice Nutmeg 1 pinch Olive oil 50 ml. Bay leaves 2 Almond 125 gm. Ginger powder 4 gm. Chicken stock 1 liter Lemon 4 slices Salt As per required Water 250 ml. Method • Add nutmeg, bay leaves, ginger powder, black pepper and clove in a grinder and grind well. • Now put mandi spices in a bowl and add lemon, 2 tablespoon oil, 1 cup water and salt. • Apply this mixture to the mutton and leave to marinate for a few hours. • Then tightly pack with aluminum foil. • Now bake in oven for 40 minutes. • Take out from oven and cook until water dries. • Inflame a piece of coal and place it in the middle of mutton pan. Now drizzle a little oil on coal and immediately cover it tightly. • Heat the remaining oil in a pan, add chicken stock and boil for a while. • Then add 1 tsp. mandi spice. • Now add salt and rice and cook till very little water is left. • Then mix capsicum and carrot. Arabian laham mandi • Cover tightly and steam on very low heat for 10 - 15 minutes. • When rice is ready, take it out in platter and put prepared mutton on top. • Garnish with almonds and serve hot Qehwa Arabeya: Name of dish Qehwa Arabeya Preparation time: Cooking Time 20 mins 10 mins Number of portions: 4 Size of unit: 1 Commodities: Items Quantity Items Quantity Water 1 liter Cardamom 4 Roasted and ground coffee 75 gm. Saffron 2 gm. Method • Boil the water in a pan • Add the coffee and let boil over low heat for half an hour • Remove from the heat and let rest for 5 minutes to allow the coffee to settle • Put the cardamom in a coffee pot, strain the coffee into it and add the saffron • Place the pot over the heat, bring back to boil once Qahwa arabeya",
  "Cooking style of Arabian cuisine": "Arabic cuisine includes olive oil, za'atar and garlic into it.It's common dishes include a wide range of mezze of bread dips, stuffing and its side dishes which are famous all around the world are hummus, falafel, tabouleh, Labaneh and baba ghanoush. In Arabic cuisine mostly fresh ingredients are used which are mostly grown locally or in the nearby region to conserve freshness. It is a creative and tasty combination of different ingredients to create delicious meals. It is most healthy cuisine as compare to the Preparation of mandi other cuisines. The cooking styles of Arabian cuisine are: Mutton roast Activities c. Stewing c. Deep frying",
  "History of oriental cuisine": "Oriental food is derived from different regions of China, North & South Korea, Japan, Taiwan, Tibet and Mongolia. Oriental food is also called Asian style cooking. The major impact on oriental/Southeast Asian cuisines deploy by china from the east and India from the west. Oriental cuisine is a broad term in which many styles of cooking include. The word oriental depends on the location, region and their traditions. In many parts of Asia, food is still called Asian food but in China, it’s called Japanese food. Many times when someone in Europe thinks of American food, Chinese food comes in mind, with chicken, rice, vegetables and sauces. Chinese food also qualifies as a type of oriental food in Europe. Classification of oriental cuisine  Korean  Japanese  Thai  Chinese Some examples of oriental food includes • Crunchy ice berg dumplings • Raw papaya salad • Chicken with chilies & chews • Balinese chicken • Laksa • Chicken Manchurian • Thai fish curry • Indonesian nasi goreng • Thai chicken curry • Prawn and sesame toast Chicken Manchurian- Oriental Cuisine",
  "Different region specialties in oriental cuisine": "Different regional specialties include Korean The three kingdoms of Korea, all have their own special and unique types of food dishes such as in second kingdom, most eat cold food is kimchi. Korean food is mostly oriented from Mongol. Korean food is mostly based on grains, meat, fish and vegetables. Examples include budra jiigae, kongguksu, tangpyeongchae etc. Thai Thai and Vietnamese which are the cuisines from Southeast Asia also called oriental cuisines. In this cuisine, foods include noodles, curries and hot spices. Examples include massaman curry, pad kro prao, khao soi, kway teow etc Japanese Japanese food is unique as it looks and as its taste. Japanese food was influenced by the Chinese during the tang dynasty. Japanese food is mostly based on rice, soup and noodles. Their dish includes fish, meat, vegetables and tofu. Examples include tempura, sushi, sashimi, unagi, soba, yakitori and sukiyaki etc. Chinese Distinctive features of Chinese cuisine is Harmoniouscolors, aroma, flavor and shapes in one dish. The basic principle of this region is blending of colors and flavors. Examples include chow Mein, hot & sour soup, spring roll, dim sums, stir fry tofu with rice, shitake fried rice with water chestnuts etc.",
  "Popular oriental dishes around the world": "Popular oriental dishes around the world are listed below. i. Chilli crab in Singapore ii. Khantoke dinner in Thailand iii. Curry feast in srilanka iv. Momos in Himalayan v. Candied haws in china vi. Kimchi in Korea vii. Satay in Indonesia viii. Roti parata in Singapore ix. Ais kacang in Malaysia x. Noodle soups in china xi. Shan noodles in Myanmar",
  "Basic oriental spices": "There are basic eight oriental spices, listed below Chilli Black pepper Galangal Ginger Bay leaves Curry leaves Lemongrass Spearmint",
  "Health benefits of oriental spices": "Curry leaves It gives unique tinge and flavor to food. It is beneficial for health. It has  Carbohydrates  Phosphorous  Fiber  Iron  Calcium  Vitamin A, B, C and E It is beneficial for heart functioning, boast immunity, fight from infections and enrich your skin and hairs. Coriander leaves Fresh coriander has anti-oxidants in it; it has anti septic and a natural stimulant that improve digestion along with fungicidal benefits. It is a good source of vitamin A and C which helps in improvement of immune systems. Chilli Chili helps in boasting high amount of vitamin C and antioxidants. It helps in prevention of cancers and stomach ulcers. Ginger Ginger is very healthy for human body. It helps in osteoarthritis, weight loss, nausea, lower sugar level; improve heart diseases risk factors, chronic indigestion and lower cholesterol levels. Cumin Cumin seeds anti-oxidants, anti-cancer properties and treat diarrhea. It also helps in control blood sugar, fight bacteria, lower cholesterol and weight loss. Turmeric Turmeric helps in healing of cuts and wounds. It has potential to improve heart health and prevent against cancer and Alzheimer’s.",
  "Types of oriental sauces": "The different types of oriental sauces are listed below. 1. Soy sauce 7. Fish sauce 2. Tomato sauce 8. Hoisin sauce 3. Mushroom soy 9. Tabasco sauce 4. Tamari 10.Peri peri sauce 5. Keycap manis 11.Hot sauce 6. Oyster sauce Purpose of oriental sauces  These sauces are used in different dishes to make them flavor and taste.  These are uses in marinating and seasoning as it has high salt level.  Dark soy sauce is darker and thicker and give sweet taste and used for flavor and seasoning.  Japanese soy sauce gives sweetness after fermentation  Tamari is a rich sauce made from soy bean and rice. It’s basically used in gluten free dishes.",
  "Ingredients of oriental sauces": "Oriental sauce Name of dish Oriental sauce Preparation time: Cooking Time: 40 mins 10 mins Number of portions: 4 Size of unit: 1 Commodities: Quantity Items Quantity Items Tomato 4 medium Spring onion 12 gm. Tomato ketchup 12 gm. Garlic 4 gm. Soy sauce 4 ml. Vinegar 10 ml. Sesame oil 5 ml. Coriander chops 7 gm. Method  Heat the sauce pan and heat it  Pour onions and fry them until golden brown.  Put tomato, tomato ketchup, soya sauce and other ingredients  Mix them well until desired consistency  Serve hot. Hoisin sauce Name of dish Hoisin sauce Preparation time: Cooking time: 40 mins 10 mins Number of portions: 4 Size of unit: 1 Commodities: Items Quantity Items Quantity Dark brown sugar 85 gm. Rice vinegar 12 ml. Water 20 ml. Sesame oil 2 ml. Chinese black bean 35 ml. Chinese five spice 2 gm. sauce powder Soy sauce 24 ml. Red chilli/srirache 3 gm. Method Combine all the ingredients in a blender and blend it until it becomes a smooth puree. Hoisin sauce Fish Sauce Name of dish Fish sauce Preparation time: Cooking time: 40 mins 10 mins Number of portions: 4 Size of unit: 1 Commodities: Items Quantity Items Quantity Finely chopped garlic 6 cloves Whole black 12 gm. Lemon zest 1 Small fish (herring, 625 gm smelt) Sea salt 10 gm. Non chlorinated water 500 ml. Bay leaves 6 Fresh whey 20 gm. Method  Mix the garlic and lemon zest with the sea salt  Rinse the fish and cut it into the 1/2 inches pieces  Then toss the pieces of fish with the salt mixture and coat the fish properly  Add peppercorns and bay leaves into it and pack all this mixture into a Mason jar press down the pieces to release the juice. Pour the whey into the jar.  Pour the water as required to completely dip the fish. (Be sure to leave it at least 1-inch of headspace from the top of the jar because the mixture will expand when it will ferment.  Cover the jar tightly and leave it on the room temperature for 3-4 days then place the jar onto the refrigerator and let it set for about 4- 6 weeks  After 4-6 weeks double strain the mixture.  Then store it into the refrigerator for 4-6 months Oyster Sauce Name of dish Oyster sauce Preparation time: Cooking time: 40 mins 10 mins Number of portions: 4 Size of unit: 1 Commodities: Items Quantity Items Quantity Shucked oysters with 225 gm. Light soy sauce 25 ml. liquid Water 12 ml. Dark soy sauce 6 ml. Salt 2 gm. Method  Drain the shucked oysters and reserve the liquid  Chop the oysters with a sharp knife.  Combine the chopped oysters with the reserve liquid and water in a saucepan  Bring it to boil  Stir the mixture occasionally to prevent the oysters from sticking to the bottom.  Simmer it for 10 minutes Add salt into it and stir well to combine  Stain the mixture with the help of a sieve and place it on the low flame. Add the soy sauce and boil it and simmer for more 10 minutes Keycap Manes Name of dish Keycap manes Preparation time: Cooking time: 10 40 mins mins Number of portions: 4 Size of unit: 1 Commodities: Items Quantity Items Quantity Soy sauce 200 ml. Cloves 2 whole Brown sugar/ cocnut 300 gm. Peppercorns 2 gm. sugar Molasses 10 gm. Chilli 2 gm. Garlic 3 cloves Coriander seeds 4 gm. Ginger 2 inch Lemon grass 4 gm. Star anise 2 whole (Note: palm/coconut sugar has a rich Caramel and butterscotch flavor whereas brown sugar yields a sweeter - tasting sauce, take your pick) Method  Place all the ingredients in a saucepan  Bring it to boil.  Cook it until it simmers  Cook it until the sugar is dissolved and sauce begin to thick  Cook it for 10 - 15 minutes  Turn off the flame and let it cool then stain it and store it into the refrigerator Activities Prepare, cook and finish 9 basic sauces of oriental cuisine and write recipe. Divide 9 sauces in the class. Each student will cook one sauce individually.",
  "Preparation & storing of different types of oriental sauces": "Storage of different types of oriented sauces: Sauces Storage Light soy sauce Cool, dark place up to 6 months In a fridge at 4C for one year. Dark soy sauce Air tight container in a cool place for 6 months Japanese soy sauce Cool or dry place for 6 months Mushroom soy After opening refrigerate up to one year. Tamari Storage in fridge till use by date. Keycap manis Store in dry cupboard for 2 years. Oyster sauce Store in refrigerator in 2-3 months Fish sauce Store in original airtight container in pantry. Hoisin sauce Store in refrigerator for 18 months. Recipes Oriental food refers to dishes made and consumed in the Southeast Asian countries. Dishes of Chinese, Korean and Japanese cuisine fall under the category of 'Oriental food'. Their dishes have lots of spices and dry ingredients like apricot and plum. Fermented sauces and pickled products are widely used in such foods. Some recipes of oriental food are listed below. Sticky Chinese chicken wings Name of dish Sticky Chinese Preparation time: Cooking time: chicken wings 40 mins 15 mins Number of portions: 4 Size of unit: 1 Commodities: Items Quantity Items Quantity Chicken wings",
  "kg Ketchup 75 ml.": "Sesame oil 3 ml. Chilli garlic sauce 10 ml. Lemon juice 20 ml. Garlic 4 cloves Light soy sauce 20 ml. Ginger 7 gm. Brown sugar 23 gm. Five spice powder 2 gm. Hoisin sauce 7 gm. Coriander leaves For garnishing Oyster sauce 7 ml. Method  Mix all the ingredients in a large bowl and place wings into it and toss well  Marinate it 5 - 6 hours into the refrigerator  Bake it in preheated oven on 180°C for 35 -40 minutes.  Garnish it with coriander/cilantro leaves/  sesame seeds, chillies, sliced shallots etc Chinese Fa Geo (Fortune Cake) Name of dish Fa Geo cake Preparation time: baking time: 30 40 mins mins Number of portions: 4 Size of unit: 1 Commodities: Items Quantity Items Quantity Flour 250 gm. Brown sugar 125 gm. Hot water 130 ml. Baking powder 4 gm. Method  Melt brown sugar with hot water and set it aside  Combine flour with baking powder, add sugar water, stir the batter in one direction for around 3-5 minutes Pour this batter into the molds and keep aside  Bring enough water into a large wok or deep pot, set up the steamer and place the batter in when the water begins to boil.  Cover it and continue steam for around 20 - 25 minutes. Egg fried rice Name of dish Egg fried rice Preparation time: Cooking time: 60 mins 15 mins Number of portions: 4 Size of unit: 1 Commodities: Items Quantity Items Quantity Boiled rice 500 gm. Spring onion 3-4 stalks Soy sauce 10 ml. Schezwan sauce 15 ml. Rice vinegar 8 ml. eggs 3 Chopped garlic 10 gm. Chopped carrot 125 gm. Crushed black pepper 2 gm. Diced bell peppers 125 gm. Salt As per required Cabbage shredded 125 gm. Oil 20 ml. Method  Boil and stain the rice  Heat a pan with oil add chopped garlic into it fry it for 30 seconds  Add spring onion whites and fry for a minute  Add chopped veggies and fry for about 2 minutes. (Veggies should be crunchy) Then slide all the veggies to one side of the pan.  Pour egg into the pan and scrambled it cook till they are soft and fluffy but not vercooked  Pour the soy sauces and vinegar into it.  Add cooled rice, salt, ground black pepper and spring onion greens.  Fry on the highest flame for about 2 minutes.  Adjust salt and spice as needed  Garnish it with some spring onion greens Egg fried rice Korean rice cake Name of dish Korean rice cake Preparation time: Cooking time: 60 mins 25 mins Number of 6 Size of unit: 1 portions: Commodities: Items Quantity Items Quantity Red kidney beans 125 gm Rice flour 250 gm. Salt As per required Boiling water 50 ml. Cinnamon 2 gm. Green tea powder For garnishing Sugar 12 gm. Black sesame seeds For garnishing Brown sugar 150 gm. Coconut For garnishing Vanilla essence 2 drops Method  Step 1 Blend cooked beans To prepare this dessert recipe, rinse the soaked kidney beans and add them to a medium pot. Pour enough water into the pot and boil over medium flame. Cook until the red beans are tender and when they are done, remove the pot from the burner and drain the excess water. Transfer the cooked beans in a blender jar and blend them to make a fine puree.  Step 2 Prepare the stuffing Transfer this beans puree to a saucepan and add brown sugar, vanilla syrup and cinnamon in it. Sprinkle a little salt and stir with a spatula to mix all the ingredients. Cook the beans puree over the medium flame while stirring occasionally. Let it simmer for 5-10 minutes and once done, keep it aside.  Step 3 Prepare the dough To prepare the dough, take a large bowl and add rice flour to it. Sprinkle salt and sugar in the bowl and gradually add boiled water to it. Knead a firm dough and when it is soft enough, put it aside.  Step 4 Keep the ingredients ready Now, take a small bowl and mix together green tea powder with a little sugar. Grind roasted black sesame seeds in a grinder and keep it in a separate bowl. Place the shredded coconut in a different bowl.  Step 5 Fold and make rice cakes To make the rice cakes, take a small portion of rice dough and roll it on a flat surface. Add a spoonful of bean paste in the centre and carefully fold the edges inwards. Gently press the edge of rice balls with your fingers and roll them into a ball.  Step 6 Cook them Take a large pot, add enough water and boil it over medium flame. When bubbles start to rise, gently drop rice cakes in the water. Ensure they don't stick to the bottom of the pot. When they raise to the top, transfer them to a bowl of cold water.  Step 7 Ready to be served Keep them in cold water for a minute or two. Then place them on a dry plate. When rice cakes are dry, place them one by one in topping bowls, and make sure they are nicely coated with coconut, sesame seeds and green tea powder. You can also add food coloring to give pretty colours to these basic rice cakes. Once done, your rice cakes are ready to be serving Korean rice cake Spicy Korean Beef and Cucumber Appetizer Name of dish Korean beef and Preparation time: Cooking time: cucumber appetizer 60 mins 25 mins Number of portions: 6 Size of unit: 1 Commodities: Items Quantity Items Quantity Beef strips boneless 500 gm. Red chilli sauce 12 ml. Cream cheese 125 gm. Vinegar 65 ml. Green onion 75 gm. Honey 10 gm. Cilantro leaves 30 gm. Garlic powder 2 gm. Soy sauce 5 ml. Kimchi 5 gm. Cucumber 18-20 slices Method  Combine cream cheese, green onion, cilantro and soy sauce in small bowl. Cover and refrigerate.  Combine vinegar, honey and garlic powder in medium bowl; set aside.  Place steak on grid over medium, ash-covered coals.  Grill, covered 11 to 14 minutes (over medium heat on preheated gas grill, covered, 11 to 15 minutes) for medium rare (145°F) to medium (160°F) doneness, turning occasionally. Remove steaks; keep warm.  To assemble, top each cucumber slice with 1 teaspoon cream cheese mixture. Dice steak into bite-size pieces.  Top cream cheese mixture with steak.  Garnish with micro greens, kimchi, peanuts, sesame seeds, cilantro and Spicy Korean beef and cucumber scallions, if desired. Korean fried rice Name of dish Korean fried rice Preparation time: Cooking time: 25 60 mins mins Number of portions: 6 Size of unit: 1 Commodities: Items Quantity Items Quantity Soy sauce 24 ml. Ginger 12 gm. Gouchujang 12 gm. Garlic cloves 3 Sesame oil 12 ml. Boiled rice 250 gm. Caster sugar 3 gm. Kimchi 90 gm. Eggs 4 Carrot (jillion cut) 125 gm. Peanut oil 15 ml. peas 80 gm. Bacon 100 gm. Green shallots 3 Onion 1 medium Method  Step 1 Combine the soy sauce, gochujang, 3 teaspoons sesame oil and sugar in a small bowl. Set aside. Whisk the eggs and remaining sesame oil in a separate bowl.  Step 2 Heat 2 teaspoons peanut oil in a wok over high. Add egg mixture. Scramble until just cooked. Transfer to a plate. Wipe wok clean.  Step 3 Heat the remaining peanut oil over high heat. Stir-fry bacon for 2 minutes or until golden and crisp. Add onion and stir-fry for 1-2 minutes or until softened. Stir in the ginger and garlic for 30 seconds or until aromatic. Add rice, kimchi, carrot, peas and snow peas. Stir-fry for 1 minute or until the vegetables are tender crisp. Add soy sauce mixture. Stir-fry for 1-2 minutes or until well combined and rice is hot.  Step 4 Korean fried rice Remove from heat and stir in egg. Sprinkle with shallots. Key points  Oriental food is derived from different regions of China, North & South Korea, Japan, Taiwan, Tibet and Mongolia. Oriental food is also called Asian food.  The three kingdoms of Korea, all have their own special and unique types of food dishes such as in second kingdom, most eat cold food is kimchi. Korean food is mostly oriented from Mongol. Korean food is mostly based on grains, meat, fish and vegetables.  There are basic 9 sauces of oriental cuisine which includes Light soy sauce, Dark soy sauce, Japanese soy sauce, Mushroom soy, Tamari, Keycap manis, Oyster sauce, Fish sauce, Hoisin sauce.  There are basic 8 oriental spices which includes Chili, cinnamon, ginger, coriander, cumin, curry leaves, saffron, turmeric",
  "History of continental cuisine": "Continental cuisine is defined as the food dishes which are prepared in continent of Europe. In this cuisine, French, Italian and Spanish parts of Europe included. Continental dishes are made from large amount of olive oil, wine, garlic and various herbs & spices. Cuisines are originated from geographic areas, religion, region and traditions. A cuisine is always influenced by local food ingredients and religion food laws. Continental cuisine is collectively referred to as the cuisines of Europe and other countries. Regions include in this cuisine are Russia, New Zeeland, Britain, Australia, Oceania and Latin America. These places may not have their own specialties or cuisines but are similar in the term of taste, ingredients, spices, flavorings, herbs and cooking methods. That is why continental cuisine is also referred to as International cuisine. Classification of continental cuisine • British • American • Italian • New Zealand Ingredients commonly used in continental cuisine are designed using these steps. • Less use of spices and less chilies Interesting information! • Use of fresh herbs • Dairy products as a major part of food Pies, pastries. Jam and bread are commonly consumed in Continental dishes includes breakfast at continental cuisine.  Yorkshire lamb patties  Chicken and cheese salad  Baked potato and aborigines  Peppered pasta salad  Roesti and salad  Paneer steak  Batter fried fish with cheese sauce  Rosemary chicken Steak with sauce- Continental dish  Grilled chicken in mustard sauce",
  "Regional specialties of continental cuisine": "Different regional specialties include i. British British food is related with the food culture of United Kingdom. British continental food is renowned with “full breakfast”. Ham, cheese, pastries, breads, pies, hamburger, teas, coffee, jam and bread are main items serve in breakfast. ii. American American cuisine is divided into different regions like Latin American cuisine, North American cuisine and South American cuisine. American has very rich style of cooking. Dishes includes in this cuisine are fajitas, jerky, Twinkies, key lime pie and tater tots etc. iii. Italian Italian cuisine has variety of dishes suitable for every occasion according to different regions. It’s different from region to region, that’s why it’s called richest cuisine of world. Dishes includes in this cuisine are caprese salad with pesto sauce, penzenella, bruschetta, focaccia bread, margherita pizza and mushroom risotto etc. iv. New Zealand: New Zealand cuisine is also called as oceanian cuisine and it is based on sea food. Dishes includes in this cuisine includes fish and chips, Maori hangi, kumara chips, cheerios and meat pies etc.",
  "Popular continental dishes around the world": "Continental dishes are made by using different cooking methods including stewing, grilling and roasting. These recipes are very low in calories and minimum use of fat. Continental food is mainly depending on high protein diet like eggs and meat. Seafood is high in omega 3 fatty acid and the main item in continental dishes. Popular continental dishes around the world are listed below. • Welsh cake • Black been pizza • Yorkshire pudding • Lobster continental • Tiramisu • Chocolate pudding with tropical • Sunday roast fruits • Kidney pie • Baked soled fillet • Pasta",
  "Basic continental spices": "Basic continental herbs & spices are listed below Chives Basil Cilantro Parsley Cayenne Cinnamon Bay leaves Clove Sage Red chilli powder Rosemary Star Anise Coriander Chervil Onion Garlic Ginger Mace Nutmeg Oregeno Paprika Black pepper Salt Turmeric",
  "Types and uses of continental sauces": "The five mother sauces are 1. Béchamel Sauce 2. Veloute sauce 3. Espagnole sauce 4. Hollandaise sauce 5. Tomato sauce These sauces are developed in the 19th century by the French chef Auguest Escoffier. These sauces are used as base in different dishes and other sauces for enhancing the taste of different types of dishes including vegetables, fish, meat, casseroles and pastas etc Do you know! Why is it called continental cuisine? Continental food is the food which is eaten in the European Countries but only in the Continental Parts of Europe that's why this cuisine is specifically called the\"Continental Cuisine\".",
  "Five mother sauces": "Five mother sauces are the basis of all classical sauces. In the culinary arts, the term s“mother sauces” refers to any one of five basic sauces, which are the starting level for making various secondary sauces or “small sauces”. They are all called mother sauces because each one is like the head of its own unique family. These are the base for all other sauces. The five mother sauces are 1. Bechamel sauce 4. Hollandaise sauce 2. Veloute sauce 5. Tomato sauce 3. Brown / espagnole sauce",
  "Ingredients of continental sauces": "As you know, the main element of any sauce is its stability, dripping and pouring consistency. The sauce is accomplished in 3 steps roux, emulsifier and reduction. Four out of five mother sauces are made with roux. Roux is basically the fancy name of equal amount of butter and flour. Ingredients for béchamel sauce • Butter • Flour • Milk Ingredients for veloute sauce • Butter • Flour • Stock Ingredients for Espagnola sauce • Butter • Flour • Tomatoes Ingredients for hollandaise sauce • Butter • Mustard • Egg yolk • Salt • Lemon juice • Cayenne powder Ingredients for tomato sauce • Tomato • Spices • Herbs Important Note! The cooking methods which are used in the continental cuisine are Baking Grilling Frying Stewing",
  "Preparation & storing of Continental sauces": "Béchamel Sauce Name of dish Béchamel sauce Preparation time: Cooking time: 10 15 mins mins Number of portions: 6 Size of unit: 1 Commodities: Items Quantity Items Quantity Butter 60 gm. Parmesan cheese 75 gm. Flour 85 gm. Salt As per required Milk 1 liter Nutmeg 1 pinch Method • Melt the butter on medium to high heat until foaming. • Add flour into it keep stirring for 2 - 3 minutes until bubbling. • Turn off the heat • Add milk gradually and wish it continuously until it turns smooth. • Then turn on the heat and cook and stir it with a spoon for 10 to 15 minutes until it starts boiling. • Cook it until it turns into a thick saucy texture • Add Parmesan cheese, salt and nutmeg into it Consistency of béchamel sauce Veloute Sauce Name of dish Veloute sauce Preparation time: Cooking time: 15 15mins mins Number of portions: 6 Size of unit: 1 Commodities: Items Quantity Items Quantity Butter 12 gm. Salt As per required Flour 12 gm. Black pepper 2 gm. Chicken stock 400 ml. Method • Melt the butter on a sauce pan on low flame. • Add flour into it and cook for 3 - 5 minutes keep stirring with a whisk • Now add chicken stock gradually • Stirring with a whisk until it turns into a smooth mixture and bring it to simmer. • Keep it on simmering for 10 - 15 minutes until it turns into a thick saucy texture then add salt and black pepper into it. Pouring consistency of veloute sauce Espagnole Sauce: Name of dish Espagnole sauce Preparation time: Cooking time: 15mins 15mins Number of portions: 6 Size of unit: 1 Commodities: Items Quantity Items Quantity Carrot (chopped) 1 Beef stock 1 liter Onion 1 medium (chopped) Tomato puree 60 gm. Garlic (chopped) 8 gm. Celery stick (chopped) 1 Butter 75 gm. Black peppercons 2 gm. Flour 62 gm. Bay leaves 1 Method • Melt the butter • Add carrot and onion into it • Stir it until golden brown • Add flour into it and cook it on medium heat Stir it constantly to prevent lumps • Add tomato puree into it • Add garlic, celery, peppercorns and • bay leaf into it and bring it to boil, stirring • it continuously. • Cook it until it reduced to about 3 cups and it turns into a saucy texture and Stain it. Hollandaise Sauce Name of dish Hollandaise sauce Preparation time: Cooking time: 20 15mins mins Number of portions: 6 Size of unit: 1 Commodities: Items Quantity Items Quantity Butter 125 gm. Dijon 8 gm. Egg yolk 3 Salt As per required Lemon juice 12 ml. Cayenne powder 1 pinch Method  Melt the butter  Take a blender add egg yolks, lemon juice, Dijon, salt, cayenne powder into it and blend it.  Now add melted butter into it and blend it to 5 _7 minutes  Pour it into a bowl and use it Tomato sauce Name of dish Tomato sauce Preparation time: Cooking time: 15mins 20mins Number of portions: 6 Size of unit: 1 Commodities: Items Quantity Specifications Extra virgin oil 20 ml. Basil 5 gm. Onion (chopped) 125 gm. Tomato 1 kg Carrot (chopped) 1 Tomato paste 4 gm. Stalk celery 1 Salt As per taste Parsley 10 gm. Black pepper As per taste Garlic clove 1 Method • Heat the olive oil. • Add onion, carrot, celery and parsley into it and stir it • Cook it on low flame for 10-15 minutes stir it until the vegetables are softened • Add garlic into it and cook for 10 seconds • Add the tomatoes into it and cook for 5 minutes • Add tomato paste and basil into it • Add salt and black pepper into it • Bring it to low simmer, reduce the flame on low, and cook it until a saucy texture. Blend it to give a smooth consistency.",
  "Staple foods": "As you know, staple food is a food which is consumed in large quantity on daily basis according to individual’s diets. It supplies the major portion of energy to the body on daily basis. The basic staple foods includes in continental cuisine are listed below ",
  "Production & processing of staple food": "The main continental dishes which are served in British breakfast are  Butter and bread  English muffins French toast  Egg Benedictine  Espresso tea  Fruit juices  Poached eggs  Croissants Some major staple foods which should be in any continental are Tea Coffee Herbs Shrimp Crackers Vegetable oil Canned Beans Bread Lemon juice Bouillon Cubes Flour Dairy Bread Crumbs Garlic Mustard Chicken stock Grains Nuts Olive oil Butter Sugar Onion Rice yogurt Parmesan Potatoes Tomato paste Pasta Vinegar Canned tomatoes Following are the three main procedures for Food processing and production 1. The preservation of foods by a. refrigeration b.Canning c. irradiation d. pasteurization e. Freezing f. addition of different preservatives g. preservation in salt or sugar h. baking food in oven to dry it out i. Blanching j. Freezing And with the help of some traditional methods such as a. salting b.smoking c. drying d.fermentation 2. The development of protein - rich foods 3. Food additives Do you know? The major staple foods are grains. Corn, rice and wheat together make up 51% of the world's caloric intake. Recipes Continental food refers to dishes made and consumed in the European countries. Dishes of French, Spanish and Italian cuisine fall under the category of 'Continental food'. The key specialty of this food is, they concentrate more on ingredients like olive oil, wine, herbs and minimal spices. The recipes include in continental cuisine are listed below. Name of dish Caesar salad Preparation time: Cooking time: 20 mins 20mins Number of portions: 6 Size of unit: 1 Commodities: Items Quantity Items Quantity Paprika powder 2 gm. Garlic crushed 2 Driede parsley 2 gm. Lemon juice 10 ml. Salt As per taste Chicken fillet 500 gm Black pepper As per taste Olive oil 12 ml. Mustard paste 8 gm. Dressing: Yogurt 125 gm. Black olive 2 gm. Mustard paste 5 gm. Parmesan cheese 4 gm. Lemon juice 5 ml. Salt As per required Black pepper As per taste Olive oil 18 ml. Garlic crushed 4 gm. Method • In bowl, add paprika powder, salt, black pepper, mustard powder, garlic and lemon juice and mix well. • Marinade chicken fillet for 30 mins in mixture • Greese grill with olive oil and grill marinated chicken until tender • Cut chicken fillet in slices • For dressing, combine yogurt, mustard paste, lemon juice, black pepper, olives, cheese, salt and olive oil. • Whisk well • In bowl, add ice bergs, salad dressing, bread cubes and chicken. • Mix well and serve. Alfredo pasta Name of dish Alfredo pasta Preparation time: Cooking time: 30 20 mins mins Number of 6 Size of unit: 1 portions: Commodities: Items Quantity Items Quantity Butter 250 gm. Garlic crush 8 gm. Cream 20 ml. Parmesan cheese 125 gm. Salt As per required Fettuccini pasta 300 gm. Black pepper As per required Method • Add water in a pot and bring it to boil • Add salt in it and then fettuccini pasta in it. • Cook for 10 mins and then drain the water • In a saucepan, heat cream with butter on medium heat. • Add salt, pepper and garlic in it • Add cheese and stir until thick sauce produce • Add pasta into sauce and serve hot. Stuffed chicken Name of dish Stuffed chicken Preparation time: Cooking time: 30 mins 30mins Number of 4 Size of unit: 1 Portions: Commodities: Items Quantity Items Quantity Breast fillet 500 gm. Cheddar cheese 125 gm. Salt As per required Cooking oil 15 ml. Black pepper As per required Butter 10 gm. Dried parsley 5 gm. Garlic chopped 10 gm. Garlic paste 5 gm. Mustard paste 10 gm. Olive oil 10 ml. Cream 60 ml. Fresh parsley 5 gm. Milk 125 gm. Method • Wash and dry chicken and set aside in a bowl, add spices. • Add chicken fillet and mix well. • Cut the chicken fillet and stuffed with parsley and cheese in it • Close the pocket with toothpick • Fry the chicken in pan on both sides till tender. • Add butter and garlic in frying pan. • Add spices, cream and cheese. • Lastly add chicken in it. Spanish churros Name of dish Spanish churros Preparation time: Cooking time: 15 30 mins mins Number of portions: 4 Size of unit: 1 Commodities: Items Quantity Items Quantity Water 250 ml. Egg 1 Butter 56 gm. Vanilla essence 2 gm. Sugar 13 gm. Oil For frying Salt 1 pinch Granulated sugar For coating Flour 140 gm. Cinnamon For coating Method  For the coating whisk together 1/2 cup sugar and cinnamon in a shallow dish, set aside.  Heat about 1 1/2 inches vegetable oil in a large pot or deep skillet over medium-high heat to 360 degrees Fahrenheit. While oil is heating prepare batter.  Add water, butter, sugar and salt to a large saucepan, bring to a boil over medium-high heat.  Add flour reduce heat to medium-low and cook and stir constantly with a rubber spatula until mixture comes together and is smooth (a few lumps in it are fine).  Transfer mixture to a large mixing bowl, let cool 5 minutes.  Add vanilla and egg to flour mixture then blend immediately with an electric mixer. Blend until mixture comes together and is smooth (it will separate at first but keep mixing it will come together).  Transfer to a 16-inch piping bag fitted with a rounded star tip.  Carefully pipe mixture into preheated oil, into about 6-inch lengths, cut end with clean scissors.  Let fry until golden brown, about 2 minutes per side. Transfer to paper towels to dry briefly then transfer to cinnamon sugar mixture and roll to coat.  Repeat process with remaining dough (frying no more than 5 at once). Serve warm with chocolate ganache or caramel sauce for dipping if desired. Spanish churros Tiramisu Name of dish Tiramisu Preparation time: Setting time: 30 mins 3 hrs Number of portions: 4 Size of unit: 1 Commodities: Items Quantity Items Quantity Coffee 20 gm. Sugar 65 gm. Lady fingers 40 Cream cheese 25 gm. Water 250 ml. Whip cream 500 gm. Egg yolk 6 Coco powder 15 gm. Method • In a bowl, stir together 1 1/2 cups espresso. Quickly dip half of the ladyfingers, one at a time and arrange in a single layer in the bottom of a 9x13 casserole dish. Dip once on each side so they are moist but do not soak ladyfingers or the cake will collapse. • In a separate rimmed medium glass bowl, whisk together yolks and sugar. Place over steam (on a saucepan with simmering water) and whisk 10 minutes on low heat until the mixture is lighter in color, slightly thickened and not grainy when you rub between your fingers. Remove from heat and let cool slightly • Beat together cream cheese. Use an electric hand mixer to beat in the warm yolk mixture until well incorporated. • In a separate bowl, beat cold heavy whipping cream until stiff peaks form (about 3-4 minutes). • Use a spatula to gently fold half of the whipped cream into mascarpone cream then blend in remaining whipped cream, just until incorporated. • Do not over fold or it will become grainy. • Spread half of the cream over the first layer of ladyfingers. • Dip and arrange remaining ladyfingers. Spread remaining cream. • Refrigerate overnight. Dust with cocoa powder before serving. It is ok to dust with cocoa ahead of time - it will just darken it in color from the moisture. Tiramisu Mashed potatoes Name of dish Mashed potatoes Preparation time: Cooking time: 15 mins 20 mins Number of portions: 4 Size of unit: 1 Commodities: Items Quantity Items Quantity Potato 500 gm. Salt As per required Hot milk 300 ml. Parsley For garnish Butter 250 gm. Method • Wash and peel potatoes • Bring it to boil and cook for 15-20 mins • Drain water and mix well with mixer • Slowly add milk in it • Then add butter and spices in it • Garnish with parsley and serve. Key points  Continental cuisine is collectively referring to the cuisines of Europe and other countries (French, Italian, Russian, New Zeeland and Spanish). In this cuisine, continental dishes are made from large amount of olive oil, wine, garlic and various herbs & spices.  Continental dishes are made by using different cooking methods including stewing, grilling and roasting. These recipes are very low in calories and minimum use of fat. Continental food is mainly depending on high protein diet like eggs and meat.  There are 5 mother sauces of continental cuisine  Béchamel Sauce  Volute sauce  Espanola sauce  Hollandaise sauce  Tomato sauce  Staple food is a food which is consumed in large quantity on daily basis according to their diets. It supplies the major portion of energy to the body on daily basis.",
  "Baking Products": "Baking is a dry heat cooking method in which food is cooked at specific temperature and specific time with the help of hot air (convection). There are different types of baking products which are listed below. I. Cakes and Sponge products II. Biscuit’s products III. Pastry products IV. Dough products Nan khtai chocolate muffinsbiscuits products Dough product Cake product",
  "Categories of baked products and its use": "1. Bread & Dough Products Bread and dough products are made of flour and water kneaded together and sometimes fermented with yeast. Yeast goods are baked and consumed all over world. Yeast products can be sweet or savory and eaten as a part of each meal. Doughnuts – dough products Products Uses Fermented breads such as sandwich bread, Breads are used in breakfast meal. milky bread etc Unfermented breads such as roti, poori, paratha Unfermented breads are used in daily lunch and etc dinner along with main dish. Enriched products like fruit buns, doughnuts Buns and doughnuts use as snacks with tea. etc. 2. Cakes & Pastries Cakes and sponge products are extremely important as morning tea, afternoon tea and desserts items. Cakes are mostly baked at traditional events. Cakes are based on creaming method. Cakes products include fruit cake, Madeira cake, muffins, cupcakes and marble cake. Sponge products include chocolate fudge cake, red velvet cake, pineapple cake and Swiss roll etc. Cake and sponge products are the major part of birthday parties, weddings, receptions, anniversaries etc. Do you know! Muffins are larger in size then cupcakes. Muffins are without frosting and cupcakes are always decorated with frostings. Cake Eclairs Interesting Information! Biscuits have crunchy and crispy texture. Cookies have soft from inside and crisp from outside. 3. Biscuits and cookies Biscuits and cookies are made with creaming method. These are mostly used in morning breakfast, afternoon teas and snacks. Biscuits and cookies are mostly served with tea or coffee.",
  "Process to prepare baked products": "Standard processes to prepare baked products are: • Mis en place – collection of ingredients & utensils according to recipe. • Weighing of ingredients- weight ingredients according to recipe. • Beating- mixing of ingredients with food mixture. • Whisking- mixing with hand whisk. • Kneading- mixing of bread and dough with hands or kneader. • Folding- mixing of batter with flour into clockwise with spatula. • Greasing- apply fat in baking mould. • Lining – arrange butter paper in mould. • Baking- bake in oven with specific temperature & times. Mixing of ingredients",
  "Baking Techniques": "Baking is a dry heat cooking method used to bake Do you know? product in an oven at specific time and 1 pound of cake is equals to 450 gm. temperature. The basic techniques or procedure for baking includes mis en place, weighing, mixing, beating etc, as learned in",
  ". Baking has basic 4 commodities flour, fat, sugar and eggs. While baking": "a cake follow these methods  Accuracy in weighing  Execution of the product  Pre heating of oven  Sifting of flour and other dry ingredients  Baking at correct temperature  Storage of product at correct temperature. Measuring ingredients of baking `",
  "Baked products storage method and temperature": "Baking products consists of various products like sponge and cake products, biscuits products, pastry products, dough products and desserts. Each product requires a specific temperature for storing as shown in table below: Baking Products Storage temperatures and methods Cream cakes Stored in refrigerator at 1˚C to 5˚C for 3 days Fresh dry cakes Stored in airtight container at 5˚C Bread and other dough products Stored in airtight packing at 3˚C to 5˚C for 3 days Pastry products Stored at 4˚C for 24 hrs Frozen desserts Stored in freezer at -10˚C",
  "Finishing, garnishing and presentation of different baked products": "Finishing methods are the methods which convert the baked product into its final serving look by adding colors, textures and designs. Finishing methods of cakes, pastries and other baking products includes: Piping with sauces and creams Glazing with syrup Spreading of icing, chocolate and cream Garnishing such as motif, run outs Finishing method- Piping, Garnish Recipes Vanilla sponge Name of dish Vanilla sponge Preparation time: Baking time: 15 mins 25-30 mins Number of portions: 4 Size of unit: 1 Commodities Items Quantity Items Quantity Eggs 4 Flour 100 gm. Icing sugar 100 gm. Vanilla essence 2 ml. Method • Preheat the oven at 180 oC for 15 mins. • Prepare the cake pan with butter paper and oil. • Start by creaming of sugar and eggs together with beater. • Beat till fluffy and airy. • Sift the flour. • Fold flour into batter, add vanilla essence in it. • Bake at 180 oC for 20 mins. Vanilla sponge Chocolate cupcakes Name of dish Chocolate cupcakes Preparation time: Baking time: 15 mins 25-30 mins Number of portions: 6 Size of unit: 1 Commodities: Items Quantity Items Quantity Flour 95 gm. Icing sugar 100 gm. Coco powder 41 gm. Oil 80 ml. Baking soda 2 gm. Butter milk 120 ml. Baking powder 2 gm. Whip cream 200 ml. Egg 2 Method • Preheat the oven at 180 C for 15 mins • Sift the dry ingredients • Beat eggs and icing sugar together • Fold dry ingredients in it • Lastly add oil in it • Pour in cupcake mould and bake for 25-30 mins. • Cool the cupcakes. • Whip cream and frosting on cupcakes. Chocolate chip cookies: Name of dish Chocolate chip Preparation time: Baking time: cookies 15 mins 25-30 mins Number of portions: 6 Size of unit: 1 Commodities: Items Quantity Items Quantity Sugar 100 gm. Vanilla essence 2 ml. Brown sugar 165 gm. Baking soda 2 gm. Salt 2 gm. Chocolate chip 110 gm. Butter 115 gm. Dark chocolate chunks 110 gm. Egg 1 Method • In a large bowl, whisk together the sugars, salt, and butter until a paste forms with no lumps. • Whisk in the egg and vanilla, beating until light ribbons fall off the whisk and remain for a short while before falling back into the mixture. • Sift in the flour and baking soda, then fold the mixture with a spatula • Fold in the chocolate chunks, then chill the dough for at least 30 minutes. For a more intense toffee-like flavor and deeper color, chill the dough overnight. The longer the dough rests, the more complex its flavor will be. • Preheat oven to 180°). Line a baking sheet with parchment paper. • Scoop the dough with an ice-cream scoop onto a parchment paper-lined baking sheet, leaving at least 4 inches (10 cm) of space between cookies and 2 inches (5 cm)of space from the edges of the pan so that the cookies can spread evenly. • Bake for 12-15 minutes, or until the edges have started to barely brown Chocolate chip cookies Tea cake: Name of dish Tea cake Preparation time: Baking time: 15 mins 25-30 mins Number of portions: 6 Size of unit: 1 Commodities: Items Quantity Items Quantity Butter 200 gm. Baking powder 2 gm. Flour 200 gm. Vanilla essence 2 ml. Icing sugar 200 gm. Egg 2 Method • Beat butter and sugar together • Add egg one by one and beat well • Add vanilla essence in it • Sift dry ingredients and fold them into batter • Pour the batter into greased loaf pan • Bake in pre heat oven at 180˚C for 30 mins. Key Points  Baking is dry heat cooking method in which food is cooked at specific temperature and time with the help of hot air (convection).  Bread and dough products are made of flour and water kneaded together and sometimes fermented with yeast. Yeast goods are baked and consume all over world.  Cakes and sponge products are mostly used as morning tea, afternoon tea and desserts items. Cakes are mostly baked at traditional events. Cakes are based on creaming method.  Standard process for baking products includes weighting, mixing, beating, folding, sifting, greasing and lining etc.",
  "Importance of Nutrition": "Nutrition is derived from “Nutrients”. It’s the science of nourishing the human body properly. It is how food affects the body health. Food contains micronutrients like protein, carbohydrates and fat, which provide energy to body. If we do not eat enough nutrients or right balance of nutrients, then it will cause health problems. Nutrition is very important for a healthy body as it’s refers to healthy diet. A healthy diet throughout life promotes healthy results, support normal growth, development and aging, help in maintaining normal body weight and reduce the risk of chronic diseases.",
  "Principles and importance of nutrition": "Nutrition is the process of intake and utilization of food substances. These processes include ingestion, digestion, absorption, transportation and metabolism of nutrients found in the body. There are 5 principles of nutrition which can improve quality of life i Add more intake of water ii Add more fruits and vegetables in diet iii Add more fiber in diet iv Always take less amount of sugar and salt v Take less amount of processed foods Food pyramid- balanced healthy diet",
  "Types of nutrients": "There are six basic nutrients that body needs i Carbohydrates ii Protein iii Fat iv Vitamins v Minerals vi. Water",
  "Nutrition and age groups": "Nutritional requirements must be different for different age groups. The population classified as 4 different groups Interesting Information! 1. Infant and preschool 2. Adolescence and childhood Human body contains 60-70% water in body. 3. Pregnancy and lactation 4. Old age",
  "Nutritional requirements for various age groups": "1. Pregnancy and lactating mothers: Men require about 2900 Kcal per day, while women need 2200 Kcal per day. The major factor behind this accounting for the different energy needs of men and women is body size and composition. A pregnant and lactating woman must need energy not only for herself, but also for unborn or breastfeeding child. It is estimated that women lose 3 to 5 % of their bone mass during pregnancy that’s why she needs more amount of calcium during this time period. Iron is much important for woman then a man, men need 8 mg per day but women need 18 mg per day during childbearing age. 2.Infant and Pre-school Growth is rapid during pregnancy. Child doubles its birth weight during first 6 months and triples at the end of year. To grow properly child must need adequate amounts of energy, protein, vitamins and minerals. Age (months) Energy requirements 0-3 120 Kcal 3-6 115 Kcal 6-9 110 Kcal 9-12 105 Kcal Average 112 Kcal Energy requirements during first year of age 2. Adolescence and Childhood The childhood is defined as the years between 3 and 11. It is the rapid physical growth and development age that’s why child needs healthy and balanced nutrition. Child gain 4 to 7 pounds and 1 to 4 inches per year. The balanced amount of fat, protein, carbohydrates, minerals and water are required for the balance growth of child. Lunch box with balanced nutrients 3. Old age In old age metabolism slows down and decline as 30 % of lifetime. That’s why old people lead to chronic fatigue, depression and weakened immune system. In old age about 1600 Kcal are required per day. More milk and protein products and enhance iron and calcium intake during this lifespan. Do you know! Do you know! Osteoporosis is a common calcium 1 cup of tea contains 50mg caffeine. deficiency disease present in old age. 1 cup instant coffee contains 75mg caffeine.",
  "Nutritional effects on different age groups": "Food pyramid- Food portions need for different age groups",
  "Dietary Guidelines": "Dietary guidelines are guidelines that help to choose diet that will meet nutritional requirements, promote health, support healthy lives and reduce chronic diseases. The main steps include in dietary guidelines are:  Eat variety of foods  Moderate fat diet that is low in saturated fat  Energy intake and physical",
  "Significance of dietary guideline": "Dietary guidelines are set of advisory statements providing good dietary practices to promote overall nutritional well-being. They also control diet related diseases in general public. As you learn in",
  ", if we follow these guidelines then we can control diseases like hypertension, diabetes,": "obesity and other chronic diseases. The basic significances of dietary guidelines provide advices on what to eat and drink to nutrients needs, promote health and prevent diseases. It is developed and written for the professional audience, including policy makers, health care providers, nutritional educators, and federal nutritional program operators. Dietary guidelines",
  "Dietary guidelines approved by health authorities": "Dietary guidelines are the basic few points or statements which are approved by health authorities include:  Eat variety of foods  Moderate fat diet that is low in saturated fat  Energy intake and physical",
  "Introduction to Food & Beverage services": "Food and beverage services are defined as the process of preparation, presenting and service of the food & beverages to the customers. The customer visits the premises to avail these services. The premises should be well equipped and well-furnished to attract customers to avail F & B services.",
  "Services concept": "The basic concept of food service in any food industry is related to make, transport, or sell the cooked and prepared food to the decided destination like restaurant, hospitals, school, hostels, cafeteria etc. It is a process in which the food and beverages are prepared, present and serve to the customers who are in or far away from their homes. There are two major types of Catering. Important note! 1. On Premises Catering (Indoor Catering Service) In British language Food 2. Off premises catering (Outdoor catering services) Services are known as the \"Catering Services\". On premises catering services are the services in which food prepared and served at the same place. No transportation takes place. In this type of service food is placed in one dining hall. An international level 3 dining halls are present • VIPs / Elite class /high class • Normal or A class • Budgeted or economy class In off premises catering services 60% food preparation take place on the chef's place and 40% on the venue for which the food is ordered. Some other types of Catering services are : • Party Food Catering • Hot Buffet Catering • Full Service Catering • Transport Catering • Airline Catering • Railway Catering Outdoor catering services • Ship Catering etc Concept of Catering Catering Service are based on 2 basic concepts 1. Commercial Catering 2. Non commercial catering Commercial catering Commercial Catering is the catering which takes place for the sack of money and for the business point of view. Commercial catering service Non-Commercial Catering Noncommercial catering is the catering which is just for the welfare of the people that's why noncommercial catering is also known as the \"Welfare Catering”. Noncommercial catering is free of cost for the labors. For example: Edhi House, Behria dastar khuwaan etc.",
  "Relation between cooking & services": "Relationship between cooking and service are very important because if you are professional and work in a food industry then you understand the importance of services which you are providing to your customers. When you are working in kitchen and making food for your customer you have to make sure that the services which you are providing are according to the nature of the dish. If you are making hot food for your customers, make sure to serve in hot platters according to true temperatures. For examples sizzling brownies, Alfredo pasta with chicken steaks and BBQ. Cold food should be served in cold platters.",
  "Significance of professional service skills": "In the Food service skills, a wide range of skills is involved such as knowledge of supplies, ability to follow routine instructions, ability to follow safety procedures and safe use of cleaning equipment and supplies. In food services food preparation, customer services, and hotel or restaurant management are included. All the staff members like cooks, servers, bartenders and hosts are all positions that use food service skills. Some important professional service skills are • Empathy • Take responsibility • Clear communication skills • Work ethics • Adaptability • Patience • Self-control • Ability to use positive language Food services skills improvement Food service skills can be improved by these ways. 1) Work as a host Learn how to engage your guests with the help of your communication skills as you greet them, take reservations, seat them, and answer them about their queries. 2) Become a server Server is a person who can manage food orders, serve their customers, and work with a team. A team of cooks, hosts and other servers make sure that guests have a good and memorable dining experience. 3) Work in the kitchen When you are a chef or a cook you can't see your guests. Cooks and those who are involved in food preparation gain many valuable skills for working in the busy environment. Manage cooking time for multiple dishes which all are served at once. Earn Certificates Gaining certificates as a food service employee will add your knowledge and it will increase your professional skills and abilities.",
  "Food services operations": "Food and Beverages services operation is a cycle involving multiple activities which engage the staff from purchasing raw material, preparing food, keeping inventory, maintaining service quality etc. Food & beverage operations Types of Food Service Operations There are two different categories of food service operations are there. I. Commercial Food Service. II. Noncommercial food service The purpose of commercial food service operation is production and selling food and beverages. Commercial establishment includes full-service restaurants, catering, nightclubs, fast food etc. All of these are focused primarily on providing food and earning profit. Non Commercial Food Service exists inside of the organization such as hospitals, school, nursing homes, military bases and offices etc. There are many different types of food and beverage services. Major categories are:  Plate Service  Cart Service  Platter service  Buffet Service  Family Style Service Buffet Services",
  "Types of dining services": "Dining services are all services related to direct dining operations. It is a set of plates & dishes in which food is eaten and served. The major dining services are:  Informal silver services  Formal silver services  Russian services  English services  French services  American services",
  "Types of F & B services": "There are 3 types of services which are under the F&B services. i Food and beverage production ii Food and beverage services iii Stewarding 1. Russian table services This service is a little bit close to the French service. In this service the food is sent out of the kitchen piping hot when the time is right for it, and offered to diners by waiters, serving from a diner's left side. The servers dish up the desired portion on the guest's plate using a large spoon and fork. In Russian service a server uses the spoon to serve vegetables and other items as per guidance. 2. English table services English Service is also called the \"Silver Service”. In this service first we greet the guests. Food is in bulk and the food is placed in the center of the table. All the duties are done by the waiter. This service is little bit same like the French and Russian services This service is also known as the\" Silver Service\" because it is a great way of bringing everyone together. 3. French table services French service is also called \"Royal Service\". In French language it is known as \"Greedone Service\". In French service we give personal attachments to our guests. In this service we give a proper protocol to the guests. We greet the guests Give a welcome drink to the guest, arrange the setup areas for the guests. Waiter stands along side and he gives everything which customer wants from table. Then one person come with a trolley on which order is placed. First person who serves the food to plate. 4. American table service American Service is also called \"Plate Service\". In this Do you know! service plate is basically called a \"platter\". In this French Service is the slower as service no extra protocol is given to the guests. This well as the expensive service as compare to other services. service is not so expensive and this service is fast than the French service 5. Informal silver services Home delivery service is very common now a days. In this service food is delivered on the door steps of the customers. Terms and conditions are applied on this condition. 6. Formal silver services Buffet service is also known as \"Self Service\". In this service variety of ready food dishes are displayed according to the sequence of the table either hot or cold. In buffet service trolley is used to take dirty crockery and utensils to the stewarding area. There are many different types of buffet Service  Breakfast Buffet  Lunch Buffet  Dinner Buffet  Salad Buffet  Brunch Buffet  Festival Buffet",
  "Service style": "There are different types of services styles 1. French service 2. American service 3. English service 4. Russian service 5. Buffet 6. Self service These services are described in previous topic",
  "Usage of cutlery and crockery in table services": "Cutlery any hand implement used in preparing, serving and especially eating food. A customer first reaction on entering in a hotel or restaurant is ambience. The creation of ambience by the right choice depends on décor, layout and use of cutlery and crockery. These items should be clearly chosen by color, design and shape. This will be determined by factors such as • Type of client expected • Location • Layout of F & B service area • Types of services offered A wide range of crockery and cutlery items are available in figure. As a guide the sizes are as follow. • Side plates 15cm • Sweet plate 18 cm • Fish plate 20 cm Different crockery sizes Different crockery designs Different sizes of cutlery",
  "Table layouts": "A table layout is defined as a raw data of rows and columns in source location. The good table layout should focus on the following points. • Circulation and moment • Connectivity between front of house and back of house • Comfortable for customers and staff • Optimum utilization of space • Safety",
  "Layouts of dining table": "Basic layout for dining table includes Informal dining layout Formal dining layout Dual purpose dining layout",
  "Group services etiquettes with respect to age & gender": "Before the meal begin, these etiquettes are most important to follow • Be on time. • Dress accordingly. • Never comb your hair and apply makeup on table. • Wash your hands before eating meal. • Wait for host to tell you where to sit. • Show respect to elders by letting them go ahead. • You should be polite to all the persons on tale. During the meal, these etiquettes are important to follow. • Place your napkin on your lap. • Never insert napkin under your chin. • Sit up straight with feet should be on floor. • Keep elbows off to the table. • Wait until everyone is served. • Use courtesy words like “please” and “thank you” when asked for food to be passed. • Use the serving utensils properly. • Chew your food with lips closed. • After the use of fork and knife, keep them on the plate not on table. • After eating your meal, place your napkin to the side of the place on the table.",
  "Holding, carrying and loading the service trays": "Your hands should be flat and your fingers should be spread out with only the tips of your fingers. Hands are raised to support the base of the tray. Trays are carried on the palm of left hands with the tips of the fingers slightly raised. Servings trays are very important functional items usually use to carry plates of food and dishes. This is reason why they must be able to deal with relatively heavy weight. Do you know! Proper techniques of holding and carrying a heavy tray can reduce the amount of strain on a server’s joints and muscles. Key points  Food and beverage services are defined as the process of preparation, presenting and service of the food & beverages to the customers. The customer visits the premises to avail these services.  There are two major types of Catering, On Premises Catering (Indoor Catering Service) and off premises catering (Outdoor catering services).  In the Food service skills a wide range of skills is involved such as knowledge of supplies, ability to follow routine instructions, ability to follow safety procedures and safe use of cleaning equipment and supplies.  Food and Beverages services operation is a cycle involving multiple activities which engage the staff from purchasing raw material, preparing food, keeping inventory, maintaining service quality etc.  Dining services are all services related to direct dining operations. It is a set of plates & dishes in which food is eaten and served.  Crockery and cutlery are used in service of food as well for the consumption of food.",
  "Glossary": {
    "A la carte": "Menu dishes individually ordered",
    "Calorie": "A measure of energy derived from and priced. food. AL dente - It is an Italian term means \"to the",
    "Carpretto": "Italian word mean \"kid\" the meat tooth\" it is a cooking terminology for cooked from a young goat. pasta or other food items with a bit of bite, but Danger",
    "Zone": "the temperature between 5°C not a hard center. and 60°C in which bacteria multiply rapidly.",
    "Allspice": "it is a combination of different",
    "Darne": "A fish cutlet sliced through the bone spices such as cloves, cinnamon, nutmug, of a round fish. black pepper, bay leaves etc. Debris the leftover 9f the food that is not Agr agr - it is an alternative to gelatin for shown or served to the customers. vegetarians. Deep frying a cooking method in which food",
    "Abrasive": "Any material which can be used is submerging in hot fat on 140°C to 190°C. for grinding or polishing.",
    "Degreasing": "removing the fat from stock and",
    "Bacteria": "a single celled microorganism sauces. which cause changes in food. E.",
    "Coli": "a type of bacteria that can lead to",
    "Bain": "",
    "Marie": "a water bath like container severe bacteria. which keep the food hot and fresh.",
    "Eclairs": "length of choux pastry (612 cm)",
    "Baking": "it is a dry heat cooking method used baked. in bakery.",
    "Economical": "A term describe the Balsamic",
    "Vinegar": "it is a Italian vinegar that profitability of any item. enhance the aroma and flavors in different salads. Egg wash - beaten eggs used for crumbling. Besan",
    "Flour": "made from chickpeas, used in",
    "Elastin": "yellow connective tissue that has to making Fritters (Pakora). be minced or chopped for eating.",
    "Cabernet": "A variety of grape which is used Farinaceous dishes - menu items containing in making wine with smooth overtones. starch, such as rice, pasta and gnocchi. Café de",
    "Paris": "a compound butter made with",
    "Feathering": "mixing two or more sauces for spirits, herbs, curry and spices. presentations.",
    "Calcium": "Essential mineral which is Fennel vegetable variety with an aniseed important for bone structure and teeth. flavor.",
    "Fenugreek": "a spice with a strong curry-like Icing a mixture of icing sugar with the aroma and flavor. addition of moisture, lemon juice, egg white, sour cream etc.",
    "Fermentation": "the conversion of sugars and other carbohydrates into alcohol, acids, and",
    "Invertebrates": "animals without a spine. carbon dioxide for production of beer, wine",
    "Implements": "tools used to assist your work, and bread. such as knife, cutting boards etc.",
    "Ganache": "A mixture of hot cream and melted",
    "Jalousie": "a French term meaning blind and chocolate. shutter, a puff- pastry slice with a topping of Garlic",
    "Butter": "a compound butter with the pastry. addition of garlic. Jam a preserved mixture of fruits and sugar. Garnish trimmings add onto a dish to Jarish crushed wheat and yogurt casserole. enhance its taste and eye appeal. Jasmine rice a type of long grain Gelatine a setting agent made from animal rice skins and bones. Jell to congeal a substance. GIGO - Garbage In Garbage Out",
    "Gratinate": "to place food item under a salamander to",
    "Kumara": "red sweet potato with a pinkish brown on the top. orange flesh. HACCP - (Hazard analysis and critical",
    "Ketchup": "a thick sweet and spicy sauce. control points) a system to minimizing the food poisoning. Key lime - a Tart, golf ball size yellow and green citrus fruit. Hache finely chopped e.g. parsley, mince or corriender.",
    "Kahlua": "a coffee liqueur used for desserts. Harissa Hot, spicy Moroccan sauce made Kinilaw",
    "Cuisine": "a true Philippine cuisine. from fresh chilli, coriander (seed and fresh)",
    "Lacto": "vegetarian Vegetarian diet mint, caraway seed and garlic. which includes dairy but not eggs. Harmonic flavors - flavors that leave a",
    "Larder": "cold section in the kitchen. pleasant taste in the mouth and do not compete with each other. Lavash bread - soft pocket flat bread used in Labanese dishes. Heat Transfer Method of conversion of heat from one thing to another.",
    "Lavosh": "crispy bread pieces served with cheese. Ice cream a frozen dessert.",
    "Leek": "large stalk vegetable of the onion Ice slurry mixture of crushed ice and water. family.",
    "Mandoline": "a tool used in the kitchen for Paring knife - a knife used for turning, slicing vegetables. trimming and peeling. Maple",
    "Syrup": "sap of the maple tree.",
    "Palatable": "having appealing flavors and taste.",
    "Mixing": "to combine different ingredients.",
    "Pathogens": "Bacteria which cause diseases.",
    "Mayonnaise": "a cold emulsion sauce made",
    "Paysanne": "a basic vegetable cut in with egg yolks. approximately 10mm slices.",
    "Matignon": "a small mirepoix cut used for Quark cheese - is a type of cheese. short cooking time.",
    "Quiche": "German word means cake.",
    "Naan": "flat, slightly leavened bread, round or Quick bread - quick bread can be made oval in shape. quickly and easily.",
    "Nage": "Aromatic poaching liquid. Can be",
    "Quinoa": "a type of grain. vegetable or herb stock.",
    "Ragout": "a stew, as in beef ragout or ragout",
    "Napper": "to coat or mask a food item with fin. sauce.",
    "Raita": "a mixture of yogurt, cumin, vegetables",
    "Napolitaine": "garnish style referring to the and fruits. Italian town of Naples.",
    "Ratio": "the relationship on one ingredient to",
    "Navarin": "a brown stew made with diced another such as 1:2 in pastry mean 1 part lamb. butter and 2 parts flour.",
    "Oats": "a cereal grass cultivated for its edible",
    "Ravioli": "a variety of pasta that encases food seed. in pastry.",
    "Offal": "edible parts of animal excluding the Raw sugar - unrefined sugar appear much muscle meat, such as liver and kidney. like sugar.",
    "Okra": "A vegetable shaped like a cylinder.",
    "Sabayon": "egg yolks and liquid whipped and Open",
    "Sandwich": "a sandwich that is not cooked over a Bain – Marie. covered by a slice of bread and the filling is",
    "Saccharometer": "an instrument used to exposed. measure sugar density.",
    "Oregano": "Strong herb used in Italian",
    "Saffron": "the stamen of a crocus flower used cooking. for flavor and coloration.",
    "Paring": "trimming, as of meat or vegetables. Sailor style - garnish used for seafood with prawns and bacon.",
    "Salamander": "a grill operating with top heat",
    "Wedge": "shape of a potato cut on a slant with only. a triangle. Table d'hote - a meal with no or limited",
    "Wheat": "the grain of cereal grass used for choice, at a fixed price. food.",
    "Tahini": "a type of paste made up with sesame White chocolate - made with cocoa butter seeds. with the addition of milk, solids and sugar.",
    "Tempura": "Japanese batter used for deep - Wild",
    "Rice": "a native grass of North America. fried food. Xmas pudding - English specialty, also Thickening agents. - It helps to bind and called plum pudding, served at Christmas. thicken agent.",
    "Yogurt": "easily digested fermented milk Thyme an herb that is used in stocks, soups, product. sauces and meat dishes.",
    "Yeast": "microorganisms used in cooking to Universal rules - that can't be changeable. aerate food.",
    "Univalve": "a mollusc with one shell.",
    "Utensils": "tools used for cooking. Yeast extract - a mixture of yeast, salt and vegetable extract.",
    "Urchins": "a kind of invertebrates. Yams a root of a climber high in vitamin C Vanilla essence Flavor produced by and used like potato. dissolving vanilla pods in an alcoholic solution.",
    "Yabby": "a freshwater. Vanilla pod - The pods of a creeper.",
    "Zabaglione": "a foam- style dessert.",
    "Veal": "Young beef, calf. Zest the rind of citrus fruits.",
    "Vegan": "a person who does not eat any meat Zester a tool to remove zest from citrus fruits. products. Vegetable oil - oil that is derivative of a vegetable or seed. Wrapping sheet - a thin plastic sheet in which food is wrapped. 121"
  }
}